{"m_szDocID":"1031341","m_szDocTitle":"Autolib'. Eco","m_szYear":"2016","m_szDocSumamry":"Be kind - we're currently a work in progress. Come back soon to see us become awesome. About Share your spare The Share Collection Global Sharing Week Contact Discover About Share your spare The Share Collection Global Sharing Week Contact Reports Share Guide Donate Get involved Autolib' Make a enquiry 1 2 3 4 5 Category: Eco Transport Sub-Category: Environment ,Car Sharing Company Information Electric vehicle rental program based in France. Contact and Access Headquarters 2 place des Cordeliers Lyon BP 2105 – 69226 Country: France Online http://www.autolib.fr https://www.facebook.com/lpa.citi","m_szDocBody":"kind work progress back awesome share spare share collection global sharing week contact discover share spare share collection global sharing week contact report share guide donate involved autolib make enquiry category eco transport subcategory environment car sharing company information electric vehicle rental programme based france contact headquarter place des cordelier lyon country france online made brighton tonne people share benita matofska contact media cookie policy discover blog share spare share collection share guide sharing involved global sharing week supporter partner sponsor donate job career corporate sharing economy consultancy signup signing agree compare share term condition member log signing agree compare share term condition member log enquiry you enquire sent make enquiry","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.thepeoplewhoshare.com/sharing-economy-guide/listing/eco/Autolib/","m_Places":["France","Lyon","Made","Brighton","Uk"],"m_People":["Benita Matofska"],"m_Companies":["Bp","Facebook","Twitter"],"m_BiGrams":["share spare","spare share","share collection","global sharing","sharing week"],"m_TriGrams":["global sharing week"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":110}
