{"m_szDocID":"1067611","m_szDocTitle":"Zipcar | Fast Company | Business + Innovation","m_szYear":"2016","m_szDocSumamry":"Subscribe Collections The Most Innovative Companies The top 50 companies in entertainment, media, sports, technology, and more. Most Creative People Meet this year's inspiring leaders. Innovation By Design A showcase for ingenious design solutions. World Changing Ideas New workplaces, new food sources, new medicine—even an entirely new economic system. Master Class How the top talent from creative fields get work done. Fast Forward Created for and commissioned by Workday. Startup Report The up-and-coming companies that are disrupting industries. Conquering The Cloud Created for and commissio","m_szDocBody":"collection innovative company top company entertainment media sport technology more creative people meet year inspiring leader innovation design showcase ingenious design solution world changing ideas workplace food source medicineeven economic system master class top talent creative field work done fast forward created commissioned workday startup report upandcoming company disrupting industry conquering cloud created commissioned ibm height created commissioned adobe closer created commissioned hpe master marketing created commissioned steelhouse current follow fast company you edit edit post revision post promo unit macro quiz bracket admin panel slate technology leadership zipcar consumer creativity transforming travel experience ride mind helmet hair scoot network expand san francisco zipcar philosophy power profuse apology face customer complaint sharing economy destroy brand zipcar sharing economy growing anya kamenetz minute read peak car conundrum peter graf gil perez minute read avis budget car buy zipcar million nina mandell minute read electric car future car sharingyet ariel schwartz minute read latest local deal provider car christina chaey minute read bikesharing programme let lock bike ariel schwartz minute read advertise privacy policy term fast company mansueto venture llc","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://www.fastcompany.com/tag/zipcar","m_Places":["Most","United States"],"m_People":["Anya Kamenetz","Peter Graf","Gil Perez","Nina Mandell","Ariel Schwartz","Christina Chaey"],"m_Companies":["Ibm","Adobe","Fast Company","Zipcar","Philosophy","Avis"],"m_BiGrams":["minute read","created commissioned"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,5],"m_TriCnt":[],"m_iDocBodyWordCnt":177}
