{"m_szDocID":"1078232","m_szDocTitle":"Business Digest: Austin gasoline prices rise 3 cents this week | www.mystatesman.com","m_szYear":"2016","m_szDocSumamry":"Business Digest: Austin gasoline prices rise 3 cents this week Posted: 3:18 p.m. Thursday, June 9, 2016 FUEL Austin gasoline prices rise 3 cents this week Austin-area gasoline prices continued their recent climb, rising 3 cents this week, according to auto club AAA Texas. The average local price for a gallon of regular unleaded gasoline is $2.12, AAA Texas said. Since dropping to $1.50 per gallon during the week of Feb. 25, local prices have risen an average of 62 cents per gallon. The current average of $2.12 per gallon is 38 cents lower than the same week last year, when the average price wa","m_szDocBody":"business digest austin gasoline price rise cent week posted thursday fuel austin gasoline price rise cent week austinarea gasoline price continued recent climb rising cent week auto club aaa texas average local price gallon regular unleaded gasoline aaa texas said dropping gallon week feb local price risen average cent gallon current average gallon cent lower week year average price aaa texas texas whole average price gallon rose cent week aaa texas nationally average price gallon rose cent gasoline price typically increase heading summer travel increase driving demand mortgage industry average rate year loan slip washington longterm mortgage rate fell week straight week increase drop surprisingly weak employment report deepened doubt economy mortgage buyer freddie mac average year fixedrate mortgage slipped percent percent week level year ago percent average rate year fixedrate mortgage declined percent percent calculate average mortgage rate freddie mac survey lender country beginning week average doesnt include extra fee point borrower pay lowest rate point equal percent loan amount automaker tesla selling lowerpriced version model tesla started selling cheaper version model car attempt make electric vehicle affordable people version called model start allwheel drive version model start cost current model start tesla tax incentive gassaving account model effective cost company model travel mile charge top speed mile hour palo alto califbased tesla motor inc taking order model delivery month website economy rising home price lift net worth washington american household wealth rose month year home value increased offsetting drop stock price federal reserve household net worth increased percent trillion quarter american stock mutual fund portfolios shrank billion home value jumped billion saving certificate deposit bank account rose rise real estate value mean wealth increase widely shared previous quarter home ownership primary source middleclass wealth richer american rely financial asset greater household wealth boost consumer spending drive percent economy accelerate economic growth american typically spend bit wealthier household wealth net worth reflect home stock asset minus mortgage credit card debt borrowing fed figure arent adjusted population growth inflation popular ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.mystatesman.com/news/business/business-digest-austin-gasoline-prices-rise-3-cent/nrdCC/","m_Places":["Austin","Texas","Washington","U.s.","Tesla","Palo Alto, Calif."],"m_People":[],"m_Companies":["Aaa","Freddie Mac","Tesla Motors Inc.","The Federal Reserve"],"m_BiGrams":["gasoline price","cent week","aaa texas","price gallon","average price","version model","model start","net worth","household wealth"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,4,3,3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":330}
