{"m_szDocID":"1394279","m_szDocTitle":"It’s time to give the power of power to the people | Newcastle Herald","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Let’s take the power to the people Chris Cooper June 20, 2016, 10 p.m. The foundations have been laid for the greatest transformation of our energy system since electrification. REVOLUTION: We need to lower the costs of solar and storage even further so that it’s a ‘no-brainer’ investment for residents. Our society has benefited enormously from access to cheap coal. Indeed, Newcastle is built on the back of this plentiful energy resource. However, in the last decade the unthinkable happened. The socket price for coal-fired electricity doubled and the installed ","m_szDocBody":"let power people chris cooper foundation laid greatest transformation energy system electrification revolution lower cost solar storage nobrainer investment resident benefited enormously cheap coal indeed newcastle built back plentiful energy resource however decade unthinkable happened socket price coalfired electricity doubled installed cost solar power dropped overnight million australian household installed solar motivated economic sustainable energy foundation laid greatest transformation energy system electrification australia golden opportunity lead way potential shift starting remarkably similar great disruption internet internet information small number powerful centralised source media government encyclopaedias abundant information create content greatest decentralisation power world seen now energy suit accelerated arrival affordable energy storage lithium ion battery cost falling dramatically driven consumer electronic electric vehicle point economic solar storage home household owneroperator minibaseload power station supply home dispatch energy grid revolutionary concept big implication energy business model example connecting mini solar power station together everyday people active player energy market already australian startup reposit power aggregating household paid provide grid service sort software connect household virtual large scale solar power plant sell wholesale market decade trade energy neighbour peertopeer marketplace dawn sharing economy energy consumer prosumer enabled software motivated economic empowered smarter cleaner thing year lucky travel world part winston churchill fellowship journey met thevisionary planting seed energy revolution learned thetechnology service disruption dont however deployment critical ramp uptake andtake technology masse lower cost solar storage nobrainer investment improve customer experience eliminating complexity increasing transparency unfortunately average joe shopping solar bombarded jargonheavy technical language dodgy salesperson talk time change newcastle city hall climate action newcastle suncrowd launching australias community bulkbuy home energy storage aim make easy affordable adopt important technology invited active role energy future development internet wont politician people create change need chris cooper founder suncrowdwho partnering climate action newcastle community bulkbuy campaign solar storagenewcastlesuncrowdcomau ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://www.theherald.com.au/story/3980346/its-time-to-give-the-power-of-power-to-the-people/?cs=308","m_Places":["Newcastle","Australia"],"m_People":["Chris Cooper","Winston Churchill"],"m_Companies":["Revolution","Indeed","Energy Future"],"m_BiGrams":["cost solar","solar storage","solar power"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":294}
