{"m_szDocID":"1553957","m_szDocTitle":"4 Scenarios For The Future Of Transportation | Co.Exist | ideas + impact","m_szYear":"2016","m_szDocSumamry":"4 minute read 4 Scenarios For The Future Of Transportation Self-driving cars manage to backfire on Los Angeles and cause even more traffic. Meanwhile, New Jersey has invested in public transit and become a commuters' paradise. 01 /04 Predictions for the future normally see cities becoming more compact. But Atlanta does the opposite: It sprawls even more. 02 /04 Driving, always difficult in L.A. during rush hours, has become a round-the-clock disaster. Self-driving cars, which were supposed to make roads more efficient, haven't helped. 03 /04 In the early 2020s, New Jersey is hit with five succ","m_szDocBody":"minute read scenarios future transportation selfdriving car manage backfire los angele traffic meanwhile jersey invested public transit commuter paradise prediction future city compact atlanta opposite sprawl more driving difficult rush hour roundtheclock disaster selfdriving car supposed make road efficient helped early jersey hit successive season extreme weather make hurricane sandy light gale road infrastructure destroyed reinvest public service boston compact people flock microapartment downtown embrace sharing economy walking default around ben schiller atlantas transportation system automated car failed solve los angeless traffic problem driving handsfree nightmare jersey fleet smart buse ondemand jitney boston hyperdense people live downtown microapartment walking cycling year innovation uber selfdriving car reinvent road transit system freight logistic network function report york university rudin centre transportation policy management consequence strange farreaching force driving government tax dollar say smartphone private enterprise remake transportation degree expansion interstate highway system call process reprogramming mobility study written nyus anthony townsend say lieu large civil infrastructure project transportation system increasingly augmented range information technology make smarter safer efficient integrated scenarios report sketches out atlanta google plaything prediction future city compact atlanta opposite report author foresee sprawling more reason solar panel people suburb charge electric vehicle cheaply provide power city centre turn sprawl perfect distributed power generation reason influence google make atlanta testbed selfdriving car integrated product waze nest fibre map strike publicprivate partnership georgia department transportation run groad selfdriving pod then pushes automation transport starting freight adopt platooning efficient human driving that short hop building suburban parking garage hail ride phone drive meet you until gradually people groad superior public network tax revenue low plummet start consensus building washington bold plan pitched rebuild nation entire surface transportation network technology solar power electric propulsion autonomous operation los angele selfdriving bad driving difficult rush hour roundtheclock disaster selfdriving car supposed make road efficient helped made worse range competing standard stop car cooperating worst driver elderly assisted continue manual driving driver rarely forget drive result chaos rethinking selfdriving prompting rest country same considered risk incomplete automation planner way accelerate adoption technology avoid stuck transition jersey transit paradise early jersey hit successive season extreme weather make hurricane sandy light gale road infrastructure destroyed reinvest public service smart buse talk transit advocate everywhere report alongside existing rail system network fullyautonomous buse deployed ehailed local jitney ferrying rider regional highspeed bus rapid transit corridor built existing highway arterial road system run prediction scheduler allocate seat adjust price early passenger book buse platooned course employer discourage commuting cut congestion weather factor shift buse young suburbanite car money love social transit boston walking king unlike atlanta boston compact people twenty thirty flock microapartment downtown embrace sharing economy walking default around city street pedestrianised converted bike lane delivery made night people asleep outsider arrangement unsettling kind bourgeois evolution occupy movement city operating giant encampment consumer economy replaced giant lending library america looked derision young bostonian living sustainably nation read full report full ideas true possibility that actual prediction point townsend say slideshow credit terence jone newsletter ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.fastcoexist.com/3036598/4-scenarios-for-the-future-of-transportation","m_Places":["Los Angeles","Meanwhile, New Jersey","Atlanta","L.a.","New Jersey","Boston","Washington","America"],"m_People":["Ben Schiller","Anthony Townsend","Terence S. Jones"],"m_Companies":["2020s","Google","Uber","New York University","Nyu","Georgia Department Of Transportation","Flickr"],"m_BiGrams":["selfdriving car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5],"m_TriCnt":[],"m_iDocBodyWordCnt":495}
