{"m_szDocID":"1624315","m_szDocTitle":"Safeguard Mechanism Research for Effective Implementation of Energy Tax Policy Reform","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- Home > Advanced Materials Research > Energy Research and Power Engineering 2014 > Safeguard Mechanism Research for Effective... Paper Title: Safeguard Mechanism Research for Effective Implementation of Energy Tax Policy Reform   Abstract Energy tax policy has an irreplaceable role in promoting conventional energy conservation, sustainable use and promotion of new energy sources. But China's current energy taxes still has many problems and needs an energy tax reforms. The effective implementation of the energy tax policy reform must have relevant supporting mech","m_szDocBody":"homeadvanced material researchenergy research power engineering safeguard mechanism research effective paper title safeguard mechanism research effective implementation energy tax policy reform energy tax policy irreplaceable role promoting conventional energy conservation sustainable promotion energy source chinas current energy taxe problem energy tax reform effective implementation energy tax policy reform relevant supporting mechanism ensure implementation policy analyse behavioural characteristic tradeoff involved policyrelated aspect achieve establishment safeguard info add cart periodical advanced material research volume main theme energy research power engineering chapter chapter power system energy engineering application edited fan wang liu xie chen page wang song safeguard mechanism research effective implementation energy tax policy reform advanced material research vol online author ming song liu keyword energy tax local government tax game analysis export ris bibtex price share preview add cart related article analysis development chinese regional economy countermeasure author shu guang wang xiang xin jin chapter energy vehicle electric vehicle abstractrevitalizing regional economy economic development basic strategy country financetaxation policy main tax policy promote development lowcarbon economy author wei zhou wei zhang ling chapter ecological civilization lowcarbon economy abstractthis point rely tax policy create lowcarbon economy china improve chinas tax system promote analysis improvement environmental tax china author cheng wang min chapter environmental engineering abstractwith continuous development chinas industrialization process economic ecological environmental problem become datexpath wang song safeguard mechanism research effective implementation energy tax policy reform advanced material research vol ","m_szGeo1":"Switzerland","m_szSourceType":"source_academic","m_szSrcUrl":"http://www.scientific.net/AMR.986-987.516","m_Places":["Reform","China"],"m_People":["Li Cheng Wang","H.d. Liu","Z.j. Xie","Yang","M. Y. Wang","Yang Song","Shu Guang Wang","Xiang Xin Jin","Zhou, Wei","Zhang, Ling","Min Wang"],"m_Companies":["Ji","Liu He Ji"],"m_BiGrams":["energy tax","tax policy","safeguard mechanism","mechanism research","research effective","effective implementation","implementation energy","policy reform","advanced material","material research","lowcarbon economy"],"m_TriGrams":["energy tax policy","safeguard mechanism research","mechanism research effective","effective implementation energy","implementation energy tax","tax policy reform","research effective implementation","advanced material research"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,7,4,4,4,4,4,4,3,3,3],"m_TriCnt":[5,4,4,4,4,4,3,3],"m_iDocBodyWordCnt":229}
