{"m_szDocID":"1707119","m_szDocTitle":"U.S. SEC sets penalties in two corporate fraud cases | Daily Mail Online","m_szYear":"2012","m_szDocSumamry":"dateText -------------------- Published: 15:02 EST, 19 April 2016  Updated: 15:02 EST, 19 April 2016  textArticle -------------------- U.S. SEC sets penalties in two corporate fraud cases  By Reuters  Reuters  Published: 15:02 EST, 19 April 2016 | Updated: 15:02 EST, 19 April 2016  By Jonathan Stempel  April 19 (Reuters) - The U.S. Securities and Exchange Commission announced two fraud cases alleging that accounting failures left investors in the dark about the finances of computer accessories maker Logitech International SA and now-defunct electric car battery maker Ener1 Inc.  \"We are intens","m_szDocBody":"published est updated est sec set penalty corporate fraud case reuter reuter published est updated est jonathan stempel reuter security exchange commission announced fraud case alleging accounting failure left investor dark finance computer accessory maker logitech international nowdefunct electric car battery maker ener inc intensely focused company officer evaluate judgmental accounting issue good faith based gaap generally accepted accounting principle andrew ceresney head sec enforcement division statement tuesday logitech agreed pay million penalty settle charge inflated fiscal result meet earning guidance committed accounting violation year culminating restatement chief financial officer erik bardman acting controller jennifer wolf charged minimising inventory writedown slowselling settop device felt substantial pressure meet guidance logitech chief executive officer gerald quindlen accused misconduct returned incentive pay stock sale profit sec said executive agreed pay small fine ener case sec company overstated revenue asset late early failed needed writeoff think norwegian electric car maker major customer ceo charle gassenheimer cfo jeffrey seidel chief accounting officer robert kamischke pay respective fine sec said pricewaterhousecooper official helped audit ener agreed twoyear suspension auditing public company settling defendant admitted wrongdoing logitech declined discuss accord wolf lawyer bill kimball client did required professional accounting standard forward proving litigation lawyer ener bardman gassenheimer respond request comment logitech based apple switzerland office newark california make computer product mice keyboard speaker ener filed chapter bankruptcy demise customer solar panel maker solyndra llc previously received million department energy grant make lithiumion battery electric car lawsuit bardman wolf seek civil fine recouping illgotten gain bonuse ban serving officer director public company reporting jonathan stempel york editing cynthia osterman meredith mazzilli datemeta ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.dailymail.co.uk/wires/reuters/article-3548492/U-S-SEC-sets-penalties-two-corporate-fraud-cases.html","m_Places":["Est","Switzerland","New York"],"m_People":["Jonathan Stempel","Andrew Ceresney","Erik Bardman","Gerald Quindlen","Charles Gassenheimer","Jeffrey Seidel","Robert Kamischke","Meredith Mazzilli"],"m_Companies":["U.s. Sec","Reuters","U.s. Securities And Exchange Commission","Logitech International Sa","Ener1 Inc.","Sec","Pricewaterhousecoopers","Solyndra Llc.","Department Of Energy"],"m_BiGrams":["electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":264}
