{"m_szDocID":"1719494","m_szDocTitle":"Robotic taxis to replace cars: analyst - Chicago Tribune","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Robotic taxis to replace cars: analyst Driverless cars Kagan McLeod / For the Times Hidden under hoods and dashboards at the L.A. Auto Show are sensors that take the first steps toward autonomous driving. Hidden under hoods and dashboards at the L.A. Auto Show are sensors that take the first steps toward autonomous driving. (Kagan McLeod / For the Times) Jerry Hirsch Auto industry on verge of deep disruption that will shift car ownership to shared autonomy, analyst says. The automotive industry is entering a period of deep disruption that will make it unrecogni","m_szDocBody":"robotic taxis replace car analyst driverless car kagan mcleod time hidden hood dashboard auto show sensor step autonomous driving hidden hood dashboard auto show sensor step autonomous driving kagan mcleod time jerry hirsch auto industry verge deep disruption shift car ownership shared autonomy analyst say automotive industry entering period deep disruption make unrecognisable analysis morgan stanley auto industry centuryold ecosystem ogled player hungry slice trillion mobility marketwarn adam jonas lead auto analyst morgan stanley research many beginning wont stop experimenting robotic car tech giant apple reportedly eyeing electric car market upstart tesla motor slowly building business selling electric car report investor jonas wrote important technological trend automotive transportation sharing economy autonomous driving trend fuse call shared autonomy essentially world competing robotic taxi service promoted storey chattercom network jonas boiled massive change automotive world face chart quadrant phase disruption horizontal axis illustrate transition individual vehicle ownership era car shared asset vertical axis show transition human robotic driving quadrant represent auto industry model year jonas said hightech limited gadget driver convenience entertainment current phase auto manufacturer globally steal market share other software pretty minimal accounting automobile car hour day idle parking space garage time car estimate world underutilised asset disruptable business earth adam jonas lead auto analyst morgan stanley car estimate world underutilised asset jonas said disruptable business earth quadrant show people starting uber service slowly relinquish ownership control car era taxis including socalled carsharing service uber cheap rich people car hundred entrant fleet management business jonas said biggest impact felt dense megacity support service quadrant depict people give control automobile computer steering wheel pedal time phase car owned individual rising competition megafleet manager operating humandriven vehicle automated driving feature gain momentum jonas said time benefit improvement vehicle safety efficiency morgan stanley chart chart morgan stanley research map end human driving chart morgan stanley research map end human driving morgan stanley research finally quadrant depict shared autonomy jonas envision roving fleet completely autonomous vehicle operation hour day smartphone individual transportation cost mile fall low cent mile roughly traditional taxi jonas said automated taxi system launched megacity developed country spread close suburb connected city hubandspoke network autonomous highway jonas said human driving face obstacle law permit select areas public road finally huge swath real estate parking lot garage home businesse put back productive commerce jonas call predicted era autopia datemeta ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.chicagotribune.com/classified/automotive/chi-robotic-taxis-to-replace-cars-analyst-20150407-story.html","m_Places":["L.a.","Jonas"],"m_People":["Jerry Hirsch","Adam Jonas"],"m_Companies":["Morgan Stanley","Slice","Google","Apple","Tesla Motors","Uber"],"m_BiGrams":["morgan stanley","jonas said","stanley research","autonomous driving","auto industry","shared autonomy","human driving"],"m_TriGrams":["morgan stanley research"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,6,4,3,3,3,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":387}
