{"m_szDocID":"1748670","m_szDocTitle":"Where is the future of money headed? Here are things you should know – Jewish Business News","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Where Is the Future of Money Headed? Here Are Things You Should Know By Contributing Author If you hate banks, or quickly get bored when discussions about finance come up, you are not alone. The day to day activities in the financial world are either very mundane or complicated to many looking in from the outside. However, the events in the financial sector matter to everyone, especially in the light of happenings in 2008, Brexit and so on. Making money, saving money, spending money and growing money is integral to everything we do today.  So what does the futu","m_szDocBody":"future money headed contributing hate bank quickly bored discussion finance alone day day activity financial world mundane complicated outside however event financial sector matter everyone light happening brexit making money saving money spending money growing money integral today future hold finance sector look importance middle man diminish financial middleman role rapid decline continue digital cryptocurrency crowdfunding lending peer peer finance grown great deal stronger future learnt digitization sector shake internet play time finance sector shakeup fairly definitive collaboration finance sector witnessing disruption intervention technology big player anytime soon partnership growing expert industry expect continue future left lurch big company buying partnership startup collaborating customer themselve allowed stay relevant tech revolution future expect good number businesse newer modern face and ultimately processe anonymous spending prominent privacy extremely important general public people embracing financial development fund live leaving digital trail reason payment solution paysafe bitcoin paypal purchase risking private information credit card detail exposed bingo site player choose paypal bingo site listed apply people making routine purchase ecommerce shop future credit card statement longer hold information individual spending habit today insurance slightly ripple effect technology sector hit insurance sector soon electric car autonomous car gradually coming fore and mainstream expected casualty figure damage longer today insurance firm forced restrategise operation show seemingly unrelated technology alter finance sector driverless electric car earlier pinpoint detection hazard increasing lifespan efficient algorithm based retirement planning improving solar energy technological advancement ripple effect insurance finance sector general certain future money intriguing hugely reliant internet improving technology july published mon ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://jewishbusinessnews.com/2016/07/11/where-is-the-future-of-money-headed-here-are-things-you-should-know/","m_Places":[],"m_People":[],"m_Companies":["Revolution","Paypal","Lifespans"],"m_BiGrams":["finance sector"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5],"m_TriCnt":[],"m_iDocBodyWordCnt":252}
