{"m_szDocID":"1753718","m_szDocTitle":"Chanos got China right. Now he's betting against Elon Musk - Oct. 8, 2015","m_szYear":"2009","m_szDocSumamry":"textArticle -------------------- Chanos got China right. Now he's betting against Elon Musk by Matt Egan   @mattmegan5 October 8, 2015: 1:15 PM ET The China bear's victory lap: Jim Chanos Jim Chanos was betting against China long before it became the trendy thing to do. As early as 2009 Chanos correctly realized China's debt-fueled economy wasn't all it was cracked up to be. Back then it was a lonely call for the man who famously predicted Enron's downfall. China, with its explosive growth, was among the brightest spots in the world. Today his call looks brilliant. China's current economic slo","m_szDocBody":"chanos china right betting elon musk matt egan china bear victory lap jim chanos jim chanos betting china long trendy early chanos correctly realised chinas debtfueled economy cracked back lonely call man famously predicted enron downfall china explosive growth brightest spot world today call brilliant chinas current economic slowdown striking fear heart investor world struggling mightily transform manufacturing infrastructurefueled economy built consumer that transition lot rockier people think chanos told cnn poppy harlow week booklined conference room midtown manhattan office interview chanos wore pair cufflink made yuan chinas currency aha moment aha moment chanos real estate expert told china stunning billion square metre real estate development surely mustve mistake chanos thought amounted billion square feet figured fivefootbyfivefoot office cubicle man woman child asia said after made decision bet china chanos big negative position energy commodity company rely asian giant citing regulatory requirement chanos declined give specific money made short china its profitable profitable said chinas debtfueled growth unsustainable chanoss specialty short selling betting stock fall disturbed amount government debt china accumulated year are basically year chanos founder kynikos associate billion hedge fund chanos argue kind debtfueled growth backfired past pointing japan late betting natural gas chanos betting commodity company banking china succeed believe natural gas turn massively oversupplied iron ore copper coal even demand korea japan china tsunami supply coming price low make plan uneconomic chanos said month chanos told cnbc think lng space looming disaster short position cheniere energy cqh related crack emerge oil boom casinos watch chanos negative casino company exposure macau chinas gambling mecca slammed country anticorruption drive company watch future due chinese president jinping puritanical nature people gambling chanos said macau hong kong special administrative region china place china gambling legal chinas leader worry bit chanos concerned chinas leadership broadly keep mind dealing totalitarian state chanos said they control media chanos argued government role inflating stock market bubble attempt limit ensuing bust hurt credibility beijing meanwhile intervention prevent massive panic jim chanos explain shorting tesla betting elon musk chanos afraid call tech visionary elon musk called musk tesla tsla car great product chanos worry electric car maker boutique car maker transform mass market one sell million car stock valued long chanos said knocked solarcity scty renewable energy company musk cofounded its consumer finance company good one chanos said chanos shorting valeant pharmaceutical vrx company criticised recent political firestorm buying drug hiking price chanos argue bigger part business valeant admit cnnmoney new york published ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://money.cnn.com/2015/10/08/investing/jim-chanos-china-elon-musk/index.html","m_Places":["China","Asia","Japan","Korea","United States","Macau","Hong Kong","Beijing","Tesla"],"m_People":["Jim Chanos","Elon Musk","Matt Egan","Poppy Harlow","Xi Jinping"],"m_Companies":["Enron","Cnn","Manhattan Office","Kynikos Associates","Cnbc","Cheniere Energy","Cqh","Solarcity","Scty","Company Musk Co","Cnnmoney","New York"],"m_BiGrams":["chanos said","elon musk","jim chanos"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":407}
