{"m_szDocID":"1758883","m_szDocTitle":"The Curious Case Of Revealing Saudi Arabia's Treasury Holdings | Seeking Alpha","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- The Curious Case Of Revealing Saudi Arabia's Treasury Holdings May 18, 2016  5:56 PM ET | Fundamental Trends On Monday, May 16, the U.S. Treasury revealed for the first time the amount of government debt held directly by Saudi Arabia. The amount reported was $116.8 billion, which is far less than many expected. Interestingly, the accompanying chart from Bloomberg shows that direct Saudi Treasury holdings have been on a steady rise upward in the past decade. The relatively low amount of direct holdings, in light of Saudi Arabia's recent threat to sell three-quar","m_szDocBody":"curious case revealing saudi arabias treasury holding fundamental trend monday treasury revealed time amount government debt held directly saudi arabia amount reported billion expected interestingly accompanying chart bloomberg show direct saudi treasury holding steady rise upward past decade low amount direct holding light saudi arabias recent threat sell threequarter trillion dollar asset suggest country hold substantial debt nondirect account amount roughly half opec oilproducing nation held directly aggregate treasury united arab emirate billion kuwait billion presume saudi arabia treasury debt appear certainty held similarly china hold debt thirdparty custodial account china widely believed hold foreign reserve account belgium question mind information finally released now request information made bloomberg request made year avail back month predicted fall price oil but extent suggested saudi arabia sort strange bedfellow regard oil market suggested asserting saudi arabia attack largely staged support saudi arabian belief george bush stated fighting terrorism long war meant people believed sequence event george bush invade iraq remove barrier named saddam hussein iran saudi arabia installing saddam hussein supporting conflict iran designed prevent iran threatening alley time saudi arabia shale drilling operation beginning drill play shale starting make significant impact oil market president obama slow down pundit predicted summer tesla nasdaq tsla model introduced representing consumer pitch electric vehicle shot saudi bow shale prolific import opec oil plunged saudi arabia abandon oil price target increase oil production people make mistake saudi arabia acting destroy american shale oil impossible destroy shale industry oil there cost extract oil drilled small project big tight time schedule inventoried future extraction duc drilled uncompleted well true oil industry bankrupt however prevent shale oil drilling rebounding oil price rise company drill shareholder place private company happen though drilling free cash flow conservative financing conservative financing aggressive financing left pounding bank investor taken production forward drill baby drill been oil segment saudi arabia crushed intermediate term forever deepwater oil sand type drilling require large lead time major capital commitment decade breakeven financially financing sort project left shale major carnage occurred capp canadian petroleum producer projection canadian oil sand fallen dramatically forward continue declining project shelved capp predicted oil sand production grow mbd mbd cut mbd sery project cancellation company including suncor nyse royal dutch shell rdsa rdsb estimate continue falling capp forecast reality keystone pipeline vital oil sand development built deepwater drilling spared either company apache nyse apa conocophillip nyse cop devon nyse dvn completely cancel deepwater drilling forward exxon mobil nyse xom chevron nyse cvx reduced offshore drilling addition oil sale arctic atlantic region cancelled outright government wood mackenzie billion deepwater project cancelled project delayed project believe danger cancellation saudi arabia increase production short intermediate term releasing saudi arabia treasury data well this petrodollar matter anymore decade united state saudi arabia special relationship based mutual interest relationship mutual certainly saudi arabia destroy oil sand deepwater oil industry core reason reason cheap oil gas stimulus needed economy recover recent year small believe slow growth forever economy forward clear monetary policy world depression expect recession decade end cheap oil helped world solid footing reason decade oilfueled car united state sell oil higher price year depletion whittle deepwater production replaced sure oil shale retrenching stretch run covered forum company interested major final reason barack obamas environmental legacy flooding world oil saudi arabia effectively guaranteed oil sand deepwater oil dramatically reduced time electric vehicle kill oil eventually elon musk dramatic advancement model timeline government prodding there post ultimately releasing saudi treasury data care hide anymore longer benefit promise keep concerned saudi arabia toe line set forward buy weapon fight iranianbacked rebel benefit releasing data mystery potentially made harder manipulate currency direction both eye data dollar trade somewhere ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://seekingalpha.com/article/3976156-curious-case-revealing-saudi-arabias-treasury-holdings","m_Places":["Saudi Arabia","United States","United Arab Emirates","Kuwait","China","Belgium","Iraq","Iran","Tesla","Well","Deepwater"],"m_People":["George W. Bush","Saddam Hussein","Barack Obama","Elon Musk"],"m_Companies":["Treasury","U.s. Treasury","Saudi Treasury","Opec","U.s. Treasuries","Nasdaq","Canadian Association Of Petroleum","Royal Dutch Shell","Apache","Apa","Conocophillips","Devon","Exxon Mobil","Chevron","Atlantic","U.s. Government","Wood Mackenzie","Saudi Arabia U.s. Treasury"],"m_BiGrams":["saudi arabia","oil sand","deepwater oil"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[15,6,3],"m_TriCnt":[],"m_iDocBodyWordCnt":606}
