{"m_szDocID":"1761565","m_szDocTitle":"The Worst General Motors Company Headlines in 2015 - SFGate","m_szYear":"2015","m_szDocSumamry":"The Worst General Motors Company Headlines in 2015 John Rosevear, The Motley Fool Published 1:00 pm, Wednesday, December 23, 2015 Strong sales of new SUVs, like the Buick Envision, have so far helped offset an overall sales slump in China. But GM's exposure to the slowing Chinese market was one of several concerns we raised about the General in 2015. Image source: General Motors. General Motors  had a good year in 2015, all things considered. While the stock didn't take off, GM reported solid earnings and strong sales of its most-profitable products in both the U.S. and China. Even better for ","m_szDocBody":"worst general motor company headline john rosevear motley fool published wednesday strong sale suvs buick envision helped offset sale slump china gms exposure slowing chinese market concern raised general image source general motor general motor good year considered stock off reported solid earning strong sale mostprofitable product china investor longerterm perspective ceo mary barra team continued make good progress plan significantly boost gms earning power early decade general notsogood storey tracked motley fool past year tough question strong truck sale led analyst report nice result quarter general million net profit estimate stock quickly dropped new happened unfavourable and unanticipated exchangerate move hurt sharp drop south american auto sale brazil fell deep recession general motor earn profit toyotas gms massive presence china bright light general year great success storey chinas newcar market slowing earlier year spent time worrying badly affect gms bottom line badly china slowdown hurt general motor turned out good sale higherprofitmargin suvs helped offset slowdown sale gms china profit strong china continue worry investor head concern looming good auto sale recent month reason market near cyclical peak sale stay strong year more automaker temptation discount sale gain irresistible credit disciplined incentive year profit margin north america outstanding part newfound conservative approach discount boost discount stay competitive aggressive rival cut margin concern looked back february expect revisited year two reason general motor company stock fall gms rush embrace advanced technology good thing part set introduce electric car chevrolet bolt expected mile range price big step forward affordable electric car price partner chem essentially codeveloper bolt supplying battery supplying entire powertrain instrument cluster major component upcoming chevrolet bolt electric car include lot part developed manufactured partner chem image source general motor raise question raised earlier year dependent hightech partner key system car risk losing soul simply commodity manufacturer platform technology other point arrived yet gms car plenty gmness them expect topic discuss year respect general motor billiondollar isecret world biggest tech company forgot show recent event wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them worst general motor company headline originally appeared foolcom john rosevear own share general motor motley fool recommend general motor foolish newsletter service free day fool hold opinion diverse range insight make investor motley fool disclosure policy copyright motley fool llc right reserved motley fool disclosure policy ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/fool/article/The-Worst-General-Motors-Company-Headlines-in-2015-6718193.php","m_Places":["China","United States","Brazil","Toyota","North America","Wall Street"],"m_People":["John Rosevear","Mary Barra"],"m_Companies":["General Motors Company","Motley Fool","General Motors","Hurt General Motors","Reasons General Motors Company","Lg Chem","Lg","Revolution","Motley Fool, Llc."],"m_BiGrams":["general motor","motley fool","motor company","electric car"],"m_TriGrams":["general motor company"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[11,6,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":395}
