{"m_szDocID":"1762626","m_szDocTitle":"Harker: Fed should slow rate hikes til late 2016 (Updated)","m_szYear":"2008","m_szDocSumamry":"textArticle -------------------- Harker: Fed should slow rate hikes til late 2016 (Updated) Updated: February 16, 2016 — 8:57 AM EST Joseph N. DiStefano Staff Writer Joseph N. DiStefano writes about Philadelphia-area enterprise, and the people and money that make it go.  More by Joseph N. DiStefano Arrow icon Patrick Harker, President of the Federal Reserve Bank of Philadelphia, returned to the University of Delaware, which the former Wharton Dean ran as President until last year, and told a crowd of bankers, UD bosses and business leaders at the yearly UD Economic Forecast that Philadelphia e","m_szDocBody":"harker fed slow rate hike til late updated updated est joseph distefano staff writer joseph distefano write philadelphiaarea enterprise people money make joseph distefano arrow icon patrick harker president federal reserve bank philadelphia returned university delaware wharton dean ran president year told crowd banker bosse business leader yearly economic forecast philadelphia employer face hiring shortage skilled worker economic growth slow bit given strong dollar falling stock weak china demand stop year fed fewer bigger rate hike starting fall ramping rate sooner harker served voting rotation corrected fed national policymaking body lined fed chair janet yellen relying economic data decide the timing interestrate hike contrast predecessor charle plosser openly sceptical fed power directly reduce unemployment lasting basis harker embraced unemployment inflation target legitimate fed goal predicted consumption grow year led housing business spending trailing predicted continued strength job growth more million net job year post highskilled profession eastern south jersey delaware harker heard lot employer lament difficulty finding worker anecdotal claim supported recent labour department job report expect wage grow faster year pay cumulative percent count inflation harker expect american start job again unemployment rate dropping end year blamed drop stock price winter worry china slow growth china trading partner added investment losse slow economy stop long run harker policymaker focus harker cited strong growth apartment rental home purchase warned strong growth business fixed investment strong dollar cut export demand manufacturer investment trail consumer spending growing inflation stay weak now discount low energy price sure said rise impact strong dollar price rise close fed yearly target tbe fed cutting target seldom met harker said firm planning raise wage job proving hard fill emphasised accelerating wage growth boost price negative inflation half year think price rise slowly year previously projected prove prudent wait inflation data stronger undertake rate hike harker added fall economy growing bit faster unemployment lower inflation rising policy normalise rate ise fewer rate hike fed apply delaware fighting maintain edge attracting retaining corporate headquarter harker said pointing the recent loss dupont stark reminder state hope rely education health service philadelphia fed researcher noted past school hospital grow fast region population harker puffed record bit noting watch chrysler plant turned star campus mix classroom industrial park home bloom energy fuel cell factory absorbed million delaware electricity user subsidy sevone aong electric vehicle cybersecurity programme published datemeta est","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.philly.com/philly/blogs/inq-phillydeals/368949501.html","m_Places":["Est","Philadelphia","United States","China","South Jersey","Delaware"],"m_People":["Patrick Harker","Joseph N. Distefano","Janet Yellen","Charles I. Plosser","Star Campus"],"m_Companies":["Bank Of Philadelphia","University Of Delaware","Ramping","Labor Department","Target","Dupont","Philadelphia Fed","Sevone"],"m_BiGrams":["rate hike","joseph distefano","strong dollar"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":386}
