{"m_szDocID":"1763421","m_szDocTitle":"China halves small-car purchase tax as deliveries slow - Chicago Tribune","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- China halves small-car purchase tax as deliveries slow Bloomberg SHANGHAI _ China slashed the purchase tax on smaller cars by half and permitted local governments to spend on speeding up the removal of aging vehicles after industrywide sales trailed the U.S. for the first time in almost six years. The tax cut on cars with engine displacement smaller than 1.6 liters is effective from Oct. 1 through the end of next year, and is part of measures announced Tuesday by the State Council to reduce energy consumption and impact on the environment. The central governmen","m_szDocBody":"china halve smallcar purchase tax delivery slow bloomberg shanghai china slashed purchase tax smaller car half permitted local government spend speeding removal ageing vehicle industrywide sale trailed time year tax cut car engine displacement smaller litre effective oct end year part measure announced state council reduce energy consumption impact environment central government penalise local authority lag adopting newenergy buse public transportation cutting fuel operational subsidy support measure chinas statebacked auto lobbied stimulus measure vehicle sale fell straight month stockmarket rout suggested government cut half percent tax vehicle purchase raise limit number car consumer buy accelerate replacement autos bolster demand build strong auto nation government boost demand shi jianhua deputy secretarygeneral china automobile manufacturer told reporter beijing earlier month vehicle demand close correlation economic growth infrastructure investment auto demand undermined effort pollution curb energy consumption tuesday announcement forbade local government restricting purchase operation electric vehicle reiterated support promoting newenergy vehicle battery development statement mentioned carsharing short term rental mode transportation china unleashed stimulus measure midst global financial crisis carbuying subsidy helped push country past annual sale consumer bought passenger vehicle chinese counterpart time year july sale data compiled bloomberg ward automotive china automotive information net datemeta ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.chicagotribune.com/news/sns-wp-blm-china-autos-4ddd7ad0-66aa-11e5-bdb6-6861f4521205-20150929-story.html","m_Places":["China","Shanghai","United States","Beijing"],"m_People":[],"m_Companies":["State Council","Ward's Automotive Group"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":195}
