{"m_szDocID":"1763116","m_szDocTitle":"The end of oil as we know it - SFGate","m_szYear":"2016","m_szDocSumamry":"http://www.businessinsider.com/the-end-of-oil-as-we-know-it-2016-4?utm_source=hearst&utm_medium=referral&utm_content=allverticals The end of oil as we know it Linette Lopez, provided by Published 7:34 am, Monday, April 25, 2016 Reuters Oil has crashed. But a short-term drop in the price of oil is nothing compared with the end of demand for oil as we know it. The more extreme scenario is what Bernstein Research is now talking about. Energy analyst Neil Beveridge is out with a new note that explores the question of demand — with a prediction that the end of oil as we know it is coming in 2030. I","m_szDocBody":"end oil linette lopez provided published monday reuter oil crashed shortterm drop price oil compared end demand oil extreme scenario bernstein research talking about energy analyst neil beveridge note explore question demand prediction end oil coming linear slow burn note say suggest demand back bit decade key conclusion analysis demand growth stronger previous decade note say for investor equate slowdown china end commodity supercycle resilience demand surprise cure low price low price business insider price recover note say tripledigit level year crash price level end decade final push demand peak folk reuter year ago talking peak oil supply moment world run oil bernstein talking exact opposite world people oil anymore situation driven factor report say first developed nation slowly ween oil decade bernstein argue west hit peak oil time though emergingmarket demand continue grow china india push from factor working level demand growth increased fuel efficiency diversification fuel power world price peak past decade include liquefied natural gas diesel electric vehicle climate change meaning policy risk continued consumption oil end oil feel fine ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/technology/businessinsider/article/The-end-of-oil-as-we-know-it-7322239.php","m_Places":["China","India"],"m_People":["Linette Lopez","Neil Beveridge"],"m_Companies":["Reuters","2020","Diesel"],"m_BiGrams":["end oil","note say"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":173}
