{"m_szDocID":"1768456","m_szDocTitle":"Japan Stocks Climb From Eight-Month Low as Global Selloff Eases - Bloomberg","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Japan Stocks Climb From Eight-Month Low as Global Selloff Eases September 29, 2015 — 8:06 PM EDT Updated on Japan Tobacco plunges to post biggest drop on the Nikkei 225 Topix falls 8.2% in September, worst monthly loss since 2012 Share on LinkedIn Share on Reddit Share on Google+ E-mail Share on Twitter Share on WhatsApp Japanese stocks rose, with the Topix index climbing from an eight-month low, as a global equity slump eased. Automakers provided the biggest support to the benchmark gauge after China cut taxes on car purchases. Toyota Motor Corp. added 3.8 per","m_szDocBody":"japan stock climb eightmonth low global selloff ease edt updated japan tobacco plunge post biggest drop nikkei topix fall september worst monthly loss share linkedin share reddit share google share share whatsapp japanese stock rose topix index climbing eightmonth low global equity slump eased automaker provided biggest support benchmark gauge china cut taxe car purchase toyota motor corp added percent mazda motor corp jumped percentjapan tobacco inc asias largest listed cigarettemaker sank percent agreeing buy international right reynold american inc natural american spirit division billion time natural american spirit profitbefore income taxe topix added percent close trading tokyo tumbling percent lowest level january measure capped worst monthly loss biggest quarterly decline nikkei stock average added percent standard poor index rose percent yesterday halting fiveday drop global market overnight werent stormy people fearing yesterday masanori ikunaga tokyobased fund manager sumitomo mitsui asset management sensitive risk wasnt reason share fall yesterday isnt obvious reason theyre today share emini future s&p added percent equity world biggest stock market swung gain losse healthcare company rebounded biotechnology share erased early rally apple inc dragged technology company lower glencore plc rose percent london day trader miner record plunge intensified concern material company weathering slump commodity price trader jumped percent hong kong wednesday topix retreated percent month september quarterly decline prime minister shinzo abe power measure slumped percent concern slowdown china federal reserve rateincrease plan spurred global financialmarket turmoil bit relief rally today david welch head equity sale trading reorient hong kong glencore global bellwether trader sentiment now comment overnight percent rally share price helped stabilise stock price data misse japan industrial output fell percent month earlier preliminary report wednesday economist expected percent increase data retail sale missed estimate nation assemble stimulus package shore economy central bank crank campaign unprecedented easing adviser abe tuesday premier week unveiled threepronged plan revive growth vowed expand national output percent provide support childrearing bolster social security toyota gained percent biggest single boost topix nissan motor added percent mazda rose percent chinas central government cut tax passengervehicle purchase support adoption electric vehicle state council cabinet japan tobacco japan tobacco fell percent biggest loss december erasing billion market value cigarette maker offering pay natural american spirit time pretax earning multiple tobacco deal past year acquisition price viewed overpriced satoshi fujiwara tokyobased analyst nomura wrote note client wednesday here bloomberg terminal learn ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.bloomberg.com/news/articles/2015-09-30/japan-stocks-climb-from-eight-month-low-as-global-selloff-eases","m_Places":["Japan","China","Asia","Tokyo","United States","London","Hong Kong","Toyota","Nomura"],"m_People":["Masanori Ikunaga","Shinzo Abe","David Welch","Satoshi Fujiwara"],"m_Companies":["Japan Tobacco","Linkedin","Reddit","Google","Twitter","Toyota Motor Corp","Mazda Motor Corp","Japan Tobacco Inc","Reynolds American Inc.","Standard & Poor","Sumitomo Mitsui Asset Management Co.","Apple Inc.","Glencore Plc","Reorient Group","Nissan Motor Co","Mazda","State Council"],"m_BiGrams":["added percent","japan tobacco","natural american","american spirit","rose percent"],"m_TriGrams":["natural american spirit"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":388}
