{"m_szDocID":"1784272","m_szDocTitle":"Small Cap Low-Risk Pick No. 2: IPG Photonics Corp. - NASDAQ.com","m_szYear":"2016","m_szDocSumamry":"Small Cap Low-Risk Pick No. 2: IPG Photonics Corp. April 08, 2016, 07:48:03 AM EDT By Motley Fool Staff, Motley Fool Comment IPG Photonics makes new fiber laser technology more affordable and accessible     than the older, legacy lasers which are being phased out. In this clip from the Rule Breaker Investing  podcast, Motley Fool co-founder David Gardner     explains why he's so excited about investing in IPG Photonics,     how it's performed over the past several years, and one point     of caution that potential investors should know about the     company. Check out David Gardner's other fav","m_szDocBody":"small cap lowrisk pick ipg photonic corp edt motley fool staff motley fool comment ipg photonic make fibre laser technology affordable accessible older legacy laser phased out clip rule breaker investing podcastmotley fool cofounder david gardner explain excited investing ipg photonic performed past year point caution potential investor company cheque david gardner favourite company transcript video secret billiondollar stock opportunity world biggest tech company forgot show something wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them podcast recorded feb david gardner stock week isipg photonic ipg photonic recently traded share worth amount carter billion case risk rating lowrisk company now ipg photonic legacy laser outand fibre laser coming trend beengoing while fibre laser and way engineer here imbringing english major explanation fibre laser basically technology costeffective nice disruptive combination affordable cheaper price superior technology fact ceo founded company valentin gapontsev brilliant manager unknown ceos america year later helm company technology thathe brought country hisnative country russia created agreat entrepreneurial enterprise based inmassachusett today but ipg photonic give bit picked stock long beenfollowing picked inapril pretty happy today recent high butimportantly one year laterin haddropped werecommended again imforeshadowing general investing principle one cover second but position time then course ahead market nowthis technology relevant spansmany industry talking medical industry telecom amovie theatre owner beautiful picture youreprobably ipg lasertechnology lithiumionbattery system electric car lot oflaser welding making thosebattery system lithiumionbattery system possible company withnot customer lot application acrossmultiple industry lot andfinally mentionedi ceo lot hesbeen long time owned stock hescreated great company note caution ipg photonic heard chinas slowing downchina meaningful market company sothis company other dingedwhen hear slowdown chinaaffecting global business thatssomething ipg photonic stock general investing principle buying good company teeth bear market rewarding hope sound good week midfebruary lot wearing big red sweater todayfor watching video podcast yahoo finance agreat big red sweater becausemy stock month thinkmy portfolio down think time lookedwhich nice month anybodysportfolio smile facebecause happened before happen future andin particular talk company weekim feeling good prospect plus year forward ipg exception lovebeing point back watched stock pick buying position year sothat thinking about stock year see ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.nasdaq.com/article/small-cap-low-risk-pick-no-2-ipg-photonics-corp-cm603508","m_Places":["Wall Street","Carter","America","Russian Federation","China"],"m_People":["David Gardner","Valentin Gapontsev"],"m_Companies":["Ipg","Photonics Corp","Motley Fool Staff","Motley Fool","Revolution","Massachusetts Today","Yahoo"],"m_BiGrams":["ipg photonic","fibre laser","david gardner"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":364}
