{"m_szDocID":"1785027","m_szDocTitle":"Clean tech a priority issue as Chinese president lands in U.S. - San Jose Mercury News","m_szYear":"2015","m_szDocSumamry":"Clean tech a priority issue as Chinese president lands in U.S. By Gene Johnson and Phuong Le Associated Press Posted:   09/22/2015 10:59:38 AM PDT Updated:   09/22/2015 11:33:36 AM PDT SEATTLE -- Chinese President Xi Jinping arrived in Washington state Tuesday for a visit to the U.S. that will include talks on how U.S. and Chinese experts and businesses can collaborate on nuclear energy, smarter electricity use and other clean technologies. The visit comes a year after Xi and President Barack Obama announced their nations would cooperate to fight climate change. Xi's plane landed at Paine Fiel","m_szDocBody":"clean tech priority chinese president land gene johnson phuong press posted pdt updated pdt seattle chinese president jinping arrived washington state visit include talk chinese expert businesse collaborate nuclear energy smarter electricity clean technology visit year president barack obama announced nation cooperate fight climate change xis plane landed paine field everett welcomed included washington gov jay inslee washington governor ambassador china gary locke seattle mayor murray talk seattle handful governor chinese counterpart include improving energy efficiency building modernising electrical grid commercialising renewable energy chinese president jinping left wife peng liyuan wave arrival tuesday sept boeing field everett wash spending day seattle travelling washington white house state dinner friday thompson elaine thompson governor expected meet privately day university washington tsinghua university beijing expected agreement collaborate research related clean tech addition terrapower inc energy company founded bill gate entering agreement china national nuclear corp work nextgeneration nuclear power plant technology these largest economy world biggest emitter greenhouse gase improving cooperation collaboration necessity brian young washington state director economic development clean technology sector second huge business opportunity side recognise opportunity job creation advertisement uschina cooperation climatechange warm fuzzy point relation superpower obama thenpresident jintao formalised renewable energy partnership including establishment cleanenergy research centre focused electric vehicle cleaner coal water energy programme november obama announced country work climate change china announcing cap greenhouse gas emission sooner possible contrast hacking attack directed beijing chinas move assert territorial claim south china sea sore spot travelling seattle washington white house state dinner friday trip time chinas economic growth slowed considerably communist nation overhauling economy put emphasis consumer spending export oftenwasteful investment factory real estate infrastructure railway airport shift demand vast amount energy chinas middle class expand noted tom ranken president cleantech alliance seattlebased trade company organisation stake clean energy technology including boeing university washington hundred other china curb pollution obvious spent time beijing shanghai said for american city stunning said theyre ultramodern storey including morning running sick halfmile air pollution cleantech firm washington state rely largely hydropower natural gas cheap market investment china sooner domestically said china invested record billion renewable energy year frankfurt school centre climate sustainable energy finance germany they huge business opportunity future solar wind mikkal herberg research director energy security programme national bureau asian research china leader nuclear energy governor meeting include inslee jerry brown california rick snyder michigan terry branstad iowa kate brown oregon ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.mercurynews.com/nation-world/ci_28857953/clean-tech-priority-issue-chinese-president-lands-us","m_Places":["United States","Seattle","Washington","Everett","China","Everett, Wash.","Washington, D.c.","Beijing","China Sea","Shanghai","Germany","California","Michigan","Iowa","Oregon"],"m_People":["Gene Johnson","Phuong Le","Xi Jinping","Barack Obama","Jay Inslee","Gary Locke","Ed Murray","Peng Liyuan","Elaine Thompson","Bill Gates","Brian Young","Hu Jintao","Tom Ranken","Mikkal Herberg","Inslee, Jerry Brown","Rick Snyder","Terry Branstad"],"m_Companies":["Associated Press","White House","Ap","University Of Washington","Tsinghua University","Terrapower Inc.","China National Nuclear Corp.","Cleantech","Alliance","Boeing","Frankfurt School's Center"],"m_BiGrams":["chinese president","washington state","renewable energy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":392}
