{"m_szDocID":"1785964","m_szDocTitle":"Fed clarity won’t help to ease stock market volatility  - MarketWatch","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Fed clarity won’t help to ease stock market volatility Published: Sept 13, 2015 5:00 p.m. ET Share MARKETWATCH FRONT PAGE By Thursday, the market will have the answer to its favorite guessing game: will the Federal Reserve pull the trigger on the first interest-rate hike since 2006? But clarity on the Fed’s stance will do little to shield the stock market from further volatility. See full story. State of emergency declared as thousands flee northern California fire Fires north of San Francisco and south of Sacramento cover over 100,000 acres and have forced nea","m_szDocBody":"fed clarity wont ease stock market volatility published sept share marketwatch front thursday market answer favourite guessing game federal reserve pull trigger interestrate hike clarity fed stance shield stock market volatility full storey state emergency declared thousand flee northern california fire fire north san francisco south sacramento cover acre forced people evacuate home full storey guy turned tesla uber didnt uber ceo travis kalanick uber driver drive tesla electric car found one full storey europe migrant crisis build migrant part middle east african nation continue flood europe bringing europe asylum system breaking point full storey studentloan crisis college student owe student college owe billion college owe billion outstanding student debt full storey china driving buick drinking pbr sign youve made full storey marketwatch sept ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.marketwatch.com/story/fed-clarity-wont-help-to-ease-stock-market-volatility-2015-09-13-17103012?siteid=rss&rss=1","m_Places":["California","Sacramento","Tesla","Europe","Middle East","United States","China"],"m_People":["Travis Kalanick"],"m_Companies":["Marketwatch","Uber"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":124}
