{"m_szDocID":"1785509","m_szDocTitle":"OPEC decision is futile, Saudi strategy is ‘doomed to failure’ - MarketWatch","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- OPEC decision is futile, Saudi strategy is ‘doomed to failure’ Published: Dec 4, 2015 5:46 p.m. ET Share Oil to test $30 ‘sooner rather than later’: professor By MyraP. Saefong Markets/commodities reporter Given the plunge in oil prices Friday, it’s obvious that the market was disappointed that the Organization of the Petroleum Exporting Countries didn’t cut production as many had expected. But the group’s decision won’t have a long-term impact anyway, says T. Homer Bonitsis, a finance professor at the New Jersey Institute of Technology. On Friday, OPEC said it","m_szDocBody":"opec decision futile saudi strategy doomed failure published share oil test sooner later professor myrap saefong reporter plunge oil price friday obvious market disappointed organisation petroleum exporting country didnt cut production expected group decision wont longterm impact anyway homer bonitsis finance professor jersey institute technology friday opec production level unchanged basically legitimising million barrel day producing output ceiling million barrel day jersey institute technology homer bonitsis associate professor finance njit matter opec essentially irrelevant affecting oil price usclf uklcof fall further bonitsis associate professor finance jersey institute technology bonitsis offered view wake opec decision outlook oil price thought saudi arabias strategy defend market share discussed key longterm influence market edited version interview marketwatch question opec latest decision sort longterm effect oil market how opec nonrelevant term ability affect price oil decision opec longterm effect oil market opec quotachiseler country nonopec production country cast shadow effectiveness opec manoeuvre oil price say year beyond oil price fluctuate this disarray opec nonrobust economic growth china europe oil price remain weak test barrel price sooner later biggest longterm influence oil price dominant factor strategically influencing price oil pace technological change extraction oileg fracking made major oil producerand innovation substitute source energyeg fuel cell battery electric car history guide secular downward trend real oil price low oil price saudi arabia fight market share succeeded pricing nonopec rival then saudi strategy attempting knock competitor predatory pricing game changer longtermsome producer shut temporarily reopen price recover again indeed producer bankruptonly asset sold bargain price investor asset lower fixed cost structure produce oil essence creating lowercost competitor policy doomed failure longterm marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.marketwatch.com/story/opec-decision-is-futile-saudi-strategy-doomed-to-failure-2015-12-04?siteid=rss&rss=1","m_Places":["United States","Uk","Saudi Arabia","China","Europe"],"m_People":["Homer Bonitsis"],"m_Companies":["Opec","New Jersey Institute Of Technology","Marketwatch","Indeed"],"m_BiGrams":["oil price","jersey institute","institute technology"],"m_TriGrams":["jersey institute technology"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":264}
