{"m_szDocID":"1788100","m_szDocTitle":"California Inc.: So long to the set-top box? - LA Times","m_szYear":"2015","m_szDocSumamry":"California Inc.: So long to the set-top box? San Diego Chargers Welcome to California Inc. , the weekly newsletter of the Los Angeles Times Business Section. I'm Business columnist David Lazarus , and here's a rundown of stories coming up this week and the highlights of last week. Subscribe to the newsletter The week ended on a high note when the Bureau of Labor Statistics announced that employers across a broad spectrum of industries added  a net 271,000 new jobs in October — far more than most analysts had forecast. Wall Street types say this increases the likelihood of a rate hike by the Fe","m_szDocBody":"california inc long settop box san diego charger california inc weekly newsletter los angele time business section business columnist david lazarus rundown storey coming week highlight week newsletter week ended note bureau labour statistic announced employer broad spectrum industry added net job analyst forecast wall street type increase likelihood rate hike federal reserve month unemployment rate lowest year ahead bankapalooza annual convention american banker assn nation main banking trade group earnest morning downtown los angele banker country talk bitcoin cybersecurity issue theyll hear richard cordray director consumer financial protection bureau jay leno close event afternoon shindig take place marriott hotel live nfl meeting representative louis san diego oakland convince national football league move team los angele louis ram san diego charger oakland raider relocation los angele market city give presentation joint gathering nfl los angele stadium finance committee york current plan call vote nfl owner subject january short film weeklong movie festival afi fest conclude los angele world premiere the big short reallife storey wall street outsider bet big bank ahead global financial crisis late directed adam mckay anchorman based michael lewis bestseller the big short inside doomsday machine film screen tcl chinese theatre face fox activist shareholder seeking greater involvement century foxs affair expected seat board company annual meeting zanuck theatre fox studios september fox invited jeffrey ubben cofounder chief executive valueact capital fill newly created seat board ubben stand election meeting viacom result viacom stock battered year investor release earning amid concern future cable industry week viacom competitor time warner lowered estimate earning viacom controlled yearold mogul sumner redstone include comedy central mtv nickelodeon paramount picture company acquired significant minority stake labased digitour media october agenda monday business section focuse settop cable boxe arguably leastpopular consumer gadget there headed technology trash heap regulation break hold paytv company forcing customer pay monthly fee cable trade government fix isnt broken provider including time warner cable experimenting streamingvideo app replace box storey line storey ran time business section recent day continuing follow tesla rival faraday future mysterious electric car startup taking shape nissan sale office gardena plan sell vehicle make billion investment factory founded tesla motor employee company eyeing location including california georgia louisiana nevada company employee see rival palo alto electric car company tesla ty chinese billionaire providing funding fresh uneasy fresh easy investor ronald burkle yucaipa cos moneylosing grocery chain finally chance turn happen fresh easy filed bankruptcy protection month time year store closed midnovember effort shake chain burkle problem plaguing fresh easy worse employee analyst said trade pact detail sweeping pacific rim trade agreement reached month released setting stage period intense scrutinising spinning selling contentious deal final vote congress early year transpacific partnership list thousand tariff item reduced including sensitive product rice dairy sugar chapter spell uniform rule intellectual property labour right environment areas international commerce bitter battle bitter legal fight sweetest enemy sugar industry los angele federal courtroom week accused fructose corn syrup producer falsely claiming product healthful sugar corn syrup producer hit back arguing sugar industry long engaged unsavoury campaign misinformation false advertising spat pit sweetener blamed contributing host ailment including diabete obesity tooth decay bid opening salvo potential war orange county launched bankruptcy court attorney owner los angele time calling open sale process rival struggling newspaper move set contest owner freedom communication tribune managementled local ownership expressed desire buy company bankruptcy tribune signalled interest offering million form refundable deposit finance freedom operation bankruptcy reading recent storey publication caught eye red netflix hollywood reporter delve red site premium service ditches ads return subscription month compete like netflix pay big licencing fee content cost licencing seller market trade publication slimmer wall politico observe pressure change impact wall street financial firm downsizing financial reformer shift wall street reflect required regulatory realisation part big bank political tide moving swiftly them school bond interesting york time bond intended pay preschool underprivileged children utah making money investor goldman sach pocketed deal expert kid involved short shrift tech diversity mediumcom add growing conversation diversity tech world employee say there moment caused question company product agent revolutionary social change reflect diversity thought conversation people rank shallow end daily beast ponder state online journalism doesnt see internet quietly cemented economy extreme imaginable loud possible economy seeping dialogue life politic say latest money new time business section ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.latimes.com/business/la-fi-laz-california-inc-html-20151109-htmlstory.html","m_Places":["Wall Street","Los Angeles","L.a.","St. Louis","San Diego","Oakland","New York","California","Georgia","Louisiana","Nevada","Palo Alto","Angeles","Reading","Utah"],"m_People":["David Lazarus","Richard Cordray","Jay Leno","Adam Mckay","Michael Lewis","Jeffrey W. Ubben","Sumner Redstone","Ronald W. Burkle"],"m_Companies":["California Inc.","San Diego Chargers","Los Angeles Times","Bureau Of Labor Statistics","American Bankers Assn","Protection Bureau","Jw","Marriott Hotel","Nfl","National Football League","St. Louis Rams","Oakland Raiders","Afi","21st Century Fox","Seat","Viacom","Time Warner","Comedy Central","Mtv","Vh-1","Nickelodeon","Paramount Pictures","Digitour","Time Warner Cable","Tesla","Nissan","Gardena","Tesla Motors","Yucaipa Cos","Congress","Orange County Register","Freedom Communications","Tribune","Youtube","Netflix","Hollywood Reporter","Politico","New York Times","Goldman Sachs","Twitter","Daily Beast"],"m_BiGrams":["los angele","business section","wall street","san diego","time business","fresh easy"],"m_TriGrams":["time business section"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,4,4,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":712}
