{"m_szDocID":"1790040","m_szDocTitle":"Despite China Slowdown, Global Economy Expected To Gain Momentum In 2016 And 2017","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Despite China Slowdown, Global Economy Expected To Gain Momentum In 2016 And 2017 By John Simons @thinksimons On 11/09/15 AT 6:04 AM Global trade and economic activity--held back by China in 2015--is expected to show a modest revival over the next two years. An employee assembles an electric car along a production line at a factory in Qingzhou, Shandong province, China. The country's factory activity has fallen for eight consecutive months. Photo: REUTERS/China Daily A slowing China won’t stop the global economy from gaining momentum over the next two years. Gl","m_szDocBody":"china slowdown global economy expected gain momentum john simon global trade economic activityheld back china expected show modest revival year employee assemble electric car production line factory qingzhou shandong province china country factory activity fallen consecutive month photo daily slowing china wont stop global economy gaining momentum year global trade economic growth hampered broad slowdown china expected tostage modest resurgence year china implement policy ease domestic effect rocky transition economy fueled infrastructure investment manufacturing driven consumer spending service organisation economic cooperation development oecdsee rest world largely absorb slowing world secondlargest economy economic forecast released monday oecd economist strike surprisingly optimistic tone chinas recent stimulus measure noting report chinese authority initiated range monetary financial policy support domestic stock market lower lending rate boost business activity infrastructure investment policy address weak underlying trend china write oecd chief economist catherine mann paper released forecast policy action put floor global commodity price stabilise commodityexporting economy datemeta edt","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.ibtimes.com/despite-china-slowdown-global-economy-expected-gain-momentum-2016-2017-2174889","m_Places":["China","Shandong"],"m_People":["John Simons","Catherine Mann"],"m_Companies":["Reuters","China Daily","Economic Co","Oecd"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":152}
