{"m_szDocID":"1794905","m_szDocTitle":"China solar debts still cloud industry's outlook","m_szYear":"2013","m_szDocSumamry":"textArticle -------------------- China solar debts still cloud industry's outlook Share More September 4 2013 LDK Solar's delay in paying debt and Suntech Power's attempts to renegotiate obligations are prompting investors to gird for losses as $US8.4 billion ($9.3 billion) in renewable energy comes due by the end of next year. The 2014 securities of LDK slid to a record low of 25.6 yuan per 100 yuan face value last week after the manufacturer said a payment due August 28 on the notes would be delayed. That compares with the 30 euros per 99.861 euro issue price on Bonn- based Solarworld AG. Su","m_szDocBody":"china solar debt cloud industry outlook share ldk solar delay paying debt suntech power attempt renegotiate obligation prompting investor gird losse billion billion renewable energy due end year security ldk slid record low yuan yuan face week manufacturer payment due note delayed compare euros euro price bonn based solarworld suntech world biggest panel maker chairwoman susan director quit amid negotiation holder defaulted debt premier keqiang step cut state role economy forcing investor reconsider bailout bet billion debt businesse including electric car battery hydropower biofuel mature end year billion data compiled bloomberg predecessor wen jiabao turned china world biggest maker solar panel spending including billion credit line crippled industry overcapacity debt repayment problem chinese solar company shocking investor wait government handle them yun shanghaibased analyst evergrowing bank credit default concentrated half solar debt chinas biggest photovoltaic company debt billion yuan billion ministry industry information technology aug note coming due year include million yuan security sold gclpoly energy holding ltd world biggest maker polysilicon million yuan bond energy science technology windsolar hybrid system maker advertisement ldk failed fully repay million convertible bond matured restructuring million security due june company ended quarter billion debt million cash message left ldk office sunnyvale california chief financial officer jack lai returned aug aug peng shaomin ldk director media company headquarter southeastern province jiangxi declined comment contacted phone yesterday ldk missed payment enable process weeding company uncompetitive industry mired oversupply amit jain bangalore based analyst sjs market ltd industry run fittest survive suntech restructuring offshore bondholder risk domestic bank completely recover money jain said suntech director quit cited concern negotiation bondholder cash flow lack clear business plan manufacturer aug statement resignation highlight division management company default million convertible note june manufacturer extended forbearance agreement majority bondholder aug maker device convert light power expect enter restructuring framework agreement week statement newswire dated day rising risk negotiation bondholder press release reached agreement proceed detailed ryan scott ulrich spokesman wrote response emailed question company plan equitize debt ulrich added restructuring include convertible bond domestic debt slowing economic growth adding concern company china miss payment recent trade manufacturing data shown stabilisation gross domestic product expand cent year slowest decade median estimate economist surveyed bloomberg chinas creditdefault swap contract insuring nation debt nonpayment increased basis point year data provider cma yield country benchmark year sovereign note leapt basis point cent premium top rated corporate security due decade increased basis point month basis point survival chance authority focus support solar industry bolstering demand providing fund directly xiaoting beijingbased analyst bloomberg energy finance bankruptcy weed company unable meet obligation said solar company bankrupt starting year continuous cash flow chinas solar industry revive half consumption grow abroad local demand take off ministry industry information technology aug china photovoltaic industry alliance company state expect nation double total solar installation year level top panel maker china including yingli green energy holding nation largest jinkosolar holding returning profitability year losse asian demand drove margin quarter panel price gained cent year data compiled bloomberg yield jinkosolar convertible dollardenominated bond fell cent aug lowest bank material supplier choosing company larger chance surviving bnef said improvement collecting overdue payment panel price rise datexpath ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://www.smh.com.au/business/carbon-economy/china-solar-debts-still-cloud-industrys-outlook-20130903-2t3yg","m_Places":["China","Bonn","Shanghai","Sunnyvale, California","Jiangxi","Bangalore","Beijing"],"m_People":["Susan Wang","Li Keqiang","Wu Yun","Jack Lai","Amit Jain","Ryan Scott Ulrich"],"m_Companies":["Solarworld Ag","Evergrowing Bank Co.","Ministry Of Industry","Information Technology","Poly Energy Holdings Ltd.","Science & Technology Co.","Sjs Markets Ltd.","Pr Newswire","Alliance","Green Energy Holding Co.","Jinkosolar Holding Co."],"m_BiGrams":["basis point","world biggest"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":522}
