{"m_szDocID":"1795131","m_szDocTitle":"Hell no, we won't pay: How technology transformed our perception of value | ZDNet","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- ZDNet Japan Hell no, we won't pay: How technology transformed our perception of value What does this culture and technology of anti-spendism mean for the future consumption and valuation of goods and services? | Topic: Cloud Open Source. The backlash against Software Patents. Cloud Computing. Bitcoin. 3D Printing. Post-PC. Cord-Cutting. Electric Vehicles and Alternative Energy.  There are ideological and social drivers that are unique to every single one of these things, and yet there is a common thread that ties them together. I call this trend \"anti-spendism\"","m_szDocBody":"zdnet japan hell pay technology transformed perception culture technology antispendism future consumption valuation good service topic cloud open sourcethe backlash software patentscloud computing bitcoin printing postpc cordcutting electric vehicle alternative energy ideological social driver unique single thing common thread ty together call trend antispendism antispendism necessarily social movement tied betterment whole socialism communism talking desire equitably distribute wealth havenot definition personal selfcentered desire expend capital all put modern rapid advance technology lowered perception cost ultimately good service devalued people pay them special feature cloud computing moving iaas infrastructure service provider make compelling argument businesse stop running data centre simply purchase server capacity ondemand scale needed deep dive iaas strategy practise read put bluntly antispendism hell pay syndrome case made thriftiness trade good service existed money existed time history thriftiness overwhelmingly driven technology itself viceversa rise foss difficult began suspect emerged confluence event beginning rise source software foss movement late planted seed technorati software free crippling global recession year barely beginning recover created mass reluctance spend devaluation good service global scale foss some worthy objective primary reason adopted small startup cost elimination factor foss panacea cost reduction circumstance situation total cost ownership higher fact free open source software free remain primary selling point movement software patent patent reform product free open source software movement desire pay licencing fee royalty next cloud computing cloud computing combined open source take antispendism logical conclusion desire spend money physical infrastructure buy server storage networking equipment application consumed incremental miserly fashion yes driver cloud enterprise standpoint include selfservice rapid provisioning service automation consumer standpoint data device difference replacing cheap human cheaper software automation ultimately cloud driven desire reduce cost price cloud computing iaas paas consumer enterprisefocused saas driven race bottom respective public cloud vendor industry transition cloud representsantispendism form devaluation skilled labour run data centre support infrastructure prior cloud beginning outsourcing difference replacing cheap human cheaper software automation bitcoin antispendism poster child trade good service tangible instead make money effectively cycle buying good service free argued bitcoin cryptocurrency staying power embraced mainstream society again reason bitcoinsexistence main proposition independence global financial system pointing middle finger big banking government currency printing bitcoin disruptive antispendism tech true case technology initial seed investment gpu card printer cost supply electricity plastic polymer perceived produced exceed initial seed cost recurring cost additionally technology improve mean production cheaper efficient bitcoin printing devalue good service industry disrupt buy print real money create thin air computer postpc antispendism tech postpc good antispendism tech tablet armbased processor technology heavily consolidated reduced bill material component computing device cost fullsized tablet small one expect smartphone cost subsidised basis easy blame postpc device manufacturer apple foxconn samsung amazon that ultimately consumer drive trend favourite antispendism tech cordcutting practise giving middle finger cable company cord cutting combine cocktail cloud service streaming device residential broadband deliver video content pay service possible easy angry cable company perceived offering far lower people pay math realise buying streaming service piecemeal paying big monthly cable bill indication cable provider universally hated company planet awful service cord cutting thing gonna big hence proliferation seek path netflixe itune amazon instant videos hulu redboxe tivos overtheair antennae recent convert read yes aereos include skype hangout ooma voip service well product antispendism future antispendism electric vehicle alternative energy source wave antispendism perfected massconsumption technology necessarily affordable now embrace inclined ideological reason green cost concern side benefit however emerging technology printing cryptocurrency year huge backlash money people pay automobile fuel assume price oil continue rise cost electrical vehicle brought closer conventional combustion vehicle price ultimately cost recurring electrical charge life vehicle maintenance proven significantly lower conventional counterpart antispend disruptor making disruptive technology ultimately devalued good service year talk back know gmt pdt","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.zdnet.com/article/hell-no-we-wont-pay-how-technology-transformed-our-perception-of-value/","m_Places":["Japan","Hell","Printer"],"m_People":[],"m_Companies":["Apple","Samsung","Amazon","Path","Hulu","Tivos","Skype","Google"],"m_BiGrams":["good service","cloud computing","antispendism tech","people pay","source software","open source"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,4,4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":612}
