{"m_szDocID":"1806613","m_szDocTitle":"U.S. stocks slide further on global economic worries | The Spokesman-Review","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- THURSDAY, FEB. 11, 2016, 1:50 P.M. U.S. stocks slide further on global economic worries By Alex Veiga Associated Press Jitters over the global economy and steep declines in bank stocks knocked U.S. stocks lower for the fourth day in a row Thursday. The slide in the U.S. followed large losses all around the world and left all three major U.S. indexes down at least 10 percent … Reddit Jitters over the global economy and steep declines in bank stocks knocked U.S. stocks lower for the fourth day in a row Thursday. The slide in the U.S. followed large losses all aro","m_szDocBody":"thursday feb stock slide global economic worry alex veiga press jitter global economy steep decline bank stock knocked stock lower fourth day row thursday slide large losse world left major indexe percent reddit jitter global economy steep decline bank stock knocked stock lower fourth day row thursday slide large losse world left major indexe percent beginning year latest slump reflected heightened concern global economic growth slowing federal reserve chair janet yellen reiterated confidence economy testimony congress thursday lot people trouble assessing true stock kinahan ameritrade chief strategist continue volatility financial company biggest decliner amid growing anxiety interest rate remain low sap bank profit price oil tumbled lowest level investor fled traditional haven bond precious metal gold jumped percent stock ended lower recovered steeper losse earlier day dow jone industrial average dropped point percent average point standard poor lost point percent nasdaq composite fell point percent investor increasingly worried mounting market turmoil put brake global economy time struggling litany issue including chinas slowdown low inflation plunging energy market yellen day testimony lawmaker thursday acknowledged global economic pressure pose risk economy early risk severe alter central bank interestrate policy failed reassure investor hoping fed signal rate hike table year katie nixon chief investment officer northern trust wealth management market disappointed direct comment pushing rate increase nixon said opportunity that feeding market anxiety sector s&p index closed lower financial stock fell most percent citigroup fell percent bank america shed cent percent jpmorgan slid percent benchmark crude oil fell sixth day row sliding percent barrel york brent crude benchmark international oil dropped cent percent barrel london natural gas fell cent percent cubic feet drop oil natural gas price share energy company lower southwestern energy lost cent percent nrg energy shed percent boeing plunged percent report security exchange commission investigating aircraft manufacturer accounting practise stock worstperformer dow losing company bucked downward trend included tripadvisor rose travel website operator fourthquarter profit revenue topped estimate stock gained percent performing stock s&p tesla motor climbed percent electric car maker lowerpriced model sedan schedule release stock added europe germany dax dropped percent france cac slid percent dragged percent drop share bank societe generale warned profit britain ftse shed percent asia indexe reopened holiday caught day market turmoil hong kong hang seng dived percent opening percent lower south koreas kospi staged biggest daily drop year percent china taiwan reopen monday japan closed separate public holiday bond price rose driving yield year treasury percent percent late wednesday gold surged percent ounce silver climbed cent percent ounce copper industrial metal rise fall investor optimism global economy fell cent percent pound energy trading york wholesale gasoline changed cent gallon home heating oil flat cent gallon dollar dive investor adjusted expectation fewer interest rate increase fell yen yen fell euro published feb fri thursday feb ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.spokesman.com/stories/2016/feb/11/us-stocks-fall-for-fourth-straight-day/","m_Places":["United States","China","New York","Brent","London","Europe","Germany","France","Britain","Asia","Hong Kong","South Korea","Taiwan","Japan"],"m_People":["Janet Yellen","J.j. Kinahan","Katie Nixon"],"m_Companies":["Alex Veiga Associated Press","Reddit","Td Ameritrade","Sap","Standard & Poor","Signal","Northern Trust","Citigroup","Bank Of America","Nrg Energy","Boeing","Securities And Exchange Commission","Tesla Motors","Treasury"],"m_BiGrams":["cent percent","global economy","global economic","day row","point percent"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":461}
