{"m_szDocID":"1808709","m_szDocTitle":"Trina Solar 2016 Shipments Unlikely To Be Affected By Slowdown In China | CleanTechnica","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Trina Solar 2016 Shipments Unlikely To Be Affected By Slowdown In China May 27th, 2016 by Joshua S Hill   Trina Solar, the world’s largest solar manufacturer, says it expects shipments to increase in 2016, even with a slowdown in China in the second half of the year. The China-based solar manufacturer reports its first quarter 2016 results this week, and it was nearly good news across the board. Despite sequential decreases in most major measurements, the company’s year-over-year figures tell a much different story. Total module shipments for the quarter were 1","m_szDocBody":"trina solar shipment affected slowdown china joshua hill trina solar world largest solar manufacturer expect shipment increase slowdown china half year chinabased solar manufacturer report quarter result week good new board sequential decrease major measurement company yearoveryear figure storey total module shipment quarter quarterly decrease increase yearoveryear trend continued net revenue gross profit margin operating income net income decrease fourth quarter impressive increase quarter quarter good start year jifan gao chairman ceo trina solar posted strong yearoveryear growth major financial operational metric revenue net income respectively total module shipment quarter increased yearoveryear largely driven demand key market china india shipment europe twofold sequentially result strategic shift europe trina solar expect ship worth solar module quarter shipped company downstream project company development business provided negative company quarterly report trina solar insistent meet yearly module shipment guidance company downgraded guidance global solar power project connexion original guidance due primarily expected slowdown chinese market half year china market weaker half year teresa tan trinas chief financial officer conference call however global market including japan emerging market india strong date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter havent reader survey yet now ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/05/27/trina-solar-2016-shipments-unlikely-affected-slowdown-china/","m_Places":["China","Atmosphere","United States","India","Europe","Japan"],"m_People":["Trina Solar","Joshua S Hill","Mr. Jifan Gao"],"m_Companies":[],"m_BiGrams":["trina solar","half year","module shipment"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":202}
