{"m_szDocID":"1817869","m_szDocTitle":"Canadian Solar and Ningxia State Power Complete 10-MW China Project | CleanTechnica","m_szYear":"2012","m_szDocSumamry":"textArticle -------------------- Canadian Solar and Ningxia State Power Complete 10-MW China Project January 9th, 2012 by Chris Keenan   China has an energy problem. As the nation continues its rapid economic expansion, it’s hunger for energy grows larger each day. China relies heavily on dirty fossil fuels such as oil and coal to feed its industrial demands and growing middle class needs. But the cost is heavy for all this economic growth and increasing middle class posterity — pollution. So, to combat thickening smog and fouled rivers, China has been investing in green technology , especiall","m_szDocBody":"canadian solar ningxia state power complete china project chris keenan china energy problem nation continue rapid economic expansion hunger energy grow larger day china rely heavily dirty fossil fuel oil coal feed industrial demand growing middle class need cost heavy economic growth increasing middle class posterity pollution combat thickening smog fouled river china investing green technology solar moving solar rapid pace world largest solar company canadian solar inc chinasningxia electric power recently announced successful completion activation solar project energy produced project kwh power year drop energy green sustainable generating clean energy china reducing consumption coal tonne year reducing carbon dioxideemissionsby tonne year yingkuan liu chairman ningxia power group commented step strategic collaboration canadian solar ningxia power group canadian solar global technology finance experience solar power plant epc development solar power plant inchina china active solar panel industry ramping production investing heavily infrastructure hope leader international solar market clear partnership canadian solar ningxia electric power china see clear benefit investing clean energy home date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter havent reader survey yet now ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2012/01/09/canadian-solar-and-ningxia-state-power-complete-10-mw-china-project/","m_Places":["China"],"m_People":["Chris Keenan","Yingkuan Liu"],"m_Companies":["Canadian Solar Inc.","Electric Power Group","Ningxia Power Group","Ramping"],"m_BiGrams":["canadian solar","solar ningxia"],"m_TriGrams":["canadian solar ningxia"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":189}
