{"m_szDocID":"1817086","m_szDocTitle":"Tesla stock up on Apple report - SFGate","m_szYear":"2014","m_szDocSumamry":"Tesla stock up on Apple report Chronicle News Services Updated 5:21 pm, Tuesday, February 18, 2014 AUTOMAKERS Tesla stock hits record high Tesla Motors Inc. closed above $200 for the first time amid speculation about the nature of a 2013 meeting between the electric car maker's chief, Elon Musk, and Apple Inc. 's head of mergers and acquisitions, four analysts said. Musk, Tesla's chief executive officer and co-founder, met with Apple's Adrian Perica in early 2013, The Chronicle reported Sunday, citing a person familiar with the matter. Liz Jarvis-Shean, a Tesla spokeswoman, declined to comment","m_szDocBody":"tesla stock apple report chronicle new service updated tuesday automaker tesla stock hit record tesla motor inc closed time amid speculation nature meeting electric car maker chief elon musk apple inc head merger acquisition analyst said musk teslas chief executive officer cofounder met apple adrian perica early chronicle reported sunday citing person familiar matter liz jarvisshean tesla spokeswoman declined comment storey kristin huguet spokeswoman apple return call seeking comment tesla scheduled release fourthquarter result wednesday rose percent highest closing price palo alto maker model sedan share fivefold past month there indication acquisition possibility now jame albertine analyst stifel nicolaus tuesday hold rate share still analyst craig irwin wedbush security andrea jame dougherty dan galve deutsche bank apple chatter partially responsible stock gain investor expectation positive upcoming conference call tesla discuss quarterly result irwin rate tesla outperform increase combination apple speculation boost target price tesla share analyst jame buy rate tesla ben kallo analyst robert baird reiterated outperform rating tesla boosted target price technology eye property techy tired making daily bus trip google mountain headquarter option giant plan rent buy space mission district financial time company eye squarefoot building alabama hold employee paper reported representative told chronicle its policy comment rumour new heel protest buse tech company shuttle employee san francisco office silicon valley ferry transport employee headquarter company ended experimental programme month increasingly tech company expanded san francisco move designed attract young worker live trendier neighbourhood long commute alabama street space office newspaper catalogue printer howard quinn reserved house startup acquired source told financial time protest continue currency bitcoin atm coming hand bitcoin bit easier robocoin instal nation bitcoin atm seattle austin texas month kiosk similar ordinary atm added feature scanner read driver licence passport confirm user identity user trade bitcoin cash machine acquire crypto currency robocoin las vegas company installed bitcoin atm canada year bitcoin atm represent latest effort bring bitcoin wider audience introduced currency scrutiny fluctuating black market affiliation san francisco vendor accepting bitcoin month japantown restaurant hosted claimed firstever bitcoin fair designed show people bitcoin dollar bill processor intel faster chip server intel corp unveiled highend processor hope boost demand corporate customer bank retailer intel core market personal computer shrinking chipmaker server business increasingly important growth recently fallen short expectation diane bryant general manager intel data centre xeon chip designed retailer airline stock exchange credit card company instantly crunch growing trove data xeon chip efficient previous generation data held memory hard drive quickly analysed the xeon give highly anticipated boost enterprise giving ability deploy capability previously impossible bryant said ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/article/Tesla-stock-up-on-Apple-report-5246234.php","m_Places":["Tesla","Palo Alto","Mission District","Silicon Valley","Alabama","Seattle","Austin, Texas","Las Vegas","Canada"],"m_People":["Elon Musk","Adrian Perica","Liz Jarvis-shean","Kristin Huguet","James Albertine","Craig Irwin","Andrea James","Dan Galves","Howard Quinn","Diane Bryant"],"m_Companies":["Apple","Tesla Motors Inc.","Apple Inc.","Stifel Nicolaus & Co.","Wedbush Securities","Deutsche Bank","Target","Robert W. Baird & Co.","Google","Financial Times","Intel","Intel Corp","Data Center Group"],"m_BiGrams":["bitcoin atm","san francisco"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":422}
