{"m_szDocID":"1819167","m_szDocTitle":"Top 3 Takeaways From The Deputy Energy Secretary’s Beijing Speech « Breaking Energy - Energy industry news, analysis, and commentary","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Energy industry news, analysis, and commentary Top 3 Takeaways From The Deputy Energy Secretary’s Beijing Speech By Pat Adams | U.S. Department of Energy on April 14, 2015 at 5:00 PM The Department of Energy and Department of Commerce are teaming up for a joint Presidential Trade Mission to China. We’re bringing you the latest from the trip on Energy.gov and Commerce.gov. As part of this week’s joint trade mission to China , Deputy Secretary of Energy Elizabeth Sherwood-Randall spoke at Microsoft’s Beijing campus. Delivering remarks to Chinese and American busi","m_szDocBody":"energy industry new analysis commentary top takeaway deputy energy secretary beijing speech pat adam department energy department energy department commerce teaming joint presidential trade mission china bringing latest trip energygov commercegov part week joint trade mission china deputy secretary energy elizabeth sherwoodrandall spoke microsoft beijing campus delivering remark chinese american business leader government official deputy secretary emphasised innovation clean energy space create job drive economic growth address climate change china united state deputy secretary made main point trade mission working china combat climate change united state china world largest economy world largest carbon producer mean leading role play addressing climate change trade mission build year ambitious climate change announcement president obama president forward successful global climate summit paris year technology solution climate change lowcost lowcarbon technology potential change worldwide picture climate driving cost green technology enable aggressive policy change ultimately making clean energy goal easier achieve department energy aggressively supporting research development deployment gamechanging technology including wind solar led electric vehicle businesse lead way secretary moniz recent speech ultimately focus solution climatechange challenge technologyamerican business called heavy lifting tremendous business opportunity company grow lowcarbon economy china stay tuned coverage secretary pritzker speech tomorrow shanghai ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://breakingenergy.com/2015/04/14/top-3-takeaways-from-the-deputy-energy-secretarys-beijing-speech/","m_Places":["Beijing","China","United States","Paris","Shanghai"],"m_People":["Pat Adams","Elizabeth Sherwood-randall","Barack Obama","Moniz","Pritzker"],"m_Companies":["Department Of Energy","Department Of Commerce","Microsoft"],"m_BiGrams":["climate change","trade mission","department energy","deputy secretary"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":194}
