{"m_szDocID":"1820055","m_szDocTitle":"Markets Right Now: US stocks end flat after 2 down days","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Markets Right Now: US stocks end flat after 2 down days May 5, 2016 NEW YORK (AP) — The Latest on developments in financial markets (all times local): 4:00 p.m. U.S. stocks ended the day nearly flat as indexes stabilized after two days of losses. Energy companies rose with the price of oil and health care stocks advanced. Consumer companies and telecommunications stocks were the biggest decliners. A number of companies fell after releasing results that didn't impress investors. Electric car maker Tesla sank 5 percent and cereal maker Kellogg fell 3 percent. The","m_szDocBody":"market now stock end flat day york latest development financial market all time local stock ended day flat indexe stabilised day losse energy company rose price oil health care stock advanced consumer company telecommunication stock biggest decliner number company fell releasing result impress investor electric car maker tesla sank percent cereal maker kellogg fell percent dow jone industrial average rose point percent standard poor index fell half point nasdaq composite fell point percent bond price move much yield year treasury note held steady percent energy sector leading stock market higher midday trading indexe stabilise day losse apache rose percent newfield exploration climbed percent company rising reporting earning beat analyst forecast discovery communication rose percent allstate added percent dow jone industrial average rose point percent standard poor index added point percent nasdaq composite edged point percent price crude oil climbed percent barrel york bond price move much yield year treasury note held steady percent energy stock leading early gain wall street market stabilise day losse oil producer rising early trading price oil jumped percent newfield exploration climbed percent company rising reporting earning beat analyst forecast discovery communication allstate rose percent dow jone industrial average rose point percent standard poor index added point percent nasdaq composite edged point percent bond price fell yield year treasury note rose percent european market making solid gain difficult start root concern state global economy primarily scale slowdown china mood appear steadied runup friday nonfarm payroll report april economic data week mixed private payroll report adp worse anticipated kit jucke strategist societe generale cautioning reading adp release poor correlation official data and case job estimated recent average word tell little jucke said germany dax percent cac france risen percent ftse index leading british share percent reblog ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.yahoo.com/news/markets-now-european-markets-gets-084332436.html","m_Places":["United States","New York","Tesla","Wall Street","China","Germany","France"],"m_People":["Kit Juckes"],"m_Companies":["Ap","Kellogg","Treasury","Apache","Newfield Exploration","Discovery Communications","Allstate","Adp","Societe Generale"],"m_BiGrams":["point percent","rose percent","day losse","percent dow","dow jone","jone industrial","industrial average","average rose","rose point","percent standard","standard poor","poor index","nasdaq composite","bond price","yield year","year treasury","treasury note","climbed percent"],"m_TriGrams":["percent dow jone","dow jone industrial","jone industrial average","industrial average rose","average rose point","rose point percent","point percent standard","percent standard poor","standard poor index","yield year treasury","year treasury note"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3],"m_TriCnt":[3,3,3,3,3,3,3,3,3,3,3],"m_iDocBodyWordCnt":289}
