{"m_szDocID":"1832918","m_szDocTitle":"Japan shares fall on earnings; Asia cautious ahead of central banks - MarketWatch","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Japan shares fall on earnings; Asia cautious ahead of central banks Published: Apr 27, 2016 5:42 a.m. ET Share By ChaoDeng Most stock markets in Asia Pacific fell Wednesday as investors braced for an update on monetary policy from the U.S. Federal Reserve. Australia’s S&P/ASX 200 XJO, +0.33%  was off 0.6% while both the Shanghai Composite SHCOMP, +0.01%  and Japan’s Nikkei Stock Average NIK, +0.68% fell by 0.4%. The Hang Seng Index HSI, +0.46%  finished down 0.2% and South Korea’s Kospi SEU, +0.42%  lost 0.2%. The Aussie dollar USDAUD, +0.7525%  slid on expecta","m_szDocBody":"japan share fall earning asia cautious ahead central bank published share chaodeng stock market asia pacific fell investor braced update monetary policy federal reserve australias xjo shanghai composite shcomp japan nikkei stock average nik fell hang seng index hsi finished south koreas kospi seu lost aussie dollar usdaud slid expectation country central bank cut interest rate meeting local currency dollar compared earlier asian trading day region however investor awaited monetarypolicy update federal reserve federal open market committee due central bank isnt expected raise interest rate hint act june fed announcement midday bank japan policy decision view split boj bolster easing programme suspect fed rock apple cart cap upward momentum dollar chris weston chief market strategist brokerage beijing auto show debut latest electric vehicle electric vehicle make chinese car market spotlight beijing auto show photo press australia share straight session amid heightened uncertainty interest rate market opened modestly higher wake overnight recovery oil price built gain peak midday release data showing quarter domestic deflation turned selling analyst reflected increased likelihood reserve bank australia cut interest rate week face risk inflation undershoot target sustained period commonwealth bank australia cba led big bank lower falling national australia bank nab lost bank westpac banking wbc shed australia zealand banking anz fell meanwhile stock tokyo dragged lower disappointing earning result bicycle part maker shimano dropped company cut netprofit projection citing weaker dollar yen electronic maker canon inc lost firm lowered sale profit projection canon cited pressure slower economic growth china emerging market higher yen robb stewart kosaku narioka contributed article marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/japan-shares-fall-on-earnings-asia-cautious-ahead-of-central-banks-2016-04-27","m_Places":["Japan","Asia","Most","Australia","Shanghai","South Korea","Beijing","Tokyo","Shimano","China"],"m_People":["Chris Weston","Robb M. Stewart","Kosaku Narioka"],"m_Companies":["Central Banks","Asia Pacific","U.s. Federal Reserve","Nikkei Stock Average","Central Bank","Federal Open Market Committee","The Central Bank","Bank Of Japan","Apple","Ig","Associated Press","Reserve Bank Of Australia","Target","Commonwealth Bank Of Australia","National Australia Bank","Nab","Westpac","Australia & New Zealand Banking Group","Anz","Canon Inc","Canon","Marketwatch"],"m_BiGrams":["interest rate","central bank"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":256}
