{"m_szDocID":"1832320","m_szDocTitle":"GM Sees No Auto Slowdown, Plans To Cut Incentives In Q1 | Stock News & Stock Market Analysis - IBD","m_szYear":"2016","m_szDocSumamry":"Reprints General Motors ( GM ) dismissed concerns that car demand has peaked after record sales last year and will cut vehicle incentives this quarter on expectations of a strong U.S. market. GM CFO Chuck Stevens told analysts on a call that a cyclical downturn in the auto sector isn't expected in the next several years, but added that the auto giant is prepared if demand dips in the short term. CEO Mary Barra said U.S. car demand should \"plateau\" in a few years, but not slide down from a peak. Analysts and auto industry executives have warned that the sector may peak in 2016, and economic gro","m_szDocBody":"reprint general motor dismissed concern car demand peaked record sale year cut vehicle incentive quarter expectation strong market cfo chuck steven told analyst call cyclical downturn auto sector expected year added auto giant prepared demand dip short term ceo mary barra car demand plateau year slide peak analyst auto industry executive warned sector peak economic growth top global auto market china continue shrink meanwhile gas price expected level steep plunge share closed stock market today gms earning share minus onetime item climbed beating estimate cent share revenue virtually flat billion topping view billion minus impact negative currency net revenue billion higher year ago north americas adjusted earning rose billion billion company affirmed fullyear eps outlook midpoint wall street consensus sale pickup truck rose year ago chevrolet crossover jumped cheap oil lifting sale gasguzzling car fuelefficient model suffered earlier week confirmed generation cadillac elr line electric vehicle originally positioned tesla motor tsla alternative cadillac elr sale msrp slashed tag spur sale meanwhile toyota motor discontinuing scion line youthtargeted brand launched august transition model toyota brand discontinue sport coupe model time market tracker ihs told bloomberg brand support needed recover recession toyota motor share fell tesla motor lost large automaker ford motor slid fiat chrysler automobile fcau retreated volkswagen vlkay rose ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.investors.com/news/gm-q4-profit-sales-surge-amid-talk-of-sector-top/","m_Places":["United States","China","North America","Wall Street","Toyota"],"m_People":["Chuck Stevens","Mary Barra"],"m_Companies":["General Motors","Gm","Cadillac","Tesla Motors","Tsla","Toyota Motor","Tm","Ford Motor","F","Fiat Chrysler Automobiles","Fcau","Volkswagen","Vlkay"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":209}
