{"m_szDocID":"1837834","m_szDocTitle":"How bitcoin can turn it around - MarketWatch","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- How bitcoin can turn it around Published: Feb 25, 2014 5:00 p.m. ET Share Bitcoin was on the verge of a breakthrough into the mainstream. Now advocates of the cryptocurrency will have to consider the unthinkable: safeguards for users — bringing closer to real banking. See full story. Bill Gross started a conga line on the Pimco trading floor Bill Gross defends himself against an article in the Wall Street Journal that suggested his management led Pimco CEO Mohamed El-Erian to resign. See full story. Literally zero homes in San Francisco that a teacher can affor","m_szDocBody":"bitcoin turn published share bitcoin verge breakthrough mainstream advocate cryptocurrency unthinkable safeguard user bringing closer real banking full storey bill gross started conga line pimco trading floor bill gross defend wall street suggested management led pimco ceo mohamed elerian resign full storey literally home san francisco teacher afford survey find literally home san francisco teacher afford survey find full storey tesla power tesla sell electric car car battery buying power tesla notsodistant future full storey well fargo move corporate america buzzing executive well fargo realogy laud easier well fargo lending regulator watchful eye full storey richest home higher share national income america today aristocrat superrich england full storey marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/how-bitcoin-can-turn-it-around-2014-02-25-1710307","m_Places":["Tesla","America","England"],"m_People":["Mohamed El-erian"],"m_Companies":["Pimco","Wall Street Journal","Wells Fargo","Realogy","America Today","Marketwatch"],"m_BiGrams":["well fargo"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":109}
