{"m_szDocID":"1837921","m_szDocTitle":"What weather forecasters won’t say - MarketWatch","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- What weather forecasters won’t say Published: Feb 18, 2014 2:49 p.m. ET Share Inside the high-stakes game of guessing whether it will rain tomorrow. Plus, Chuck Jaffe on ETFs and Bill Bischoff on the one-rollover-per-year rule. You’re invited to ... Bitcoin: Boom and Bust The rise of bitcoin has triggered a lively debate over the risks and rewards of virtual currencies. If you’re interested in bitcoin, and will be in New York on Tuesday, March 4, you’re invited to join us for an evening of cocktails and conversation on the topic. MarketWatch Senior Columnist Ro","m_szDocBody":"weather forecaster wont published share inside highstake game guessing rain tomorrow plus chuck jaffe etf bill bischoff onerolloverperyear rule youre invited bitcoin boom bust rise bitcoin triggered lively debate risk reward virtual currency youre interested bitcoin york tuesday youre invited join evening cocktail conversation topic marketwatch senior columnist robert powell moderate panel discussion guest todd harrison founder ceo minyanville media mark william banking risk management expert professor boston university school management marketwatch investing insight event free space limited information rsvp friday feb growing case etf chuck jaffe investment vehicle safer one growing case etf bank error bankrupt customer imagine freak bank mistakenly told credit reporting agency bankrupt weather forecaster wont inside highstake game guessing rain tomorrow consolidate debt top option situation retail tech guilt tipping payment app nudge customer tip more blow million week leader race offer world expensive trip rebalance portfolio rebalancing worksbut trade often write brett arend guide firsttime home buyer buy home guide firsttime home buyer toyota test wireless charging electric car toyota announced begin actual verification testing wireless batterycharging system electric vehicle charge battery plugin hybrid pureelectric car beat ira rollover rule court onerolloverperyear rule apply iras divorce remarriage impact social security pay wait breaking write robert powell economy politic homebuilder confidence plunge gauge confidence home builder plunge february dropping lowest level month led weaker view sale singlefamily home data released tuesday homebuilder confidence plunge february empire state index retreat manufacturing activity york region decreased strong gain january york federal reserve empire state index retreat february fed monetary fiscal policy delicate transition point economy show sign slowing write irwin kellner fed sceptic schroeder germany euro german chancellor gerhard schroeder broken important taboo germany dominance european union opposite planned architect euro write david marsh investing homebuilder confidence plunge gauge confidence home builder plunge february dropping lowest level month led weaker view sale singlefamily home data released tuesday homebuilder confidence plunge february tesla amazon let kill conventional thought crib tesla amazon write marek fuch tesla amazon soros double bearish bet s&p tune billion week filing new george soross hedgefund firm doubled bearish bet s&p soros double bearish bet s&p tune billion china overtake india world biggest gold buyer chinese demand gold bar coin jewellery soar record level china import gold india time world gold council china overtake india world biggest gold buyer weapon wall street manipulate wall street achieve goal keeping investor dark dependent irrational uninformed wall street weapon finance cyberwarrior manipulate main street investor ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/what-weather-forecasters-wont-say-2014-02-18","m_Places":["New York","Toyota","Germany","Tesla","China","India","Wall Street"],"m_People":["Chuck Jaffe","Bill Bischoff","Robert Powell","Todd Harrison","Mark T. Williams","Brett Arends","Irwin Kellner","Gerhard Schroeder","David Marsh","Marek Fuchs","George Soros"],"m_Companies":["Bust","Marketwatch","Boston University","School Of Management","Rsvp","Ira","Iras","Social Security","New York Federal Reserve","European Union","Amazon","World Gold Council"],"m_BiGrams":["homebuilder confidence","confidence plunge","plunge february","tesla amazon","bearish bet","bet s&p","wall street"],"m_TriGrams":["homebuilder confidence plunge","bearish bet s&p"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,4,3,3,3,3],"m_TriCnt":[4,3],"m_iDocBodyWordCnt":407}
