{"m_szDocID":"1837837","m_szDocTitle":"U.S. stocks slip after weak economic reports - MarketWatch","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- U.S. stocks slip after weak economic reports Published: Feb 25, 2014 4:49 p.m. ET Share Zulily soars on earnings; Tesla hits record high after 14% jump By AnoraMahmudova Reporter NEW YORK (MarketWatch) — U.S. stocks finished a choppy trading session lower on Tuesday as gloomy reports on home prices and consumer confidence dampened the mood. A report on home prices showed a dip in December, with the longer trend indicating a slowdown in price recovery. The U.S. consumer confidence index dropped by more than expected, reflecting lower expectations about the econo","m_szDocBody":"stock slip weak economic report published share zulily soar earning tesla hit record jump anoramahmudova reporter york marketwatch stock finished choppy trading session lower gloomy report home price consumer confidence dampened mood report home price showed dip december longer trend indicating slowdown price recovery consumer confidence index dropped expected reflecting lower expectation economy s&p index spx closed point lower briefly topping previous closing high session benchmark index struggled lift key technical level prompting selling pressure afternoon dow jone industrial average djia ended session point lower nasdaq composite comp dropped point read recap stock market live blog pace homeprice growth slowed end year fastest calendaryear price growth year data released tuesday gain slowing monthtomonth strongest part recovery home value over david blitzer chairman index committee s&p dow jone indice seasonally adjusted data exhibit softness loss momentum bloomberg home price tick december declining month consumer confidence index dipped primarily american economy month current environment improved conference board tuesday struggle bear bull failure break level yesterday bearish sign kinahan chief strategist ameritrade interesting yesterday rally reinforced year treasury yield vix index bond yield move vix percentage change pronounced added retailer share rise posting estimatebeating earning result macy inc share rose retailer fourthquarter profit beat estimate share zulily inc uszu surged topping earning expectation tractor supply tsco share rose company boosted stock buyback programme billion bid increase shareholder value share electric car maker tesla motor inc tsla leapt close record price tuesday analyst morgan stanley raised price target citing potential electric automaker disrupt industry automotive niche battery autonomous vehicle office depot inc odp share fell company fourthquarter earning loss widened sharply expense linked recent merger officemax inc onetime item share realpage inc slumped ondemand software company fourthquarter earning revenue estimate market people bank china drained billion yuan billion money market dealt heavy blow shanghai hong kong stock market shanghai composite index shcomp fell nikkei average nik gained european stock market close lower benchmark stoxx europe index nudged latesession rise gold usgch ticked finding modest support weakerthanexpected reading consumer confidence dollar extended losse euro yen storey marketwatch s&p stuck middle long youre invited tobitcoin boom bust rise bitcoin triggered lively debate risk reward virtual currency youre interested bitcoin york tuesday youre invited join evening cocktail conversation topic marketwatch senior columnist robert powell moderate panel discussion guest todd harrison founder ceo minyanville media mark william banking risk management expert professor boston university school management marketwatch investing insight event free space limited attend rsvp friday feb marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/us-stocks-drift-lower-after-confidence-data-2014-02-25","m_Places":["United States","Tesla","New York","Shanghai","Hong Kong","Most","Europe"],"m_People":["David Blitzer","Jj Kinahan","Robert Powell","Todd Harrison","Mark T. Williams"],"m_Companies":["Marketwatch","Spx","Bulls","Td Ameritrade","Treasury","Macy’s Inc.","Zulily Inc.","Tractor Supply Co","Tesla Motors Inc.","Morgan Stanley","Target","Office Depot Inc","Officemax Inc","Realpage Inc.","Bank Of China","Bust","Boston University","School Of Management","Rsvp"],"m_BiGrams":["consumer confidence","home price","stock market"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":410}
