{"m_szDocID":"1837844","m_szDocTitle":"U.S. stock futures pare losses on housing data - MarketWatch","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- U.S. stock futures pare losses on housing data Published: Feb 25, 2014 9:25 a.m. ET Share China tightens liquidity, hitting Shanghai Composite; S&P 500 to take new run at record By Markets reporter WilliamL. Watts NEW YORK (MarketWatch) — U.S. stock index futures pared losses Tuesday after a gauge of house prices and looked ahead to consumer-confidence data and a couple of Fed speakers. Home prices ticked down in December, but with seasonal adjustments, prices of homes in 20 cities tracked by S&P/Case-Shiller rose 0.8%. Futures on the Dow Jones Industrial Avera","m_szDocBody":"stock future pare losse housing data published share china tighten liquidity hitting shanghai composite s&p run record market reporter williaml watt york marketwatch stock index future pared losse gauge house price looked ahead consumerconfidence data couple fed speaker home price ticked december seasonal adjustment price home city tracked rose future dow jone industrial average usdjh flat s&p index future ussph point nasdaq future usndh inched point investor favour chinese japanese hedge fund hedge fund attracting heavy inflow investor amid solid return day big data report february consumerconfidence reading set release eastern time economist polled marketwatch expect gauge remain largely unchanged hitting fivemonth january expected slightly january spotlight economy consumer confidence staying fivemonth federal reserve governor daniel tarullo part panel discussion annual policy conference national business economic begin eastern time eastern york fed president william dudley speak global financial stability asiapacific bank supervisor auckland zealand s&p index spx rose point finish jan record close activity m&a front upbeat report german confidence s&p pushing record level factor driving advance close session high left analyst question market follow upside term fact worrying high made constantly receiving weak economic data side atlantic earning falling short expectation importantly the emergingmarket crisis footstep naeem aslam chief market analyst avatrade note image headquarter morgan chase park avenue york people bank china drained billion yuan billion money market dealt heavy blow shanghai hong kong stock market asia nikkei average nik gained shanghai composite index shcomp fell hurt losse hsbc holding plc hsba hsbc posted disappointing result monday european stock sxxp fell sixyear closing mining firm slipped weaker metal price gold usgch pulled back fourmonth high dollar extended losse euro yen share morgan chase jpm focus company hold investor day financial time reported tuesday citing source bank poised announce thousand job eliminated read expect morgan investor day meeting share electric car maker tesla motor inc tsla rose tuesday record close set monday share zulily inc uszu topping earning expectation home depot inc share rose premarket reported fiscal fourthquarter earning beat forecast lifted dividend toll brother inc tol inched premarket posting surge profit office depot inc odp share fell premarket company fourthquarter earning loss widened sharply expense linked recent merger officemax inc item macy inc share slightly retailer fourthquarter sale disappointed investor share solarcity corp scty dropped premarket solarpanel installer provided partial quarterly result late monday solarcity share darken firm delay earning share realpage inc slumped premarket trade losse ondemand software company fourthquarter earning revenue estimate storey marketwatch s&p stuck middle long youre invited tobitcoin boom bust rise bitcoin triggered lively debate risk reward virtual currency youre interested bitcoin york tuesday youre invited join evening cocktail conversation topic marketwatch senior columnist robert powell moderate panel discussion guest todd harrison founder ceo minyanville media mark william banking risk management expert professor boston university school management marketwatch investing insight event free space limited attend rsvp friday feb marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/stock-futures-dip-ahead-of-consumer-confidence-2014-02-25","m_Places":["United States","China","Shanghai","New York","Eastern","Asia","Auckland","New Zealand","Hong Kong"],"m_People":["Daniel Tarullo","William Dudley","Naeem Aslam","J.p. Morgan","Robert Powell","Todd Harrison","Mark T. Williams"],"m_Companies":["Marketwatch","Nasdaq","Federal Reserve","New York Fed","Pacific Bank","Spx","Atlantic","Afp","Getty Images","Jp Morgan","Bank Of China","Hsbc Holdings Plc","Hsbc","J.p. Morgan Chase & Co.","Financial Times","Tesla Motors Inc.","Zulily Inc.","Home Depot Inc.","Toll Brothers Inc","Office Depot Inc","Officemax Inc","Macy’s Inc.","Solarcity Corp.","Solarcity","Realpage Inc.","Bust","Boston University","School Of Management","Rsvp"],"m_BiGrams":["fourthquarter earning"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":476}
