{"m_szDocID":"1840365","m_szDocTitle":"Apple's Other Secret Project: Virtual Reality? | News & Opinion  | PCMag.com","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Apple's Other Secret Project: Virtual Reality? Apple's Other Secret Project: Virtual Reality? 10 Comments Details are scant, but the Financial Times says Apple has a big team working on VR as we speak. Is Apple going to launch a virtual reality headset alongside that electric car ? Don't rule it out. According to the Financial Times , Apple has been growing a large research team in secret. Tasked with looking into virtual reality and augmented reality, the team has already constructed some prototype headsets. We don't, however, know any details, like whether th","m_szDocBody":"apple secret project virtual reality apple secret project virtual reality comment detail scant financial time apple big team working speak apple launch virtual reality headset alongside electric car dontrule out financial time apple growing large research team secret tasked virtual reality augmented reality team constructed prototype headset dont however detail company focusing standalone virtual reality headset style oculus rift headset work conjunction iphone like samsung gear augmented reality headset microsoft hololen apple number use company new approach reality apple spill bean working well vague statement ceo tim cook week earning call cool interesting application related article report apple talk develop original show financial time apple built teamnow numbering hundredsby poaching employee place lytro microsoft company made number acquisition acquihire boost rank faceshift metaio primesense and latest flyby media flyby media specialise augmented reality singular app flyby messenger scan one surrounding catalogue item smartphone tablet see friend send message objectsye rightand app notify walk assuming place left them gather rescan object message apple care messaging aspect keen company recognition techniquesthe exact kind for say virtual reality hardware device flyby demoed application track movement space dropping dot smartphone picture environment kindof breadcrumb trail back started from est","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.pcmag.com/article2/0,2817,2498634,00.asp","m_Places":["Aix-en-provence","Est"],"m_People":["Tim Cook","Flyby Messenger"],"m_Companies":["Apple","Financial Times","Oculus","Samsung","Microsoft"],"m_BiGrams":["virtual reality","financial time","time apple","reality headset","augmented reality"],"m_TriGrams":["financial time apple"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":194}
