{"m_szDocID":"1847057","m_szDocTitle":"Hybrid aircraft design: a flying whale or a spruce goose? | ZDNet","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- Hybrid aircraft design: a flying whale or a spruce goose? A freelance Spanish industrial designer has drawn international attention to his \"Sky Whale\" futuristic hybrid plane design      A freelance Spanish industrial designer is making waves with a concept plane that’s a radical departure from today’s jetliners due to its focus on efficiency, sustainability and size. Oscar Viñals has envisioned the aptly named AWWA “Sky Wale” differently than any known aircraft. Everything from how passengers board, through its take off, flight, and landing has been re-envisio","m_szDocBody":"hybrid aircraft design flying whale spruce goose freelance spanish industrial designer drawn international attention sky whale futuristic hybrid plane design freelance spanish industrial designer making wave concept plane radical departure today jetliner due focus efficiency sustainability size oscar vial envisioned aptly named awwa sky wale differently aircraft passenger board off flight landing reenvisioned hulking threestory passenger composite plane air vertically pivoting engine large upswept wing integrated turbine control air flow generate power sky whale hybrid propulsion system operate electric vehicle electric power jet fuel possible design feature double fuselage increase flight time refuelling reducing weight avionic flybywire system assisted active sensor skin endowed sort unspecified self healing capability mention wing detach vial wrote disposition wing architecture with integrate engine separated airplane fuselage security measure hypothetical fatal case emergency landing autobreak reduce damage passenger section onboard floor status top floor class sky view business class middle tourist class sort virtual reality window assuming business model exist justify creation craft industry trending jumbosized plane incredibly costly construct sky whale live name rivalling wingspan spruce goose comparison design beg question safe fly vialss designer peer commented doesnt critiquing perceived safety flaw layout still design day inspire engineer adopt principle science fiction cynic vial concept space vehicleshas tendency reality sky whale concept video post originally published smartplanetcom gmt pst","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.zdnet.com/article/hybrid-aircraft-design-a-flying-whale-or-a-spruce-goose/","m_Places":[],"m_People":["Oscar Viñals"],"m_Companies":["Smartplanet.com"],"m_BiGrams":["sky whale"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":214}
