{"m_szDocID":"1850122","m_szDocTitle":"California Inc.: This is the week Mickey Mouse speaks Mandarin - LA Times","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- California Inc.: This is the week Mickey Mouse speaks Mandarin David Lazarus Welcome to California Inc., the weekly newsletter of the L.A. Times Business Section . I'm Business columnist David Lazarus , and here's a rundown of upcoming stories this week and the highlights of last week. First, a quick reminder to change your social media passwords. Millions of Twitter, LinkedIn, MySpace and Tumblr accounts have been reported hacked in recent days . By obtaining a database of usernames, email addresses and passwords, criminals can probe banking websites to see if","m_szDocBody":"california inc week mickey mouse speak mandarin david lazarus california inc weekly newsletter time business section business columnist david lazarus rundown upcoming storey week highlight week first quick reminder change social media password million twitter linkedin myspace tumblr account reported hacked recent day obtaining database username addresse password criminal probe banking website people login web ahead coder conference apple kick annual developer conference biggest event tech calendar san francisco apple watcher expect company fiveday conference announce software iphone ipad mac apple watch newandimproved version siri company digital assistant monday keynote event bill graham civic auditorium livestreamed applecom apple gamer gather annual showcase event video gaming industry expected draw people los angele convention centre tuesdaythroughthursday run highlight virtual reality game esport venture unveiling gaming gadget microsoft sony display video game produced studentteam finalist electronic entertainment expos college game competition satellite launch spacex elon musk hawthornebased rocket company scheduled launch pair commercial communication satellite cape canaveral fla launch afford spacex opportunity successfully land stage falcon rocket sea fourth consecutive mission satellite designed provide mobile communication asia latin america minute launch window begin pacific time interest rate federal reserve policymaker conclude twoday meeting wednesday expected announce hold key interest rate steady uncertainty economy announcement fed chairwoman janet yellen hold quarterly new conference week yellen called surprisingly weak job report disappointing signalled fed policymaker wait month interest rate hike hao mickey shanghai disneyland walt disney cos newest theme park open public thursday billion park feature themed areas hotel shopping district acre garden lake parkland resort resort construction china firm designed attract member chinas booming middle class faced shortage domestic recreational opportunity agenda skyy john owe early internet fame youtube hes amassed million subscriber cocktail tutorial channel tipsy bartender recently john switched posting recipe strawberry margarita jello shot drink facebook result million view people stopping public turned people recognise supermarket yearold barney beanery bartender type closely video creator appeal year confab digital star fan advertiser vidcon threeday event anaheim start social network planning biggest presence double video storey line storey ran time business section recent day continuing follow tesla trouble tesla motor inc fired back allegation suspension problem mainstay electric model disputed claim asked customer agreement talk federal regulator statement palo altobased electric car company safety defect car tesla cooperated fully national highway traffic safety administration agency inquired car suspension agency earlier examining potential suspension tesla model seeking additional information vehicle owner company tesla vehicle problem traced abnormal rust bank quotas bank worker routinely pressured open unneeded account customer meet strict sale goal report national employment law project page document labour advocacy group based interview worker rebuke bank sale quotas encourage unethical behaviour harm worker consumer claim mirror finding time investigation uncovered widespread complaint fake account highpressure sale quotas banking giant well fargo defended sale practise trade risk donald trump realpolitik damage californias economy report say instigating trade war china trump love cripple surge job state ucla anderson forecast california trade war reduce demand labour full employment wrote jerry nickelsburg economist ucla cowrote report california home largest port complex nation los angele long beach bring cargo arrive sea united state drug lawsuit genentech drugmaker pay million settle claim misled doctor prescribing treatment lung cancer patient company knew work result patient died earlier effective drug lawsuit brought genentech employee joined federal prosecutor allege cancer patient shot firstline treatment lawsuit said defendant opportunity away bunny buyer playboy mansion found wouldbe buyer daren metropoulos hugh hefner nextdoor neighbour struck deal purchase place million record residential property daren metropoulos son billionaire investor dean metropoulos executive private equity firm metropoulos coown hostess brand apollo global management firm helped comeback hostess twinky discontinued point offered thousand dollar ebay store begin stocking month reading recent storey publication caught eye easy money press california public water district earned rare federal penalty enron accounting lent executive million buy riverfront home loan remain unpaid year official left agency sacramento connexion sacramento bee closely panama paper find small company state capital corporate solution company address turn time panama paper hot ticket quartz serve call interesting tech ipo year company called twilio send message behalf service happy meal insightful observation guardian lowerincome american feel isolated empty yearn physical social network organically mcdonald century chuck youd wouldnt room improving classic sneaker youd wrong fast company report converse cooked totally futuristic interpretation iconic chuck taylor spare change love chuck guy worth noting sneaker shameless movie product placement ever smith completely gratuitous infatuation vintage chuck robot set year yourself latest money new time business section david lazarus column run tuesday friday daily ktlatv channel send tip feedback datemeta ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://www.latimes.com/business/lazarus/la-fi-lazarus-newsletter-californiainc-20160613-snap-story.html","m_Places":["Asia","Latin America","China","United States","Anaheim","Tesla","Palo Alto","California","Los Angeles","Long Beach","L.a.","Reading","Sacramento","Panama"],"m_People":["David Lazarus","Elon Musk","Janet Yellen","Skyy John","Donald Trump","Anderson Forecast","Jerry Nickelsburg","Daren Metropoulos","Hugh Hefner","C. Dean Metropoulos","Chuck Taylor","Will Smith"],"m_Companies":["California Inc.","Mickey Mouse","L.a. Times","Twitter","Linkedin","Myspace","Apple","Los Angeles Convention Center","Microsoft","Sony","Spacex","Pacific Time","Federal Reserve","Shanghai Disneyland","Walt Disney Co.","Youtube","Facebook","Tesla Motors Inc.","National Highway Traffic Safety Administration","Wells Fargo","Genentech","Playboy Mansion","C. Metropoulos & Co.","Hostess Brands","Apollo Global Management","Ebay","Associated Press","Enron","Sacramento Bee","Twilio","Guardian","Mcdonald","Fast Company","Ktla-tv","Channel 5"],"m_BiGrams":["david lazarus","time business","business section","interest rate"],"m_TriGrams":["time business section"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":758}
