{"m_szDocID":"1850446","m_szDocTitle":"Daily Briefing, Jan. 20 - SFGate","m_szYear":"2016","m_szDocSumamry":"Daily Briefing, Jan. 20 Chronicle Staff and News Services Updated 3:55 pm, Tuesday, January 19, 2016 Photo: Marco Garcia, Associated Press Image 1of/1 Close Image 1 of 1 Edward Snowden, appearing by video from Moscow at an ACLU Hawaii event last year, says women have been sending him racy artwork. Edward Snowden, appearing by video from Moscow at an ACLU Hawaii event last year, says women have been sending him racy artwork. Photo: Marco Garcia, Associated Press Daily Briefing, Jan. 20 Top tweet “The ‘Christmas presents’ are flattering, ladies, but the FBI has a warrant. #AndIHaveAGirl” That’s ","m_szDocBody":"daily briefing jan chronicle staff new service updated tuesday photo marco garcia press image close image edward snowden appearing video moscow aclu hawaii event year women sending racy artwork edward snowden appearing video moscow aclu hawaii event year women sending racy artwork photo marco garcia press daily briefing jan top tweet christmas present flattering lady fbi warrant #andihaveagirl edward snowden cia worker government contractor suspected copying classified information attracted sort fan art including isnt grated child play amnesty international released report accusing apple samsung microsoft tech car company indirectly employing children young sourcing mineral cobalt cobalt ore turned lithiumion battery power mobile phone laptop electric car statement techcrunch apple said underage labour tolerated supply chain proud led industry pioneering safeguard hot facebook oculus virtual reality platform office pittsburgh venturebeat quote spokeswoman oculus leased office dedicated oculus research daily briefing compiled san francisco chronicle staff new service item link twitter ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/article/Daily-Briefing-Jan-20-6769837.php","m_Places":["Moscow","Hawaii","Pittsburgh"],"m_People":["Marco Garcia","Edward Snowden"],"m_Companies":["Daily Briefing","Associated Press","Aclu","Fbi","Cia","Amnesty International","Apple","Samsung","Microsoft","Techcrunch","Facebook","Oculus","San Francisco Chronicle Staff","Twitter"],"m_BiGrams":["daily briefing","edward snowden"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":149}
