{"m_szDocID":"1850611","m_szDocTitle":"Snapchat, Faraday Future faced questions on diversity before landing tax credits - LA Times","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Snapchat, Faraday Future faced questions on diversity before landing tax credits Faraday Future groundbreaking Bizuayehu Tesfaye / AP Images for Faraday Future Faraday Future executives and Nevada Gov. Brian Sandoval dig into the dirt in North Las Vegas at a groundbreaking ceremony Wednesday. The state granted the automaker tax breaks to develop a factory there. Faraday Future executives and Nevada Gov. Brian Sandoval dig into the dirt in North Las Vegas at a groundbreaking ceremony Wednesday. The state granted the automaker tax breaks to develop a factory ther","m_szDocBody":"snapchat faraday future faced question diversity landing tax credit faraday future groundbreaking bizuayehu tesfaye image faraday future faraday future executive nevada gov brian sandoval dig dirt north las vegas groundbreaking ceremony wednesday state granted automaker tax break develop factory there faraday future executive nevada gov brian sandoval dig dirt north las vegas groundbreaking ceremony wednesday state granted automaker tax break develop factory there bizuayehu tesfaye image faraday future paresh dave liam dillon shareholder industry group employee urged hightech company hire women minority now proponent tech diversity emerged state committee award tax credit california compete committee awarded app maker snapchat inc chinesefunded electric car startup faraday future million dollar tax break thursday first southland startup fielded question committee member employing providing leadership opportunity people background committee state official power hold company accountable promise member hoping change that advocate gender racial diversity hightech job equity fastgrowing field women leader few minority underrepresented frustration pay disparity simmer dominance white asian men tech workforce worried company expert predict shortage highly skilled worker grow severe number computing job economy surge hope avoiding worsening worker crunch increasing fairness increased educational opportunity greater awareness biase thwarting minority company act enlightened selfinterest play out natasha lamb director equity research arjuna capital inquiry led inc microsoft corp disclose pay difference gender state taxpayer company thrive diversity important equation success lamb said award snapchat faraday future company yearold effort aimed increasing number wellpaying job state million tax credit approved thursday bringing total commitment million million recognisable name tech san francisco silicon valley los angele recipient include samsung electronic augmented reality tech developer magic leap inc computer game maker riot game inc credit cheque app maker credit karma inc tech provider openx technology inc apply tax break company annually hire specific number people level pay hit goal spending equipment property item company forgone credit circumstance changed official requirement added madeline janis member california compete committee company make diversity commitment fundamental about inclusion people janis cofounder social justice advocacy los angele alliance economy state official legislation required seek corporate demographic data introduce diversity criteria existing law limit studying factor including economically disadvantaged area job created strategic importance business state state negotiator scrutinise diversity issue janis vowed seat finalapproval table raise concern meeting sacramento thursday queried women faraday future hiring plan eventually approved million tax credit crystal peterson gardena company human resource director launched plan hire women people colour recruiting university technical school offering tuition reimbursement flexible schedule training manager diverse employee finding talent women diverse candidate pool easy peterson said plan commit organisation community specific measure left janis satisfied company plan hire people california year considered diversity janis asked similar question snapchat representative acknowledged venice company widening candidate pool measure hiring head diversity recruiting janis abstained voting million credit snapchat feeling uneasy investing state fund revenuegenerating company received billion venture capitalist appear more justify credit snapchat beyond potentially extra cash people special training disability barrier employment janis said snapchat declined comment release data workforce state economic development official business mandating diversity focus evaluating hiring processe establishing quotas emily yukich attorney fox rothschild los angele represent small businesse startup numerical goal result minority stuck lowpaid gig general inflexibility said addressing whether example corporate hiring committee wellrepresented valuable target root homogeneity diversity question drive applicant expand california yukich said instance snapchat won credit vote emphasise desire venice headquarter potentially employee datemeta ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://www.latimes.com/business/technology/la-fi-tn-tax-diversity-20160415-snap-story.html","m_Places":["Nevada","North Las Vegas","California","Silicon Valley","Los Angeles","Sacramento","Venice"],"m_People":["Bizuayehu Tesfaye","Brian Sandoval","Paresh Dave","Liam Dillon","Natasha Lamb","Madeline Janis","Crystal Peterson","Emily Yukich"],"m_Companies":["Ap","Facebook Inc.","Microsoft Corp.","Samsung Electronics Co","Magic Leap Inc.","Riot Games Inc.","Credit Karma Inc.","Openx Technologies Inc.","Los Angeles Alliance","Seat","Gardena","Pool","2020"],"m_BiGrams":["faraday future","tax credit","tax break","los angele"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,4,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":557}
