{"m_szDocID":"1851939","m_szDocTitle":"2015's Biggest Tech Breakthroughs - SFGate","m_szYear":"2015","m_szDocSumamry":"2015's Biggest Tech Breakthroughs Daniel B. Kline, The Motley Fool Published 7:50 am, Thursday, December 31, 2015 Technology has been racing forward at unprecedented speeds over the last few years. It's not all that long ago that carrying a cell phone was something strictly for business leaders and showy rich people. We're not even that far removed from a time when the Internet was delivered mostly by dial-up access and mostly by a a company then called America Online. Now, smartphones are ubiquitous, cheap, and more powerful than the computers of not that long ago. We're less than 10 years re","m_szDocBody":"biggest tech breakthrough daniel kline motley fool published thursday technology racing forward unprecedented speed year long ago carrying cell phone strictly business leader showy rich people removed time internet delivered dialup company called america online now smartphone ubiquitous cheap powerful computer long ago year removed iphone original model outdated flip phone late flatscreen tvs norm electric car thing private company spaceship live time innovation celebrated people company pushing bound possible past month different technology lurched forward way change people interact leave planet stuff delivered virtual reality media talking dawn virtual reality consumer technology illfated product nintendos virtual boy headsetbased game gave people minute headache proved ready mass consumption decade fit start call year viable samsung teamed samsung gear headset deliver credible virtualreality experience headset powered technology facebook oculus division require samsung galaxy smartphone serve screen samsung gear powered facebook oculus source samsung lowbudget immersive impressive experience bit novelty bit promise come gear fun super useful set table upcoming device microsoft hololen year fun talk part live moving forward cool need technology open possibility communicate interact world space longer government spacex existence year elon musk company showed true innovation leave earth atmosphere return government funded add similar work jeff bezos private spaceflight company blue origin year space exploration private spacex blue origin send upright rocket space return earth reuse process theory lower cost space travel begin making accessible entity world largest government super rich spacex rocket source spacex clear future reusable space rest world playing catchup innovation taking place americas space entrepreneur charle miller president nexgenspace spaceflight consulting firm told verge signing trip moon groundwork laid past year make idea lot closer has year drone amazoncom started talking drone delivery idea preposterous hard picture sky full unmanned plane carrying package show door hour ordered them however moved lot closer possible federal aviation administration approved drone commercial use forced address ownership private citizen federal agency created rule drone user launched website owner legally personal unmanned flying craft letting amazon drone delivery moved forward year faa approved business permit drone half fortune amazon drone prototype source amazon amazon approval launch drone legally testing them day closer delivery drone happen soon commercial drone exploding walmart example petitioned faa unmanned flying machine inventory purpose delivery drone yet year drone broke toy hobbyist viable commercial product billiondollar isecret world biggest tech company forgot show recent event wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/fool/article/2015-s-Biggest-Tech-Breakthroughs-6729852.php","m_Places":["America","Wall Street"],"m_People":["Daniel B. Kline","Elon Musk","Jeff Bezos","Charles Miller, President"],"m_Companies":["Motley Fool","America Online","Nintendo","Facebook","Samsung","Oculus","Microsoft","Spacex","Blue Origin","Groundwork","Amazon.com","Federal Aviation Administration","Amazon","Wal-mart","Revolution"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":413}
