{"m_szDocID":"1852377","m_szDocTitle":"Understanding the Valuation Discrepancy Between Apple, Inc. and Alphabet - SFGate","m_szYear":"2016","m_szDocSumamry":"Understanding the Valuation Discrepancy Between Apple, Inc. and Alphabet Evan Niu, CFA, The Motley Fool Published 1:30 pm, Thursday, February 4, 2016 Image source: Apple. For all intents and purpose, Apple and Alphabet are tied in the superficial race to see who has the largest market cap. Alphabet surged to take the token title of \"world's most valuable public company\" earlier this week in the wake of a strong fourth-quarter earnings release, only to give it back to the Mac maker just a couple of days later. Let's just call it even. But as both tech giants boast similar market caps, their val","m_szDocBody":"understanding valuation discrepancy apple inc alphabet evan niu cfa motley fool published thursday image source apple intent purpose apple alphabet tied superficial race largest market cap alphabet surged token world valuable public company earlier week wake strong fourthquarter earning release give back mac maker couple day later call even tech giant boast similar market cap valuation drastically different that starter lay key metric metric source reuter morningstar figure shown trailingmonth basis apple top bottom line meaningfully higher alphabet revenue grew past month alphabet earn time valuation multiple shown alphabet enjoy higher gross margin company predominantly offer software service meaningful hardware operation compared apple operating margin slightly smaller more later generally speaking valuation function future growth prospect else investor apple alphabet worth absolute dollar market cap alphabet worth lot term future growth potential door perception reason make sense apple top line massive lot move needle financially company unshakable suspicion apple revenue peaking reinforced guidance current quarter meanwhile market perceive alphabet plethora untapped opportunity perception justified company penchant experimentation time market perceive apple capable thing slight disconnect here reason alphabet called alphabet company reorganised order give greater transparency bet company reported earning release restructuring finally shed light hopeful moonshot bet billion source alphabet alphabet lost billion past year related bet largely alphabet consolidated operating margin lower apple standalone segment operating margin year basis point higher apple operating margin everybody thing apple working lot thing hear company secretive working handful promising major tech trend horizon areas tech giant investing selfdriving electric car connected home reality deeplearning artificial intelligence other apple alphabet absolutely topic question apple secretly can save occasional headline hiring activity conveniently absorbing related operating loss consolidated result r&d expense rising percentage revenue all apple disclose project operating segment thinking ahead clear apple focusing bigger ideas true moonshot apple concerned smart contact lense internet space balloon extent investor underappreciating apple potential areas recognise alphabet disconnect contribute valuation discrepancy company real test company execute burgeoning field build businesse technology true lot apple launch product successful financially gamechanging iphone apple valuation victim success trying billiondollar isecret world biggest tech company forgot show recent event wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/fool/article/Understanding-the-Valuation-Discrepancy-Between-6807592.php","m_Places":["Wall Street"],"m_People":["Evan Niu"],"m_Companies":["Apple, Inc.","Motley Fool","Apple","Reuters","Morningstar","Indeed","Google","Revolution"],"m_BiGrams":["operating margin","apple alphabet","market cap"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":373}
