{"m_szDocID":"1864853","m_szDocTitle":"Next Big Future: Futurist Magazine predictions","m_szYear":"2012","m_szDocSumamry":"textArticle -------------------- Futurist Magazine predictions The Futurist magazine has ten predictions for 2013 and beyond (but mainly up to about 2020) Most of the predictions will not be very impactful even if they are true other than the one on space access and robots to help the elderly. 1. Neuroscientists may soon be able to predict what you’ll do before you do it. NBF - too difficult to apply broadly and easily 2. Future cars will become producers of power rather than merely consumers. NBF - slow to deploy. Electric cars have had trouble getting a toe hold in the market. More light hyb","m_szDocBody":"futurist magazine prediction futurist magazine prediction but prediction impactful true space robot elderly neuroscientist predict youll nbf difficult apply broadly easily future car producer power consumer nbf slow deploy electric car trouble toe hold market light hybriding likely twenty million natural gas car billion car aquaponic recycling system kitchen nbf long time important economy increasingly jobless plenty work space age launch driven competition adventure capitalist nbf lot happen suborbital space tourism progress spacex reusable rocket big spacex blue origin succeed cloud intelligent place store data corporate reputation important maintain due transparency augmented reality robot gentler caregiver year harness noise vibration junk energy environment power gadget nbf lot economical efficient energy harvesting heat impact handheld breathalyser offer early detection infection microbe chemical attack article give quick review ycombinator stumbleupon author ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://nextbigfuture.com/2012/10/futurist-magazine-predictions.html","m_Places":["Most"],"m_People":[],"m_Companies":["About 2020","2020","Spacex","Blue Origin"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":129}
