{"m_szDocID":"1864574","m_szDocTitle":"Elon Musk Demonstrates 3D Design With Hand Gestures (Video)","m_szYear":"2013","m_szDocSumamry":"textArticle -------------------- Elon Musk Demonstrates 3D Design With Hand Gestures (Video) Originally published on Gas2 . By Christopher DeMorro. Industrialist Elon Musk has been compared to Ironman/Tony Stark for his work on the technology of the future. While we best know Musk for his work with Tesla Motors and electric cars and  teasing us with his hyperloop design , his other pet project is SpaceX, a private attempt to kickstart the space industry. One of the exciting technologies SpaceX engineers have pioneered is 3D design software, just like Tony Stark. The technology uses existing CA","m_szDocBody":"elon musk demonstrate design hand gesture video originally published gas christopher demorro industrialist elon musk compared stark work technology future musk work tesla motor electric car teasing hyperloop design pet project spacex private attempt kickstart space industry exciting technology spacex engineer pioneered design software tony stark technology existing cad software combined motion sensor cameras allowing wireless gesturing manipulate object computer screen intent technology awesome century engineer focus design natural way manipulating design tool level technology video game virtual reality technology oculus rift put design virtual threedimension allowing engineer upcloseandpersonal product technology emerging hard imagine kind motionsensing technology car tesla model forget selfdriving car drive car touching steering wheel imagine that source spacex date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter havent reader survey yet now ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2013/09/18/elon-musk-demonstrates-3d-design-hand-gestures-video/","m_Places":["Tesla"],"m_People":["Elon Musk","Christopher Demorro","Tony Stark"],"m_Companies":["Tesla Motors","Spacex","Oculus"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":139}
