{"m_szDocID":"1879019","m_szDocTitle":"MIT TechX","m_szYear":"2016","m_szDocSumamry":"Finance & Internal Relations Want to get involved? Check out our committees to the left! If you have any questions feel free to email us. Executive Team The exec team consists of the directors of all the committees of TechX. We care deeply about all the events and initiatives that we have to offer, and we strive to make our mission of empowering students through technology possible on campus. Directors: Andreea Martin HackMIT HackMIT organizes MIT's largest annual undergraduate hackathon. Over the span of a weekend, a thousand hackers from all over the world come together to experiment and inn","m_szDocBody":"finance internal relation involved cheque committee left question feel free executive team exec team consist director committee techx care deeply event initiative offer strive make mission empowering student technology campus director andreea martin hackmit hackmit organise mit largest annual undergraduate hackathon span weekend thousand hacker world experiment innovate software hardware project mit campus team work organise event blueprint smallerscale school hackathon director stef ren xfair xfair career fair technology expo split committee logistic committee handle behindthescene planning month leading xfair day xfair corporate relation team seek communicate company bring hottest tech xfair director claudia makemit makemit organise world largest hardware hackathon bringing hundred maker designer artist engineer bring crazy ideas life enthusiastic organiser passionate fostering creative collaborative environment participating hacker director abhinav venigalla projx projx team enabling mit student build cool sideproject display xfair year funded dozen project including prosthetic arm oculuscontrolled quadcopter gecko glove variety small electric vehicle student good communication organisational mentorship skill bonus enjoy building thing director vahid fazelrezai aim make stem research development accessible school student nation organise competition schooler submit project proposal select finalist awarded seed funding project think box specifically target local underprivileged student boston area director kavish gandhi developer operation project ranging behindthescene missioncritical web software publicfacing marketing campaign devop contribute techx developing programming chop student coding experience encouraged apply dev position director anthony liu marketing marketing team creative direction techx design deploy form branding advertising designer experience required videomaker social media junky people interested publicity position director annie zhang internal relation internal relation team work bring techx family organising exciting clubwide event connecting committee expanding alumni involvement upbeat energetic interested planning event meeting people helping shape techx community love director ","m_szGeo1":"United States","m_szSourceType":"source_academic","m_szSrcUrl":"http://techx.mit.edu/","m_Places":["Boston"],"m_People":["Andreea Martin","Stef Ren","Claudia Wu","Abhinav Venigalla","Kavish Gandhi","Anthony Liu","Annie Zhang"],"m_Companies":["Oculus","Box","Techx Family"],"m_BiGrams":["internal relation"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":278}
