{"m_szDocID":"1880743","m_szDocTitle":"Tesla Partner Nvidia's Q1 Sales Seen Speeding Faster Than Most | Stock News & Stock Market Analysis - IBD","m_szYear":"2016","m_szDocSumamry":"Tesla Partner Nvidia's Q1 Sales Seen Speeding Faster Than Most (Nvidia) Reprints Wall Street expects Tesla Motors ( TSLA ) partner Nvidia ( NVDA ) to post double-digit sales growth for just the second time in the past six quarters, as well as its biggest earnings growth in five quarters, when the company reports Q1 earnings Thursday. Nvidia stock has zoomed since Feb. 12, up 40% since Facebook ( FB )-owned Oculus Rift released its first virtual-reality headset. Nvidia and rival Advanced Micro Devices ( AMD ) are the recommended graphics-chip providers for laptops that work with the headsets. N","m_szDocBody":"tesla partner nvidias sale speeding faster nvidia reprint wall street expect tesla motor tsla partner nvidia nvda post doubledigit sale growth time past quarter asit biggest earning growth quarter company report earning thursday nvidia stock zoomed feb sincefacebook owned oculus rift released virtualreality headset nvidia rival advanced micro device amd recommended graphicschip provider laptop work headset nvidia stock rose fraction ahead report due close consensus analyst polled thomson reuter expect nvidiato report billion sale cent earning share item respective yearearlier quarter sale decelerate growth topthe previous quarter earning climbed %growth mark nvidias report week chipmaker samsung called truce theirtwoyear licencing battle tesla ceo elon musk call automaker manufacturer million electric vehicle boon nvidia chip power digital instrument infotainment display model teslasyettobereleased model marked overwhelming demand began taking preorder april musk tesla cfo jason wheeler told shareholder month ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.investors.com/news/technology/tesla-motors-partner-nvidia-expected-to-speed-on-q1-earnings/","m_Places":["Most","Wall Street","Tesla"],"m_People":["Elon Musk","Jason Wheeler"],"m_Companies":["Tesla Partner Nvidia","Nvidia","Tesla Motors","Tsla","Nvda","Facebook","Fb","Oculus","Advanced Micro Devices","Amd","Thomson Reuters","Samsung","2020"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":137}
