{"m_szDocID":"1881113","m_szDocTitle":"PVH rises on earnings beat; GoPro, Mobileye fall - MarketWatch","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- PVH rises on earnings beat; GoPro, Mobileye fall Published: Sept 4, 2014 2:07 p.m. ET Share Ciena slides on disappointing outlook By AngelaJohnson Reporter NEW YORK (MarketWatch) — Here are the stocks drawing the most attention during Thursday’s busy trading session: Gainers: PVH Corp. PVH, +1.59% :Second-quarter earnings at the owner of the Calvin Klein and Tommy Hilfiger clothing brands beat expectations . Tesla Motors Inc. TSLA, +1.46%   : The electric car maker is expected to announce its planned $5 billion “gigafactory later today. Shares of the Elon Musk-","m_szDocBody":"pvh rise earning beat gopro mobileye fall published sept share ciena slide disappointing outlook angelajohnson reporter york marketwatch stock drawing attention thursday busy trading session gainer pvh corp pvh secondquarter earning owner calvin klein tommy hilfiger clothing brand beat expectation tesla motor inc tsla electric car maker expected announce planned billion gigafactory today share elon muskrun company move higher decliner mobileye mbly carcamera company reported secondquarter earning sale beat estimate share soaring ipo month ensco plc esv standpoint research upgraded oil gas service company buy rating report issued late wednesday joy global joy miningequipment manufacturer earning fell short wall street expectation ticker watch apple inc aapl share slumped wednesday erasing billion company stockmarket value samsung introduced samsung gear virtualreality device developed alongside facebook oculus here argument buying opportunity h&r block inc hrb taxpreparation service firstquarter profit missed analyst estimate cerner corporation cern morgan upgraded cerner stock overweight meaning bank think return expected outperform healthcare technology sector raised price target sept ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/tesla-picks-nevada-for-battery-plant-gannett-announces-layoffs-2014-09-04","m_Places":["New York","Wall Street"],"m_People":["Tommy Hilfiger","J.p. Morgan"],"m_Companies":["Pvh","Gopro","Marketwatch","Pvh Corp.","Calvin Klein","Tesla Motors Inc.","Mobileye N.v.","Ensco Plc","Joy Global","Apple Inc.","Samsung","Facebook","Oculus","H&r Block Inc","Cerner Corporation","Cern","Target"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":160}
