{"m_szDocID":"1881012","m_szDocTitle":"Apple Car Will Be An Egg On Wheels If Motor Trend Is Right | Stock News & Stock Market Analysis - IBD","m_szYear":"2016","m_szDocSumamry":"Reprints Apple ( AAPL ) has not revealed whether it is making an electric car, but rumors of the vehicle have imaginations firing. Motor Trend, one of the most respected car magazines, on Thursday published its own speculation about the Apple Car . For its deep dive into what the Apple Car would look like, it consulted auto industry experts and faculty at the ArtCenter College of Design in Pasadena, Calif. It produced illustrations for a possible Apple Car based on the company's design ethos around simplicity and elegance as well as knowledge of where technology is headed. The artist's concept","m_szDocBody":"reprint apple aapl revealed making electric car rumour vehicle imagination firing motor trend respected car magazine published speculation apple car deep dive apple car like consulted auto industry expert faculty artcenter college design pasadena calif produced illustration apple car based company design ethos simplicity elegance knowledge technology headed artist conception apple car motor trend show eggshaped vehicle glass ceiling light gold body lacking traditional feature door handle rearview mirror sport doublewide gull wing door tronlike light bar wrap car provide turn signal indicator motor trend see apple car packed artificial intelligence autonomous driving accepting voice command siri recognise driver apple watch iphone biometric key required start centrepiece interior augmented reality windshield important information projected magazine said cameras windshield dashboard screen replace rearview mirror said augmented reality windshield persistent apple car rumour thought likeliest part survive rest project titan cancelled motor trend said electric car charged wireless induction charging wouldnt power cord said estimated people believed working apple car complex sunnyvale calif sixtyeight research apple poaching engineer telsa motor tsla car company apple targeting release car media report speculative motor trend report artist conception apple car widely mocked social media reader called sciencefiction pod design ugly ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.investors.com/news/technology/click/apple-car-will-look-like-egg-on-wheels-if-motor-trend-design-is-right/","m_Places":["Pasadena, Calif.","Sunnyvale, Calif."],"m_People":[],"m_Companies":["Apple","Aapl","Motor Trend","Artcenter College Of Design"],"m_BiGrams":["apple car","motor trend"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,5],"m_TriCnt":[],"m_iDocBodyWordCnt":195}
