{"m_szDocID":"1886979","m_szDocTitle":"Video: Is the PS4 Powerful Enough for Virtual Reality? : playstationvr","m_szYear":"2016","m_szDocSumamry":"Video: Is the PS4 Powerful Enough for Virtual Reality? : playstationvr  000Video: Is the PS4 Powerful Enough for Virtual Reality? (pushsquare.com)submitted 4 days ago by ellenolen2 commentsshareloading...  [–]Strongpillow 1 point2 points3 points 4 days ago (1 child)This fucking Headline. This was probably one of the most pointless articles I've read on this tired topic. It's literally coming out in a couple months. With the most proper AAA games and a lot of positive reviews by the people that have tried it. It works for what it's suppose to do and will obviously get better over time like all ","m_szDocBody":"video powerful virtual reality playstationvr video powerful virtual reality pushsquarecomsubmitted day ago ellenolen commentsshareloading strongpillow point point point day ago childthis fucking headline pointless article read tired topic literally coming couple month proper aaa game lot positive review people work suppose time hmd released far permalinkembedsavereportgive goldreplyjdodd point point point day ago childrenyea annoyed people posting crap people writing crap this level can electric car reach highway speed electric car year stand people write bait desire simply complete ignorance lot people read online kinda hurt psvr early life permalinkembedsaveparentreportgive goldreply jdodd point point point day ago childrenyea annoyed people posting crap people writing crap this level can electric car reach highway speed electric car year stand people write bait desire simply complete ignorance lot people read online kinda hurt psvr early life permalinkembedsaveparentreportgive goldreply","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"https://www.reddit.com/r/playstationvr/comments/4t576e/video_is_the_ps4_powerful_enough_for_virtual/?ref=search_posts","m_Places":[],"m_People":[],"m_Companies":["Aaa"],"m_BiGrams":["electric car","point day"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":133}
