{"m_szDocID":"1937915","m_szDocTitle":"A slightly off the wall theory as to why Tesla and SolarCity are merging | Fresh Business Thinking","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- A slightly off the wall theory as to why Tesla and SolarCity are merging Newsletter Signup Share: And so Tesla Motors, the company behind the Tesla electric car and the giant gigafactory is merging with Solar City. Most of the reasons are clear, but one possible explanation is not quite so obvious. That’s one company that is into electric cars and energy storage, the other into solar power. Recently, Tesla’s CEO, Elon Musk, announced plans  to have Tesla cars equipped with solar panels. So that is reason number one for the merger: bringing together a solar powe","m_szDocBody":"slightly wall theory tesla solarcity merging newsletter signup share tesla motor company tesla electric car giant gigafactory merging solar city reason clear explanation obvious company electric car energy storage solar power recently teslas ceo elon musk announced plan tesla car equipped solar panel reason number merger bringing solar power company company solar power technology reason number solar power work alongside good energy storage solar power create energy sunny stored night time darkish outside tesla owned massive gigafactory making energy storage device lithiumion battery fit pretty neatly solar panel all tesla motor forking billion solarcity corp company joining save million cost year one strapyourself outthere idea recently nissan announced trial conjunction enel battery electric car kind backup storage car use trial vehicletogrid system involve nissan leaf env owner plugging vehicle system owner flexibility power sell stored energy vehicle battery back national grid nissan said nissan electric vehicle owner play active role grid stability providing alternate source income revolutionise energy supplied grid scaled technology gamechanger owner nissan fully fledged active participant energy market idea work clever making battery technology electric nissan car car required driver apparently average owner nissan leaf quarter car battery recharging theoretical sharing economy people generate revenue asset imagine idea work tesla solar city combination work nissan thought idea elon musk surely too ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.freshbusinessthinking.com/a-slightly-off-the-wall-theory-as-to-why-tesla-and-solarcity-are-merging/","m_Places":["Tesla","Solar City","Most","Uk"],"m_People":["Elon Musk"],"m_Companies":["Solarcity","Tesla Motors","Tesla Motors Inc","Solarcity Corp","Strap","V2g Technology"],"m_BiGrams":["solar power","electric car","energy storage"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":214}
