{"m_szDocID":"1983480","m_szDocTitle":"How the Sharing Economy is Booming Without Hurting the Environment","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- How the Sharing Economy is Booming Without Hurting the Environment Watch Now November 11, 2014 Share and share alike? The sharing economy isn’t just a way for you to save money—it can also save the environment. Uber, Lyft and others shave the number of cars on the road. Leftover and Food Runners claim they're finding a place for all of our wasted food. Listia helps you trade in all the items you don't use anymore and are cluttering up your house. AirBnB is a famous example of a sharing economy business. These companies help create a more organic approach to a g","m_szDocBody":"sharing economy booming hurting environment watch share share alike sharing economy isnt save moneyit save environment uberlyft othersshave number car road leftover food runner finding place wasted food listia help trade item anymore cluttering house airbnb famous sharing economy businessthese companieshelp createa moreorganic approach green mindset forgive punthey appealto people technology making easier andmore costeffective been related green power benefit small retailer environment dont gucci shoe anymore youre market leather jacket site trade directly someone trade good credit ultimately shop withhowever person benefiting bemother earth here how minimise manufacturing cost manufacture product matter small large complex simple taxing environment mascara wand bought deepened carbon footprint resourcesit createit trade engage sharing economy fewer zero manufacturing cost item repurposed manufacturing process item world manufactured once person business benefit manufacturing process production mascara wandmade impact earth undone however even outby sharing thrifting buying used save money andthere additional manufacturing product win minimise distribution cost environmental impact manufactured distributed shipping logistic involved product manufacturer store intense however share locally truck drive long distance deliver good transportation need theyre impactful kind opting telecommuting shoppingyoure helping make world congested place related future sharing economy world built bitcoin lessen consumption technically isnt truebut lessen desire newconsumption shopping addiction real people dont impact environment head mall there misconception shopping fun rewarding physical store buy new listia ceo gee chuanghowever thrifting frugal addictive bad earth youre thrill helping environment saving money spending bring awareness green strategy site catering sharing economy highlight helpful environment theyre educating user serving them businesse embrace green initiative easyto put ecofriendliness forefront sharing doubt humanity continue large growing impact environment pitch extent slow reverse trend water shower lawn buying electric car reusing else mascara environment becomea bigger influence purchase technology company joined party providing platform enable greater attention environment people catching datemeta min read","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.entrepreneur.com/article/238958","m_Places":[],"m_People":[],"m_Companies":["Uber","Lyft","Food Runners","Airbnb","Gucci"],"m_BiGrams":["sharing economy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6],"m_TriCnt":[],"m_iDocBodyWordCnt":298}
