{"m_szDocID":"1987305","m_szDocTitle":"Share. Don’t Own: The Sharing Economy Takes Off - CKGSB Knowledge","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- CKGSB Knowledge Share. Don’t Own: The Sharing Economy Takes Off October 8, 2014 By Neelima Mahajan Leave a Comment Why own when you can share? Understanding the dynamics of the sharing economy. The sharing economy is a hit with millennials. Need a car? No need to buy one. Hire one from Zipcar. Vacationing in Paris and need a place to bunk out for the night? No problem. Rent someone’s extra bedroom via Airbnb. Going for a party and want to flaunt a Hermes clutch? Rent one for the evening on Bag Borrow or Steal. The sharing economy, which allows you access to thi","m_szDocBody":"ckgsb knowledge share dont own sharing economy take neelima mahajan leave comment share understanding dynamic sharing economy sharing economy hit millennial car buy one hire zipcar vacationing paris place bunk night problem rent someone extra bedroom airbnb party flaunt herme clutch rent evening bag borrow steal sharing economy dont buy own bustling activity giving rise business model gradually chipping revenue traditional company airbnb instance giving traditional hotel run money estimated valuation billion airbnb bigger established hotel chain uber extremely popular ridesharing cab private car rental service valued billion big sharing economy really popular disrupt traditional industry understand question sat russell belk professor marketing kraft food canada chair marketing york university schulich school business belk research examined ideas possession sharing thing believe sharing economy grow scorching pace billion interview explain why idea sharing economy gained lot currency recent year why athere reason development internet share thing music digitally also people tangible share general motor automobile example device called onstar built car programme facilitate people lend car fee people people borrow car fee hour internet part facilitated sharing digital nondigital tangible thing reason demographic nature country generation young people moving big city renting apartment finding rely public transportation dont automobile online book automobile oclock afternoon convenient generation driving lot sharing take place longterm question permanent change family move suburb buy automobile change consumption habit reason environmental people realising wasteful duplicate possession example electronic drill buy long guess product entire lifetime individual minute make sense electric drill product seldom make sense environmentally buy them borrow rent shortterm them factor caused explosion socalled sharing economy about shortterm rental true sharing typically family commonly pool resource family sharing economy take element that person owning built profit order sharing economy collaborative consumption accurate big sharing economy ain billion economy globally estimate predicted billion tremendous growth people bigger industrial revolution term impact remain overly optimistic forecast brand sharing economy click enlarge perspective sharing efficient model ait efficient term resource impact environment good melbourne australia there neighbourhood sharing organisation called sharehood person started needed wash clothes knew laundry man block away realised block hundred home washing machine sitting idle developed people put share seeking people ultimate benefit partly efficiency convenience partly feeling dont neighbour longer they correcting that efficiency not reason sharing economy work case efficient car sharing organisation place return place convenient car study zipcar that found forprofit carsharing organisation create sense community people person online but people dont that simply efficient resource cheap car gteborg bilkoop previously majornas car cooperative sweden personal operating principle efficiency forprofit organisation feeling community important notforprofit organisation key obstacle creating model aone people available finding organisation make feasible buy challenge people feeling security possession they insist television dont show people watching begin privatise greater degree began family family television family radio family automobile telephone computer obstacle extent feasible economically privately making people materialistic phone song contact partner see that dont see children parent want obstacle impediment degree people possessive own talked people childhood sharing experience positive storey people choose childhood negative sharing experience excuse didnt share adult lent jumper friend back institutional context art art dont individually picasso possibly afford online finding copy painting checking copy somehow same status picasso concern status conspicuous consumption part twoedged sword organisation called bag borrow steal pay membership fee good time louis vuitton handbag today herme birkin tomorrow gucci day prada next huge wardrobe handbag fact pay small fee dont closet rent runway company let designer dresse evening weekend buy them anonymity get stranger wealthy fabulous designer good facilitating sharing economy watch thevideo below micro level extent intellectual property obstacle creation sharing economy ait big obstacle music industry film industry industry responded socalled pirate copy good prosecute people threaten prosecution thieve internet corrupted copy basically react resist digitalization fair property finding business model work industry realising embrace sharing economy resistance futile backfire weve music industry sale decline company apple itune streaming site spotify music movie temporarily hasnt necessarily salvation music company film industry lesson film industry follow model music film industry way work sharing economy business opportunity andbusiness opportunity existing company opportunity didnt exist before people handbag bag borrow steal people afforded these market create consumer good wouldnt existed previously month ago tesla released patent fall broader conceptual framework sharing economy ait sharing intellectual property hamper electric automobile service station recharge battery people electric car brand infrastructure feasible case benefit tesla benefit accordingly firstmover term fast electric car benefit competitor good company embraced sharing model intellectual property tesla company deal tradeoff giving intellectual property give added advantage dont give added advantage added advantage patent innovation offer thing away people recognise goodwill tesla generated giving patent fact company sense altruistic benefit everyone consumer environment competitor themselve mathematic benefit cost intuitive guess benefit potentially lose gamble research talk distinguish sharing collaborative consumption practise why atake family sharing sense keeping track owe something opposed business model amount time car determine price pay for sort business model case true sharing generosity keeping track reciprocity generalised reciprocity giving keeping track giving children out expectation care age pay back sense theyll pass children good them payingitforward paying back model true sharing opposed forprofit sharing couchsurfing capital venture capital firm million dollar principle starting company people belong company share home home upset profit company goodness heart doesnt work eventually business model found make sustainable business people participate commerce manner purpose extent sharing disrupt traditional industry ait depend industry dont industry totally invulnerable doesnt stand threatened finding opportunity positively sharing clothing private personal but fact way share type clothing secondhand market clothing industry benefit form sharing safe threatened sharing economy literally firm totally immune sharing sharing possible ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://knowledge.ckgsb.edu.cn/2014/10/08/marketing/sharing-economy/","m_Places":["Paris","Canada Chair","Us","Melbourne, Australia","Göteborgs","Sweden","Tesla","Take"],"m_People":["Neelima Mahajan","Russell Belk"],"m_Companies":["Zipcar","Airbnb","Clutch","Uber","Kraft Foods","York University","School Of Business","Belk","General Motors","Guess","Pool","Louis Vuitton","Hermes Birkins","Gucci","Prada","Rent The Runway","Apple","The Thing"],"m_BiGrams":["sharing economy","business model","intellectual property","film industry","bag borrow","borrow steal","true sharing","added advantage","keeping track"],"m_TriGrams":["bag borrow steal"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[19,5,4,4,3,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":934}
