{"m_szDocID":"1991956","m_szDocTitle":"Ford GoDrive Car Sharing Arrives in London | News & Opinion  | PCMag.com","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Ford GoDrive Car Sharing Arrives in London Ford GoDrive Car Sharing Arrives in London Drivers will be able to access 50 cars across 20 locations in London, though Ford is eyeing a U.S. launch, too. Ford is testing out the sharing economy with the launch of GoDrive in London. After a successful 100-driver pilot, the company has opened the program to 1,900 more drivers, who will be able to access 50 cars across 20 locations in the English capital. Half of this fleet consists of Ford's Focus Electric vehicles, which can be reserved and unlocked through a smartphon","m_szDocBody":"ford godrive car sharing arrive london ford godrive car sharing arrive london driver car location london ford eyeing launch too ford testing sharing economy launch godrive london successful driver pilot company opened programme driver car location english capital half fleet consist ford focus electric vehicle reserved unlocked smartphone app app track cost journey real time charging driver bytheminute fee cover fuel insurance london congestion charge fiveminute grace period driver opportunity familiarise vehicle offer free charge godrive guarantee parking driver making unique carsharing service godrive london ford exploring carsharing experiment germany india dynamic shuttle shareable service offer pointtopoint pickup dropoff demand ford exploring york london related article ford focus electric price cut statement ken washington ford research advanced engineering city congested people increasingly open mean mobility car sharing proving appealing model ford offering free membership free driving credit member godrive beta programme london ford service zipcar offer perhour perday rate est","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.pcmag.com/article2/0,2817,2484674,00.asp","m_Places":["London","United States","Germany","India","New York","Est"],"m_People":["Ford Godrive","Ken Washington"],"m_Companies":["Grace","Zipcar"],"m_BiGrams":["london ford","car sharing"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":149}
