{"m_szDocID":"1992284","m_szDocTitle":"Diplomats get crash course in Silicon Valley culture - StarTribune.com","m_szYear":"2015","m_szDocSumamry":"Diplomats get crash course in Silicon Valley culture It was billed as the biggest gathering of foreign diplomats outside of Washington.  By Matt O&#x2019;Brien San Jose Mercury News April 7, 2015 — 5:45pm With an informality that surprised the guests, Tesla’s Ken Morgan, far left, director of business development and government affairs, showed off two Tesla chassis to 35 ambassadors at Tesla. Purchase: Order Reprint PALO ALTO, Calif. – Some came to replicate Silicon Valley, others to regulate it. Thirty-five foreign ambassadors representing countries as big as China and as small as Kiribati, B","m_szDocBody":"diplomat crash silicon valley culture billed biggest gathering foreign diplomat washington matt o&#xbrien san jose mercury new informality surprised guest teslas ken morgan left director business development government affair showed tesla chassis ambassador tesla purchase order reprint palo alto calif replicate silicon valley regulate thirtyfive foreign ambassador representing country big china small kiribati barbados monaco toured bay area week state department biggest diplomatic meetup washington its finding way advance small nation ambassador aunese makoi simati tuvalu country people living coral atoll south pacific its hard invest tuvalu improve internet connexion first silicon valley long drawn foreign leader hoping cultivate tech economy homeland soak wine country sun government world confronting challenge managing bay area import sharing economy ridehailing app ecommerce ambassador toured tesla powerhouse startup airbnb online peertopeer vacation rental marketplace met regulatory trouble barcelona berlin mingled san francisco city hall sen dianne feinstein dcalif secretary state george shultz trip napa valley photos nhat meyer bay area new meret bairamovich orazov turkmenistan ambassador united state checked tesla model tesla palo alto calif surprise trip drew foreign dignitary similar trip nashville fall san francisco romantic ring chief protocol peter selfridge led tour economy silicon valley beacon ambassador learning american culture ingenuity but making exchange selfridge said soughtafter diplomat chinese ambassador cui tiankai slipped organised tour nonprofit khan academy mountain private chat founder salman khan khan academy create video lesson math science subject struggled distribute mandarin china google youtube silicon valley online platform blocked government censor cui suggested interview khan academy make inroad china work chinese company google partner china encourage that cui said you local partner china thriving tech economy country appeared kind investment silicon valley firm boasted burgeoning sector weve moved century century decade ambassador hunaina mughairy sultanate oman admitted help the majority people learn internet ambassador pisan manawapat thailand country ambassador bay area internet highest iceland percent population online lowest myanmar rate closer percent world bank myanmar ambassador kyaw myo htut disputed walk teslas headquarter noting internet rapidly growing southeast asian country began opening decade tightfisted military rule were leapfrogging said ambassador crash silicon valley culture state department handler referred your excellency tech company host showed formality lousianaraised khan addressed all yall tesla employee welcomed you guy electric car chassis palo alto showroom end tour ambassador began loosening collar puzzled khan academy worker wore stuffed shark head wear funny fun yearold employee kyle slinn unperturbed ambassador continent snapped photos smartphone ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.startribune.com/diplomats-get-crash-course-in-silicon-valley-culture/298963301/","m_Places":["Silicon Valley","Washington","Tesla","Palo Alto, Calif.","China","Kiribati","Barbados","Monaco","Bay Area","Tuvalu","Barcelona","Berlin","United States","Napa","Turkmenistan","Nashville","Mountain View","Sultanate Of Oman","Thailand","Iceland","Myanmar","Palo Alto"],"m_People":["Ken Morgan","Aunese Makoi","Dianne Feinstein","George Shultz","V. Meyer","Peter Selfridge","CuI Tiankai","Salman Khan","Ambassador Hunaina Al Mughairy","Ambassador Pisan Manawapat","Kyaw Myo Htut","Kyle Slinn"],"m_Companies":["San Jose Mercury News","State Department","Meetup","Facebook","Airbnb","Bay Area News Group","Google","Youtube","World Bank"],"m_BiGrams":["silicon valley","bay area","palo alto","khan academy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":400}
