{"m_szDocID":"1996372","m_szDocTitle":"Car Sharing Startup Local Motion Gets $6 Million Investment, Steven Sinofsky On Its Board - Business Insider","m_szYear":"2013","m_szDocSumamry":"textArticle -------------------- Local Motion Steven Sinofsky is joining the board of car sharing technology   startup Local Motion.  Venture capital firm Andreessen Horowitz (AH) is investing $6   million in Local Motion. Sinofsky recently joined Andreessen Horowitz .  We spoke with Local Motion co-founder Clement Gires about his   company, and Sinofsky.  Gires and his co-founder John Stanfield were building their own   electric car at Stanford. During the process, they realized they   would be better off with the software they built to power the   car.  They created a small box that goes ins","m_szDocBody":"local motion steven sinofsky joining board car sharing technology startup local motion venture capital firm andreessen horowitz investing million local motion sinofsky recently joined andreessen horowitz spoke local motion cofounder clement gire company sinofsky gire cofounder john stanfield building electric car stanford process realised software built power car created small box inside fleet car box track car unlocked multiple user way car efficiently gire explained phone city car department today mean key people but car simultaneously vision people car way municipality eventually buy car people share car unlock car bluetooth swipe card car tracked wreck city technology rental car company corporation home multiple driver our speciality car sharing technology gire vision future people buy car buy mobility word bikeshare programme people dense urban areas local motion sinfosky raved software phone its consumer software aimed businesse sinfosky big deal andreessen horowitz line interested living urban areas firm local motion board sinofsky basically said ooh previously sinofsky microsoft led development window ceoinwaiting forced company fall amusingly gire window sinfosky major project microsoft windowsbased computer still thrilled sinofsky board because helped build largest software company world hesworking sharing economy software key local motion market typical gigantic market firm attack sinofsky point software and will evolve car huge untapped market technology company aug ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.businessinsider.com/local-motion-investment-2013-8?op=1","m_Places":[],"m_People":["Steven Sinofsky","Clement Gires","John Stanfield"],"m_Companies":["Local","Andreessen","Bluetooth","Microsoft"],"m_BiGrams":["local motion","andreessen horowitz"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3],"m_TriCnt":[],"m_iDocBodyWordCnt":209}
