{"m_szDocID":"1997096","m_szDocTitle":"Bike-sharing is a big deal  | Pittsburgh Post-Gazette","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Bike-sharing is a big deal The new Pittsburgh initiative is part of a larger transition to a new energy economy June 7, 2015 12:00 AM By Janet Larsen As summer temperatures arrive in much of the United States, people are dusting off their bicycles, pumping up the tires and hitting the trails. But in a growing number of communities, this ritual is being replaced with the swipe of a keycard or the use of a combination code to unlock a shared bicycle. What the riders may not realize is that they are participating in something much larger, a major shift in our tran","m_szDocBody":"bikesharing big deal pittsburgh initiative part larger transition energy economy janet larsen summer temperature arrive united state people dusting bicycle pumping tyre hitting trail growing number community ritual replaced swipe keycard combination code unlock shared bicycle rider realise participating larger major shift transportation energy system pittsburgh opened bikeshare programme sunday number operational system united state reached combined fleet close bicycle city launched programme spring include philadelphia dayton ohio fargo topeka kan largest united state york city bicycle picked returned hundred station lower manhattan spot bikesharing pioneer washington washington programme opened bike lane popped capital city number worker commuting bicycle doubled difficult american city exploring bike public transportation option couple year number shared bike street double large programme added place honolulu los angele existing programme expand san francisco bay area instance enlarge bikesharing programme tenfold bicycle york plan expand city bike taking basic bikesharing model step further birmingham ala plan offer electrically assisted bike open programme fall helping rider conquer hill comfortably bikesharing attractive young people enamoured car parent were local economy benefit people move wheel remaining part urban landscape passing sealedup car college university hardpressed provide parking starting embrace bikesharing americas largest automaker paired bikeshare provider zagster put fleet twowheeler employee campus detroit programme launched and month employee bike driving parking car waiting company shuttle saved equivalent full work year time gms sustainability director noted today traditional business model selling vehicle individual consumer threat social issue local air pollution congestion trend mindset sharing economy leading car manufacturer turn humble bicycle traffic congestion changing priority longer car mobility future transport system diverse bicycle connecting people buse light rail train carsharing programme million american multiply shrinking motorvehicle fleet battery cost falling electric car costcompetitive conventional vehicle power renewable energy coal smokestack replaced wind turbine rooftop covered solar panel addition increasingly costcompetitive energy sun wind inexhaustible making backbone energy transportation economy indefinitely part transition reduced fossil energy consumption traffic safer street cleaner air healthier family running fuel sourced half world away energy economy powered electricity produced mere feet head energy independence reach represent freedom sort feeling liberation experienced time bike moving fast enjoy ride janet larsen director research earth policy institute coauthor great transition shifting fossil fuel solar wind energy lester brown matthew roney emily adam ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.post-gazette.com/opinion/Op-Ed/2015/06/07/Bike-sharing-is-a-big-deal/stories/201506030036","m_Places":["Pittsburgh","United States","Philadelphia","Dayton, Ohio","Fargo, N.d.","Topeka, Kan.","New York City","Manhattan","Washington, D.c.","Washington","Honolulu","Los Angeles","New York","Birmingham, Ala.","America","Detroit"],"m_People":["Janet Larsen","Lester R. Brown","J. Matthew Roney","Emily E. Adams"],"m_Companies":["Earth Policy Institute"],"m_BiGrams":["united state"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":373}
