{"m_szDocID":"2000917","m_szDocTitle":"The Sharing Economy in 3 U.S. Cities, Part 2: Las Vegas - Collaborative ConsumptionCollaborative Consumption","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- The Sharing Economy in 3 U.S. Cities, Part 2: Las Vegas Share this Twitter Facebook Google Lucy Gao , Canadian Global Curator, visited various companies in three U.S. cities as part of a  Sharing Economy tour  sponsored by The  Washington Foreign Press Center , visiting New York, Las Vegas and San Francisco. This is part 2 of a 3-part series showcasing companies she visited in each city, featuring familiar incumbents and new startups to look out for. Part 2: Las Vegas Las Vegas may be a surprising city to think about as a sharing economy hub.  However, the Down","m_szDocBody":"sharing economy city part las vegas share lucy gao canadian global curator visited company threeus city part sharing economy tour sponsored washington foreign press centre visiting york las vegas san francisco part part sery showcasing company visited city featuring familiar incumbent startup for part las vegas las vegas surprising city sharing economy hub however downtown project launched led zappos ceo tony hsieh created thriving entrepreneurial tech ecosystem attracting startup investor ideas level york san francisco downtown project made significant improvement revitalising downtown las vegas desolate dangerous area million dollar invested land purchase construction project health culture education initiative small businesse tech startup city startup stated tony hsieh recent tech cocktail conference announced stepping project recent new media coming collaborative consumption company received funding downtown project inlas vegas stitch factory fashion coworking space creative education centre founder meghan boyd mossler inspired tech coworking movement allowed member collaborate accelerate business stitch factory designer ready studio offer service educational design workshop production manufacturing consulting mentorship opportunity member pop shop event host fashionfocused speaker sery downtown project greater community insight stitch factory square feet studio space square feet office space square feet factory warehouse space cirque soleil designer coworking space create costume las vegas show relevantthere growing trend smallerscale handmade locallyproduced product rise company etsy example stitch factory entrepreneur fashion designer expert launch product line help incubate accelerate business aim showcase product made las vegas whatis surf air allyoucanfly membership service user pay membership fee luxury travel south western city growing saving time eliminating hassle catching flight providing exceptional service insight daily departure burbank oakland carslbad hawthorne san carlos santa barbara truckee tahoe las vegas membership cost month traveller reservation time surf air fly underused private airport passenger show minute flight depart luggage fee snack beverage included membership fee relevant idea potential redefine people fly taking experience tedious complex frustrating simplifying membership model make underserviced private airport technology make booking flight easy painless surf air maintained convenience luxury flying private expensive cost flying private jet service affordable higher income individual change surf air expand city shift connect combine shared electric vehicle bike buse driver single monthly membership include aspect uber zipcar bikesharing form system aim reinvent people las vegas mobile app shift connect guarantee ability reserve vehicle driver minute located city centre insightsshift connect home largest private electric charging vehicle station fleet electric car consisting tesla model smart electric drive chevrolet volt company estimate owning car cost month shift connect cut month significant cost saving interesting aspect person bus demand acting pressure reliever network necessary ondemand bus service move greater amount people relevantcorey schreiber member support training comment millennial attached phone car shift connect replacing car key app allowing people car need removing burden ownership parking insurance gas etc well las vegas city fairly spread lack solid public transportation system making car ownership resident city ideal shift connect alternative car ownership disrupt current system las vega pilot programme theyre hoping launch city share characteristic finally fleet comprised electric vehicle system make significant environmental impact well datexpath ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.collaborativeconsumption.com/2014/10/20/the-sharing-economy-in-3-u-s-cities-part-2-las-vegas/","m_Places":["United States Cities","Las Vegas","U.s.","Washington","New York","Made","Burbank","Oakland","San Carlos","Truckee"],"m_People":["Lucy Gao","Tony Hsieh","Meghan Boyd Mossler","Corey Schreiber"],"m_Companies":["Twitter","Facebook","Google","Press Center","Zappos","Cirque Du Soleil","Travelers","Uber","Zipcar"],"m_BiGrams":["las vegas","shift connect","downtown project","stitch factory","surf air","sharing economy","square feet"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,5,4,4,4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":502}
