{"m_szDocID":"2000436","m_szDocTitle":"Uber of Rooftop Solar? Yeloha? | CleanTechnica","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Uber of Rooftop Solar? Yeloha? Originally published on Solar Love . The peer-to-peer sharing economy is simply a function of the marriage between GPS and smartphone technology. Got a car and are willing to give someone else a ride? Uber will direct you to people nearby who need a ride and are willing to pay for it. Airbnb does something similar. Got a room or house you want to rent? Tell the company about it and it will share that information with anyone who wants to visit your location. Image Credit: LBL.gov Now solar startup  Yeloha  thinks it has found a way","m_szDocBody":"uber rooftop solar yeloha originally published solar love peertopeer sharing economy simply function marriage gps smartphone technology car give ride uberwill direct people nearby ride pay itairbnb similar room house rent company share information visit location image credit lblgov solar startup yeloha think found apply new social media business clean energyyeloha cofounder ceo amit rosner problem simple accesswe found household country solar rosner told energy business matter motivation dont roof dont credit solar industry focus small addressable market lucky people people home sunny roof face south live state wealthy excellent credit lot requirement word industry picking low hanging fruit business perspective huge opportunity making connect solar rosner saysunderstanding hurdle wererosner set develop yeloha company act liaison people solarfriendly roof people buy energy roof generatea homeowner join yeloha sun host company instal solar panel roof free charge homeowner receive part energy system generate cost lower homesmonthlyutility bill rest electricity generated distributed yeloha call sun partner people living apartment building renting home way solar power yeloha purchase remaining energy generated sun host roof monthly reduction electricity bill simple idea generated intense media buzz piqued investor interest earlier year yeloha raised million sery fundraising round fundraising remain progress rosner divulge specific home yeloha hed overwhelmed tremendous outpouring public interest now service remain beta testing mode exclusively company home state massachusett rosner york state followin coming month ultimately bring people beautiful couldnt alone rosner explain platform require treehugger benefit practical here big change world reach million people provide need ideology great make technology practical online affordable sticky rosner inevitable comparison company uberhe hehas learned lot uber people monetize personal car generally bring direct revenue provided job opportunity work rosner yeloha thing here roof now put work you asset wasted you help environment save money key comparison uber rosner quick point isthat ridesharing service transform transportation altering road themselve rosner yeloha working change people electricity taking considerable task change grid infrastructure itself infrastructure work utility company rosner said explaining company plan naturally raised hackle utility company digital network top existing infrastructure understand utility concerned business model adversely affected weve found utility embracing change rosner uphill battle state prohibit party purchase tpp agreement state law designed protect utility monopoly making illegal utility generate electricity sell utility company convenience factor yeloha model hard ignorefor sun host agreement commitment credit cheque solar panel installed sun partner simpler people online solar todaythree minute later theyre connected two three solar panel start generating cleaner smarter cheaper electricity you youre dont ordeal rosner say yeloha idea sliced bread drive electric car complete short survey electric car report date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"https://cleantechnica.com/2015/09/09/uber-of-rooftop-solar-yeloha/","m_Places":["Massachusetts","New York"],"m_People":["Amit Rosner"],"m_Companies":["Yeloha","Uber","Airbnb","Rosner","Sun Partners"],"m_BiGrams":["sun host","solar panel","utility company"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":448}
