{"m_szDocID":"2040515","m_szDocTitle":"Silicon Investor (SI) -- Stock Discussion Forums","m_szYear":"2016","m_szDocSumamry":"SI  Home  Discover  Site Forums  About  Terms of Use  Privacy Policy  Copyright/IP Policy  Contact Us  About Us  FAQ  Sign In  Mail     You are not logged in.  Login  Not a Member?  Register  - its easy and free  SubjectMarks     You are not logged in.  Login  Not a Member?  Register  - its easy and free  PeopleMarks  You are not logged in.  Login  Not a Member?  Register  - its easy and free  Tools  Portfolio  Search  Subjects    Public Messages    Members    Member Profiles    My Private Messages    Quote / Chart / News   STOCKTALK  MARKETS  POLITICS  PASTIMES  Techstocks  Biotech  Non-Tech ","m_szDocBody":"home discover forum term privacy policy policy contact faq mail logged member easy free subjectmark logged member easy free peoplemark logged member easy free tool portfolio subject public message member member profile private message quote chart new stocktalk market politic pastime techstock biotech nontech microcap strategy board quote active computer software communication semiconductor web subject ticker price chg moderated total reply recent message reply day submk day apple inc aapl clean hour ago silicon motion inc simo simo elroy amd armh intc nvda amd neolib yesterday technology stock market talk don wolanchuk dry dacheif hour ago qualcomm moderated thread read rule posting qcom slacker hour ago wennerstrom semi equipment analysis sox donald wennerstrom hour ago wdc nand nvm enterprise storage system etc wdc sam oled universal display corp oled slacker hour ago apple inc unmoderated aapl research frontier refr refr aknahow hour ago asml holding asml new frank coluccio technology forum ftth yesterday investing exponential growth paul christiansen yesterday googl urlman yesterday cohu inc cohu cohu yesterday advanced micro device moderated amd amd elmer phud hour ago drone autonomous vehicle glenn petersen hour ago amazoncom inc amzn amzn clean electric car mpg what worry eric tesla evs tsla tsla savant hour ago apple tankwatch aapl zax twitter inc twtr glenn petersen minute ago crisis infinera infn fubho led light bulb manufacturing robert furman facebook inc glenn petersen yesterday netflix nflx nflx yesterday verizon communication yesterday sequan communication sqn fubho yesterday salesforcecom crm yesterday alibaba holding limited baba glenn petersen ford motor company savant minute ago printing ddd fubho hour ago mellanox technology ltd mlnx yesterday microsoft corp moderated msft msft don green yesterday nflx moderated thread nflx jbc yesterday arris inc arr arr yesterday sierra wireless inc swir swir yesterday internap network service corporation inap avid technology inc avid jakestraw cree inc cree kvh industry inc kvhi walter intel corporation intc intc minute ago mitek system mitk mitk yesterday pcp precision castpart corp pcp network inc ffiv ffiv anss ansy anss synaptic syna trimble navigation trmb boeing setting high split network security doren autodesk adsk sale increasing adsk stratasy ssy ssy palo alto network inc panw jakestraw wrapmail wrappk media industry newspaper radio movy online sam citron uber finisar fnsr fnsr airgain airg airg jakestraw gopro hero gpro fubho ingenico ingiy jakestraw microvision mvis mvis oracle corporation orcl orcl feye feye guy gadois agjunction inc precision agriculture ajxto sultan bbry blackberry fka rimm research motion bbry eric vuzix corporationvuzia visionary pick vuzi richardred dts dtsi dtsi jakestraw flyht aerospace solution ltd flyv sultan invensense invn invn brokenstne mchp microchip technology inc mchp meetme inc meet verifone holding inc pay pay jakestraw wilan inc twin wiln nicmar sharing peertopeer ondemand economy glenn petersen cloud computing ondemand software service glenn petersen vmware inc vmw vmw cypress semiconductor lendingclub corp nonbank online lending glenn petersen redhat linux distributor ipo growth investing blackhawk network holding hawk hawk jakestraw virtual reality fubho armour inc jakestraw cisco system inc csco csco lynn xilinx xlnx xlnx novatel wireless inc nvtl nvtl bennitto applied material nopolitic thread amat amat acacia communication acia fubho splunk splk ljm lrad long range acoustic device lrad qualcomm coming buy range qcom manalagi nimble storage nmbl jakestraw corporation wdc clean gain dji tableau software data ljm ciena cien cien rovi corporation rovi rovi jakestraw smartphone tablet wearable gadget goog fubho brook automation brk technology fubho akamai akam amut american multiplex at&t discover silicon investor subject hot subject recommended poll firehose home mail hot subjectmark peoplemark keeper setting termsofuse contactus privacypolicy aboutus faq advertise copyright knight sac media right reserved stock quote delayed minute term use","m_szGeo1":"","m_szSourceType":"source_general","m_szSrcUrl":"http://www.siliconinvestor.com/home.aspx","m_Places":["United States","Most","Elroy","Tesla","Baba","Trimble","Brooks"],"m_People":["Don Wolanchuk","Donald Wennerstrom","Sam Citron","Frank Coluccio Technology","Paul H. Christiansen","Elmer Phud","Glenn Petersen","Guy Gadois"],"m_Companies":["Apple Inc.","Silicon Motion Inc.","Simo","Amd","Intc","Qualcomm","Wdc","Universal Display Corp","Apple, Inc.","Research Frontiers","Refr","Asml Holding Nv","Google","Cohu, Inc.","Cohu","Advanced Micro Devices","Amazon.com, Inc.","Amzn","Mpg","Apple","Twitter, Inc.","Facebook, Inc.","Netflix","Nflx","Verizon Communications","Vz","Salesforce.com","Alibaba Group Holding Limited","Ford Motor Company","Mellanox Technologies, Ltd.","Microsoft Corp.","The New Arris Group Inc.","Arrs","Sierra Wireless, Inc.","Swir","Internap Network Services Corporation","Avid Technology, Inc.","Avid","Cree Inc.","Kvh Industries, Inc.","Intel Corporation","Precision Castparts Corp.","F5 Networks, Inc.","Ffiv","Boeing","Autodesk","Adsk","Stratasys","Ssys","Palo Alto Networks, Inc.","Media Industries","Uber","Gopro","Microvision","Mvis","Oracle Corporation","Orcl","Agjunction Inc.","Blackberry","Research In Motion","Vuzix Corporation","Flyht Aerospace Solutions Ltd.","Microchip Technology Inc.","Meetme, Inc.","Wi-lan Inc.","Vmware, Inc.","Vmw","Cypress Semiconductor","Cy","Lendingclub Corp","Linux","Blackhawk Network","Under Armour, Inc.","Ua","Cisco Systems, Inc.","Csco","Xilinx","Xlnx","Novatel","Applied Materials","Acacia","Splunk","Nimble Storage","Sandisk Corporation","Tableau Software","Rovi Corporation","Rovi","American Multiplex","At&t","Silicon Investor","Knight Sac"],"m_BiGrams":["hour ago","glenn petersen","logged member","member easy","easy free","minute ago"],"m_TriGrams":["logged member easy","member easy free"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,7,3,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":601}
