{"m_szDocID":"304557","m_szDocTitle":"Exxon Mobil Looking into Next Generation Biofuels","m_szYear":"2009","m_szDocSumamry":"Exxon Mobil Looking into Next Generation Biofuels Published on July 14, 2009 at 7:19 AM Exxon Mobil Corporation (NYSE: XOM) announced today an alliance with leading biotech company, Synthetic Genomics Inc. (SGI), to research and develop next generation biofuels from photosynthetic algae. \"This investment comes after several years of planning and study and is an important addition to ExxonMobil's ongoing efforts to advance breakthrough technologies to help meet the world's energy challenges,\" said Dr. Emil Jacobs, vice president of research and development at ExxonMobil Research and Engineering","m_szDocBody":"exxon mobil generation biofuel published exxon mobil corporation nyse xom announced today alliance leading biotech company synthetic genomic inc sgi research develop generation biofuel photosynthetic algae this investment year planning study important addition exxonmobil ongoing effort advance breakthrough technology meet world energy challenge emil jacob vice president research development exxonmobil research engineering company meeting world growing energy demand require multitude technology energy source biofuel produced algae meaningful part solution future effort result economically viable low net carbon emission transportation fuel exxonmobil research engineering company entered research development alliance sgi privately held company focused developing genomicdriven solution founded genome pioneer craig venter develop advanced biofuel photosynthetic algae compatible today gasoline diesel fuel programme research development milestone successfully met exxonmobil expect spend million include million internal cost potentially million sgi while significant work year research development completed successful algaebased fuel meet world growing demand transportation fuel reducing greenhouse gas emission michael dolan senior vice president exxonmobil our algae biofuel programme complement exxonmobil ongoing effort reduce emission operation consumer product efficiency improvement technology breakthrough exxonmobil invested billion past year activity improve energy efficiency reduce greenhouse gas emission initiative include technology improve automobile efficiency tyre liner tyre inflated longer advanced fueleconomy engine oil lightweight automobile plastic well company researching enhanced engine efficiency developed improved lithium battery separator film hybrid electric car sponsor breakthrough research way improve solar energy biofuel carbon capture storage the real challenge creating viable generation biofuel ability produce large volume require significant advance science engineering venter ceo sgi the alliance sgi exxonmobil bring complementary capability expertise company develop innovative solution lead large scale production biofuel algae exxonmobil engineering scientific expertise utilised programme development system increase scale algae production manufacturing finished fuel added jacob after considerable study determined potential advantage benefit biofuel algae significant advantage readily sunlight carbon dioxide grow photosynthetic algae provide greenhouse gas mitigation benefit growing algae rely fresh water arable land food production lastly algae potential produce large volume oil processed existing refinery manufacture fuel compatible existing transportation technology infrastructure ","m_szGeo1":"United Kingdom","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.azom.com/news.aspx?newsID=18035","m_Places":[],"m_People":["Dr. Emil Jacobs","J. Craig Venter","Michael Dolan"],"m_Companies":["Exxon Mobil","Exxon Mobil Corporation","Alliance","Synthetic Genomics Inc.","Sgi","Exxonmobil","Engineering Company","The Alliance"],"m_BiGrams":["research development","generation biofuel","photosynthetic algae","greenhouse gas"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":331}
