{"m_szDocID":"316825","m_szDocTitle":"LG Chem Win $4.6m Contract to Develop Li-Ion Batteries for Vehicles","m_szYear":"2016","m_szDocSumamry":"LG Chem Win $4.6m Contract to Develop Li-Ion Batteries for Vehicles Published on August 24, 2004 at 1:37 AM LG Chem, Ltd. , the largest chemical company in Korea, announced today that it has been granted a USD 4.6 million contract by the United States Advanced Battery Consortium (USABC) to develop advanced Lithium-ion Polymer Battery cells for Hybrid Electric Vehicles (HEVs). The USABC was formed in 1991 by the United States Department of Energy (DOE) and the BIG Three Automakers (GM, Ford, DaimlerChrysler) with the objective of pursuing research and development of advanced energy storage syst","m_szDocBody":"chem win contract develop liion battery vehicle published chem ltd largest chemical company korea announced today granted usd million contract united state advanced battery consortium usabc develop advanced lithiumion polymer battery cell hybrid electric vehicle hevs usabc formed united state department energy doe big automaker ford daimlerchrysler objective pursuing research development advanced energy storage system contract chem compact power inc cpi chem battery system research institute jointly carry project project step twophase project development hightech battery pack system hevs phase chem develop highly advanced lithiumion polymer battery cell cpi charge development battery management system electronic software received highest score category usabc put evaluate candidate liion polymer battery development project advanced technology rechargeable battery battery system enabled asian company development contract usabc jongkee yeo cto president chem chem highly advanced technology liion polymer battery received recognition applied prototype hevs crucial factor chem winning pike peak international hill climb rally selfdeveloped liion polymer electric vehicle moreover jet propulsion laboratory evaluating chem technology mar explorer mission scheduled our liion polymer battery reduce size weight battery pack doubling power energy compared nickel metal hydride nimh battery hevs moreover customer recognised product powerful battery market compared liion battery presently development global competitor intend world industry leader taking advantage constantly upgrading technological edge cto added accordance annul growth hevs market year demand hev battery forecasted dramatically increase well with contract usabc chem advantageous position securing big automaker potential customer yeo information battery ","m_szGeo1":"United Kingdom","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.azom.com/news.aspx?newsID=1857","m_Places":["Korea","U.s.","Hill"],"m_People":["Jong-kee Yeo"],"m_Companies":["Lg Chem","Lg Chem, Ltd.","United States Department Of Energy","Doe","Daimlerchrysler","Compact Power Inc.","Nasa","Jet Propulsion Laboratory","Mars"],"m_BiGrams":["polymer battery","liion polymer"],"m_TriGrams":["liion polymer battery"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4],"m_TriCnt":[3],"m_iDocBodyWordCnt":236}
