{"m_szDocID":"316960","m_szDocTitle":"Goodyear Provides Tires to Many of the Most Fuel Efficient Cars","m_szYear":"2015","m_szDocSumamry":"Goodyear Provides Tires to Many of the Most Fuel Efficient Cars Published on June 14, 2008 at 1:20 AM As fuel prices continue to climb, most consumers are searching for ways to achieve improved gas mileage, and North America's largest tire maker has some advice. A recent posting by the U.S. Department of Energy (at http://www.fueleconomy.gov ) lists the most fuel-efficient vehicles by category, and tires produced by The Goodyear Tire & Rubber Company outfit six of the eight category leaders. No other tire manufacturer has as many standard fitments on the top gas-savers on the list as Goodyear.","m_szDocBody":"goodyear tyre fuel efficient car published fuel price continue climb consumer searching way achieve improved gas mileage north americas largest tyre maker advice recent posting department energy list fuelefficient vehicle category tyre produced goodyear tyre rubber company outfit category leader tyre manufacturer standard fitment top gassaver list goodyear addition tyre choice fuelefficient car overall toyota prius goodyear claim standard fitment categoryleading vehicle mini cooper minicompact honda fit small station waggon prius considered efficient midsize car list addition leading list goodyear fitment tyre vehicle tyre manufacturer joey viselli goodyear brand director this significant importance auto maker place vehicle fuel efficiency cafe corporate average fuel economy requirement tyre manufacturer work develop product contribute vehicle fuel mileage rating however touchpoint roadway tyre provide grip traction startup cornering braking performance sort weather varying road surface long tread life comfortable ride goodyear industry leadership fuelefficient tyre evident example key fitment fuelefficient car development work continue goodyear low rolling resistance environmentally friendly tyre distinctive rubber compound special ingredient silica biofiller functionalized polymer more concept production tyre goodyear featured fuelsaving vehicle displayed automotive gathering past year including toyota fchv fuel cell hybrid vehicle dodge durango hybrid chevrolet silverado hybrid chrysler aspen hybrid chevrolet equinox fuel cell more earlier year north american international auto show detroit goodyear tyre vehicle fuelsaving segment including dodge zeo concept electric car saab biopower concept toyota abat recently announced vehicle fitment specially compounded goodyear integrity tyre chevrolet cobalt xfe fuelefficient car claim mpg saving versus conventional cobalt tyre importance gas pump growing gas price climb average retail gasoline price jumped dollar versus yearearlier price energy department pump price risen nationwide average gallon regular grade gallon average west coast tyre care factored rising fuel price critical goodyear running tyre percent underinflated pound square inch increase fuel consumption percent that tyre tread life reduced underinflation energy department reported pound square inch tyre underinflation waste million gallon gas daily today price vehicle road huge expense underinflated tyre deflect energy increase rolling resistance rob vehicle fuel efficiency goodyearowned tyre service outlet consumer participate company free air programme tyre checked free including inspection tread condition tyre inflation air added needed free charge goodyear recommend motorist cheque tyre inflation monthly long trip tyre inflated vehicle manufacturer recommendation printed vehicle door placard owner manual maximum limit stamped tyre sidewall ","m_szGeo1":"United Kingdom","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.azom.com/news.aspx?newsID=12574","m_Places":["Most","North America","Toyota","Silverado","Detroit","U.s."],"m_People":["Joey Viselli","Inch -- Can"],"m_Companies":["Goodyear","The Goodyear Tire & Rubber Company","International Auto Show","U.s. Energy Department","Nationwide","Energy Department"],"m_BiGrams":["goodyear tyre","tyre manufacturer","fuelefficient car","vehicle fuel"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":379}
