{"m_szDocID":"327774","m_szDocTitle":"Japan to greatly increase products exports - Oil & Gas Journal","m_szYear":"2007","m_szDocSumamry":"Japan to greatly increase products exports 05/08/2007 Eric Watkins Senior Correspondent LOS ANGELES, May 8 -- Japan will increase petroleum products exports by as much as 50% this year due to a declinefor the fourth year runningin domestic demand for fuel oil.  The demand drop was caused by the increased use of natural gas by industry, as well as sales of hybrid-electric cars and other low-consumption products. Nippon Oil Corp. will try to double its petroleum exports to 2.35 million kl, as well as increase contract production for a major Chinese oil firm by 20% to 2.2 million kl. That will ","m_szDocBody":"japan greatly increase product export eric watkin senior correspondent los angele japan increase petroleum product export year due declinefor fourth year runningin domestic demand fuel oil demand drop caused increased natural gas industry sale hybridelectric car lowconsumption product nippon oil corp double petroleum export million increase contract production major chinese oil firm million give nippon export million increase cosmo oil plan raise export million largely selling jet fuel diesel market meanwhile taiyo oil midsize oil distributor reportedly upgrade create export facility step overseas shipment taiyo upgrade shiploading pump port facility mitsui oil gas set facility begin shipping jet fuel june december taiyo refine petroleum product light crude announced plan spend billion instal cracking equipment heavy oil ehime prefecture refinery ogj online dec nippon south korean refiner corp form year capital business alliance firm spend billion purchase initial stake ogj online jan contact eric watkin eni invest billion egypt gas programme oil gas new delivered inbox recieve oil gas magazine free newsletter today receive latest information oil gas complete europe gas infrastructure first eurogas chief recommend europe concentrate completing natural gas system reduce demand building lng import terminal sug bhi decline week rig count drilling rig count sat unchanged week ended oct ending straight week decline data baker socar finalise deal bitumen plant baku refinery state oil azerbaijan republic socar finalised contract austrias porner ingenieur gmbh grassroot bitumen plant part murkowski ask administration approved mexico oil swap sen lisa murkowski ralas letter commerce sec penny pritzker oil exchange mexico syngas energy holding plan louisiana methanol plant syngas energy holding llc channelview tex invest million build operate grassroot methanol production plant jame pin oak plan petroleum liquid terminal louisiana pin oak terminal llc subsidiary pin oak holding llc advancing plan build million petroleum liquid storage terminal chinese company reach separate lng shale gas pact plc chinese company signed agreement oct relating natural gas exploration supply part chinese presid essar oil wrap monthlong turnaround vadinar refinery essar oil ltd subsidiary essar energy plc concluded day planned maintenance turnaround began milliont petronas let contract rapid project staterun petronas contractor contract technip paris provide equipment technology hydrogen production ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.ogj.com/articles/2007/05/japan-to-greatly-increase-products-exports.html","m_Places":["Japan","Los Angeles","Nippon","Ehime","Egypt","Europe","Baku","Austria","Mexico","Louisiana","Channelview, Tex.","Paris"],"m_People":["Eric Watkins","Mitsui","Murkowski","Lisa Murkowski","Penny Pritzker"],"m_Companies":["Los Angeles","Nippon Oil Corp","Diesel","Sk Corp","Alliance","Oil And Gas Journal","Socar","Azerbaijan Republic","Sec","Energy Holdings Llc","Pin Oak Terminals Llc","Pin Oak Holdings Llc","Bp","Chinese Companies","Bp Plc","Essar Oil Ltd.","Essar Energy Plc","Petronas","Technip Sa"],"m_BiGrams":["oil gas","natural gas","export million","pin oak"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":353}
