{"m_szDocID":"331490","m_szDocTitle":"Linde hydrogen fueling station now operational in San Juan Capistrano - Oil & Gas 360","m_szYear":"2015","m_szDocSumamry":"Linde hydrogen fueling station now operational in San Juan Capistrano  October 8, 2015 - 6:00 AM EDT close Linde hydrogen fueling station now operational in San Juan Capistrano Second to open in California in three months; five more to follow MURRAY HILL, N.J. and NEW PROVIDENCE, N.J., Oct. 8, 2015 /PRNewswire/ -- Linde North America, Inc. today announced that its second retail hydrogen fueling station for fuel cell automobiles in California is now operational. Coinciding with National Hydrogen and Fuel Cell Day , the new station opened for business at the San Juan Capistrano Gas and Auto Serv","m_szDocBody":"linde hydrogen fueling station operational san juan capistrano edt close linde hydrogen fueling station operational san juan capistrano open california month follow murray hill providence oct linde north america inc today announced retail hydrogen fueling station fuel cell automobile california operational coinciding national hydrogen fuel cell day station opened business san juan capistrano gas auto service located junipero serra road san juan capistrano this newly operational fueling station opened ramos oil company station west sacramento earlier year mike beckmanvice president hydrogen fuelinglinde north america inc the san juan capistrano station station southern california expect open station california year starting san francisco bay area beckman point out our timing achieving operational status san juan capistrano station coincidence wanted emphasise significance senate resolution proclaiming national hydrogen fuel cell day resolution acknowledge excellent progress hydrogen fuel cell made address pressing energy environmental economic issue the california energy commission provided support project alternative renewable fuel vehicle technology programme linde san juan capistrano station part growing network hydrogen refuelling station californian fuelcell electric vehicle travel state commissioner janea scott making transition vehicle tailpipe pollution hydrogen fuelcell electric vehicle important part californias strategy address climate change ensure community clean healthy air funding california energy commission linde received support south coast air quality management district scaqmd supporting zeroemission vehicle help achieve region goal reducing harmful emission increasing zero nearzero emission vehicle including hydrogenfueled model vital achieving clean air southern california barry wallerstein executive officer scaqmd this station easy convenient hydrogen fueling boost consumer confidence cleaner pollutionfree vehicle heart hydrogen fueling system linde ionic compressor generation hydrogen compression technology enable higher throughput enhanced back back fueling with compressor linde made valuable contribution ongoing enhancement today hydrogen fueling infrastructure nitin natesan business development manager hydrogen fueling information linde ionic compressor see pleased linde brought exciting technology excited create infrastructure prove hydrogen place transportation fuel mix john adam owner san juan capistrano service station serving market exciting project involved anticipated end network approximately hydrogen fueling station operating california coming year providing significant infrastructure hydrogen fuel cell car conservative industry estimate call hydrogen powered car road california significant growth curve there linde north america member linde group financial year linde generated revenue usd eur making largest gase engineering company world approximately employee working country worldwide strategy linde geared longterm profitable growth focuse expansion international business forwardlooking product service linde act responsibly shareholder business partner employee environment business areas region location globe company committed technology product unite goal customer sustainable development information linde online ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.oilandgas360.com/linde-hydrogen-fueling-station-now-operational-in-san-juan-capistrano/","m_Places":["San Juan","California","Murray Hill, N.j.","Providence, N.j.","Sacramento","Southern","North America"],"m_People":["Linde","Capistrano","Linde North America, Inc.","Mike Beckman","Beckman","Janea A. Scott","Barry Wallerstein","John Adam"],"m_Companies":["Linde North America, Inc.","U.s. Senate","Energy Commission","South Coast Air Quality Management District","Scaqmd","Linde Group"],"m_BiGrams":["hydrogen fueling","san juan","juan capistrano","fueling station","fuel cell","hydrogen fuel","north america","capistrano station"],"m_TriGrams":["san juan capistrano","hydrogen fueling station","hydrogen fuel cell","juan capistrano station"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,8,8,5,5,4,3,3],"m_TriCnt":[8,4,4,3],"m_iDocBodyWordCnt":412}
