{"m_szDocID":"336871","m_szDocTitle":"Meetings with Chinese President Xi Jinping in United States bring agreement on tech firms - CBS News","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- CBS News CBS/AP September 22, 2015, 8:26 PM Meetings with Chinese leader bring agreement on tech firms Chinese President Xi Jinping and First Lady Peng Liyuan arrive at Paine Field in Everett, Washington, September 22, 2015. REUTERS/David Ryder Email SEATTLE - Leaders from Michigan to Beijing attended meetings Tuesday with Chinese President Xi Jinping in the U.S. and signed an agreement aimed at pushing cooperation on the use of clean tech businesses to combat climate change. The meetings with governors from five U.S. states and local Chinese officials came on ","m_szDocBody":"cbs new meeting chinese leader bring agreement tech firm chinese president jinping lady peng liyuan arrive paine field everett washington ryder seattle leader michigan beijing attended meeting chinese president jinping signed agreement aimed pushing cooperation clean tech businesse combat climate change meeting governor state local chinese official day xis visit include state dinner president barack obama washington core national leader learn from michigan gov rick snyder said noting made trip china year arrived seattle earlier day talk chinese expert businesse collaborate nuclear energy smarter electricity use deliver policy speech banquet evening visit year obama announced nation cooperate fight climate change these largest economy world biggest emitter greenhouse gase improving cooperation collaboration necessity brian young washington state director economic development clean technology sector second huge business opportunity side recognise opportunity job creation governor met included snyder jay inslee washington jerry brown california terry branstad iowa kate brown oregon signed agreement clean tech businesse chinese leader meeting included beijing mayor anshun shandong gov guo shuqing other uschina cooperation climatechange warm fuzzy point relation superpower obama thenpresident jintao formalised renewable energy partnership including establishment cleanenergy research centre focused electric vehicle cleaner coal water energy programme november obama announced country work climate change china announcing cap greenhouse gas emission sooner possible chinese police regulator cracking investor accused driving share malicious short selling seth doane report contrast hacking attack directed beijing chinas move assert territorial claim south china sea human right issue sore spot trip time chinas economic growth slowed considerably communist nation overhauling economy cleantech firm washington state rely largely hydropower natural gas cheap market investment china sooner domestically said tuesday terrapower inc energy company founded bill gate entered agreement china national nuclear corp work nextgeneration nuclear power plant technology the world lot energy reliable energy gate microsoft ceo signing ceremony china invested record billion renewable energy year frankfurt school centre climate sustainable energy finance germany supporter turned seattle chinese president dignitary travelling motorcade wendy native guangdong province lived seattle year brought yearold daughter anna china good partner now boeing microsoft said love country hundred protester religious falun gong demonstrated federal courthouse holding banner banging drum motorcade passed falun gong member persecuted china its compassion tolerance sabrina chang travelled seattle falun gong practitioner protest cbs seattle affiliate kiro report tibetan taiwanese protester filled street hotel staying protester chinese president feel street westlake park tibetan taiwanese ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cbsnews.com/news/meetings-with-chinese-leader-bring-agreement-on-tech-firms/","m_Places":["Everett, Washington","Seattle","Michigan","Beijing","United States","Washington, D.c.","China","Washington","California","Iowa","Oregon","Shandong","China Sea","Germany","Most"],"m_People":["Xi Jinping","Peng Liyuan","David Ryder","Barack Obama","Rick Snyder","Brian Young","Snyder","Jay Inslee","Washington, Jerry Brown","Terry Branstad","Wang Anshun","Hu Jintao","Seth Doane","Bill Gates","Wendy Hu","Anna Ni","Said Sabrina Chang"],"m_Companies":["Cbs News","Cbs","Ap","Reuters","Terrapower Inc.","China National Nuclear Corp.","Former Microsoft Ceo","Frankfurt School's Center","Boeing","Microsoft","Falun Gong","Westlake"],"m_BiGrams":["chinese president","climate change","falun gong"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":391}
