{"m_szDocID":"340730","m_szDocTitle":"City of Oakland Hosts Alternative Car Expo on May 28 - Oil & Gas 360","m_szYear":"2015","m_szDocSumamry":"City of Oakland Hosts Alternative Car Expo on May 28  May 20, 2015 - 9:30 AM EDT close yes               City of Oakland Hosts Alternative Car Expo on May 28 OAKLAND, Calif., May 20, 2015 /PRNewswire/ -- AltCar, the nation's leading forum for green car ride and drive and public education takes place at Oakland City Hall on Thursday May 28 from 10am – 6pm. Showcasing the area's largest selection of electric, hydrogen, natural gas, propane, biodiesel and hybrid vehicles in one location with accompanying rebate and infrastructure information. AltCar will offer free ride and drives from Honda, Nis","m_szDocBody":"city oakland host alternative car expo edt close city oakland host alternative car expo oakland calif altcar nation leading forum green car ride drive public education take place oakland city hall pmshowcasing areas largest selection electric hydrogen natural gas propane biodiesel hybrid vehicle location accompanying rebate infrastructure informationaltcar offer free ride drive honda nissan mercedesbenz smart genze debut swiftmile locking charging solution address last mile problem model year newer pevs registered bay area driversthis represent pevs registered california approximately bay areas total fleet pleased host altcar expo oakland state libby schaaf mayor city oakland creating sustainable transportation made great progress forward advance year state launches infrastructure people fuel vehicle cleaner solution environment altcar expo opportunity public learn choice rebate upcoming opportunity make informed choice altcar include conference featuring announcement debut providing clean vehicle option bay area resident businesse million onroad motor vehicle region tailpipe emission account criteria air pollutant greenhouse gase ghg generated bay areafor reason emission reduction onroad transportation sector essential attaining state federal ambient air quality standard meeting region ghg reduction commitment achieve region air quality improvement goal jack broadbent executive officer bay area air quality management district announcing commitment invest million year electric vehicle charging station conference event partner include bay area air quality management district bay area climate collaborative breathe california east bay san francisco silicon valley clean city bay area government pg&e other altcar take place oakland city hall frank ogawa plaza oakland free ride drive place ampm additional information visit call ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.oilandgas360.com/city-of-oakland-hosts-alternative-car-expo-on-may-28/","m_Places":["Oakland, Calif.","Oakland City Hall","California","Oakland","San Francisco","Silicon Valley","Oakland Ca"],"m_People":["Libby Schaaf","Jack P. Broadbent","Frank H. Ogawa Plaza"],"m_Companies":["City Of Oakland","Oakland City Hall","Honda","Mercedes-benz","Bay Area Air Quality Management District","Association Of Bay","Pg&e"],"m_BiGrams":["bay area","air quality","city oakland","ride drive"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":247}
