{"m_szDocID":"368746","m_szDocTitle":"Auto trends in 2016: Hybrids, connectivity and airbags everywhere | PlasticsToday.com","m_szYear":"2016","m_szDocSumamry":"Auto trends in 2016: Hybrids, connectivity and airbags everywhere By Stephen Moore Share Some automakers won't be sorry to see 2015 ride off into the sunset. It was a year blighted by the VW and Takata scandals and recalls, and the odd Chinese knockoff, to boot. What's in store for 2016? Here's what we at PlasticsToday foresee. Refined testing regimes The VW NOx emissions scandal has widened to include dodgy CO2 emissions and, consequently, fuel economy data. The current European fuel economy test regime borders on a joke, with automakers able to remove side mirrors, tape over gaps in body sea","m_szDocBody":"auto trend hybrid connectivity airbag stephen moore share automaker ride sunset year blighted takata scandal recall odd chinese knockoff boot store plasticstoday foresee refined testing regime nox emission scandal widened include dodgy emission and consequently fuel economy data current european fuel economy test regime border joke automaker remove side mirror tape gap body seal pump tyre nitrogen disconnect alternator charge battery official testing regulation testing regime reflect reallife driving emerge impact type car consumer opt for autonomous vehicle testing apple nontraditional carmaker working autonomous vehicle like mercede committed testing programme technologically regulatory standpoint generation selfdriving car navigating street future ralph nader argue however automaker turn car entertainment arenas mobile office promoting technology good deal potential emergency situation the driver lose control software driver control car emergency situation note appear state california agree proposed rule licenced driver driverless car used hybrid vehicle diesel key customer assemble dieselpowered vehicle diversifying client base closely component hybrid car research conducted navigant research global passenger vehicle market show compound annual growth rate cagr comparison hevs hybrid electric vehicle exhibit annual growth phevs plugin hybrid bevs battery electric vehicle period navigant expect production vehicle total million highlighting trend ford recent announcement invest billion electrified vehicle solution interconnection car connected internet year adoption take off car smartphoneconnected technology prove beneficial crash avoidance some famously ralph nader connected accident driver distraction possibility hacker taking control vehicle rise exoskeleton ageing population worker safety military application expect exoskeleton carbonfiber chairless chair introduced audi hit factory floor healthcare facility global market mobility assistance device forecast grow rate annually period research market safer car good new airbag manufacturer automaker them latest addition centre airbag installed prevent driver front seat passenger bumping head rearend impact airbag hood airbag protect pedestrian installed vehicle softer material engine cover card ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.plasticstoday.com/articles/auto-trends-2016-hybrids-connectivity-and-airbags-everywhere-151222","m_Places":["U.s."],"m_People":["Stephen Moore","Ralph Nader"],"m_Companies":["Apple","Google","State Of California","Diesel","Audi","Seat"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":294}
