{"m_szDocID":"373776","m_szDocTitle":"And the greenest car is? | PlasticsToday.com","m_szYear":"2012","m_szDocSumamry":"And the greenest car is? By PlasticsToday Staff Share It's been twelve years since an electric car was ranked the greenest car in the U.S. but Mitsubishi Motor's new i-MIEV has finally unseated the Honda Civic Natural Gas vehicle after its eight-year stint at the top. The Council for an Energy-Efficient Economy (ACEEE; Washington, DC) recently released its Council for an Energy-Efficient Economy released its 14th annual comprehensive environmental rankings for 2012 where vehicles are analyzed on the basis of a \"Green Score:\" a singular measure that incorporates unhealthy tailpipe emissions, fu","m_szDocBody":"greenest car plasticstoday staff share twelve year electric car ranked greenest car mitsubishi motor imiev finally unseated honda civic natural gas vehicle eightyear stint top council energyefficient economy aceee washington recently released council energyefficient economy released annual comprehensive environmental ranking vehicle analysed basis green score singular measure incorporate unhealthy tailpipe emission fuel consumption emission gase contribute climate change allelectric mitsubishi car judged greenest combined city highway fuel economy mile gallon equivalent imiev outpace vehicle sold united state even taking account emission generated electricity power imiev handily outscore vehicle market today aceee lead vehicle analyst shruti vaidyanathan honda civic natural gas improved fuel economy year appear place tied electric nissan leaf rounding top hybrid toyota prius hybrid honda insight gasoline engine smart fortwo year hybrid dominate greenest list occupying half spot highly efficient conventional gasoline vehicle continue presence greenest list claiming top twelve spot its increasingly obvious automaker fully invested providing consumer widest array vehicle choice earning spot greenest list proving real challenge automaker variety vehicle technology market proliferation highly efficient conventional vehicle latest technology guarantee top spot vaidyanathan year arrival number hybrid option driver hyundai kia infiniti broke top twelve year number update made green book methodology accurately estimate environmental impact vehicle include improved emission estimate vehicle manufacturing process reflecting current natural gas extraction practise consideration upcoming shift generation mix electricity power electric car aceee identify top widelyavailable model vehicle class greener choice list include truck suvs chevrolet equinox gmc canyon honda odyssey ford ffv car chevrolet sonic hyundai sonata top respective classe list demonstrate consumer make greener choice vehicle domestic manufacturer claimed twelve spot meanest meanest list year see number heavier lightduty vehicle pushing european sport car highest emitter dirtiest vehicle twin chevrolet express gmc savana cargo van ford waggon bugatti veyron sport car ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.plasticstoday.com/articles/and-greenest-car-20120214a","m_Places":["U.s.","Washington, Dc","United States"],"m_People":[],"m_Companies":["Plasticstoday Staff","Hyundai","Infiniti"],"m_BiGrams":["natural gas","greenest list"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":295}
