{"m_szDocID":"383566","m_szDocTitle":"World/nation briefs - StarTribune.com","m_szYear":"2016","m_szDocSumamry":"World/nation briefs WASHINGTON, D.C. Regulator: We 'pulled no punches' on Volt The U.S. government \"pulled no punches\" in investigating battery fires in the Volt, General Motors' electric car, said David Strickland, who heads the National Highway Traffic Safety Administration. At a combative hearing, Republicans questioned whether the government's partial ownership in the automaker created a conflict of interest for the Obama administration in the probe, which began after a test car caught fire in June; the public was notified in November. Strickland said he would have gone public immediately ","m_szDocBody":"brief washington regulator pulled punches volt government pulled punches investigating battery fire volt general motor electric car david strickland head national highway traffic safety administration combative hearing republican questioned government partial ownership automaker created conflict interest obama administration probe began test car caught fire june public notified november strickland public immediately imminent risk west bank palestinian finish talk israel palestinian authority president mahmoud abbas round exploratory discussion israel ended negligible progress iran bank leeway currency dive facing wave panic selling iranian worried sanction inflation destroying rial president mahmoud ahmadinejad allowed bank interest rate rise sharply effort stop slide depressed iran currency record low unusual aboutface european union decision cut oil purchase iran suspect nuclear energy programme russia billionaire prokhorov okd candidate central election commission invalidated substantial number million signature presented presidential candidate grigory yavlinsky virtually ensuring founder liberal yabloko party barred presidential election mikhail prokhorov billionaire owner jersey net approved joining candidate prime minister vladimir putin communist leader gennady zyuganov nationalist vladimir zhirinovsky sergei mironov russia party syria red crescent official priest killed secretarygeneral syrian arab red crescent greek orthodox christian priest killed violence flared part syria arab western nation continued attempt isolate syria unseat committee united nation agency red crescent official abdalrazzaq jbeiro shot killed travelling halabdamascus highway vehicle clearly marked red crescent emblem international committee red cross new service ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.startribune.com/world-nation-briefs/138092088/","m_Places":["Washington, D.c.","West Bank","Israel","Iran","Russian Federation","Syria","Damascus"],"m_People":["David Strickland","Mahmoud Abbas","Mahmoud Ahmadinejad","Mikhail Prokhorov","Grigory Yavlinsky","Vladimir Putin","Gennady Zyuganov","Vladimir Zhirinovsky","Sergei Mironov","Abd-al"],"m_Companies":["Volt","U.s. Government","General Motors","National Highway Traffic Safety Administration","Obama Administration","Palestinian Authority","European Union","Central Election Commission","New Jersey Nets","Red Crescent","United Nations","International Committee Of The Red Cross"],"m_BiGrams":["red crescent"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":221}
