{"m_szDocID":"383584","m_szDocTitle":"Winds of change - StarTribune.com","m_szYear":"2008","m_szDocSumamry":"Winds of change As Congress battles over the climate bill, the Midwest finds itself in an odd place.  By THE ECONOMIST Purchase: Order Reprint TOLEDO, OHIO -- Xunlight Corp., a small manufacturer of solar panels, sits on a quiet street in Toledo. It has a professor as its president, about 100 employees on its payroll and a lot of bigwig visitors. In October 2008 Sarah Palin, then the Republican vice presidential candidate, used Xunlight as the setting for a speech on energy policy. Other guests have included Ohio's governor, two U.S. senators and a member of the U.S. House. And no wonder: The ","m_szDocBody":"wind change congress battle climate bill midwest find odd place economist purchase order reprint toledo ohio xunlight corp small manufacturer solar panel sit quiet street toledo professor president employee payroll lot bigwig visitor sarah palin republican vice presidential candidate xunlight setting speech energy policy guest included ohios governor senator member house wonder firm provided evidence support seductive hope green economy revive suffering rust belt battle capandtrade bill continue congress industrial midwest find playing awkward role climate bill offer big opportunity reduce global warming boost green economy process green job loudly promoted rust belt aug president obama vice president biden travelled indiana michigan ailing swing state announce grant develop electric car hope green job matched fear traditional lost senate due debate capandtrade bill month rust belt politician heart battle industrial midwest long renaissance factory losing job decade long recession michigan home nation biggest carmaker unemployment national average green investment present hope university massachusett amherst centre american progress tank estimated federal stimulus package climate bill spur billion spending clean energy year decade spending turn create estimated million job academic researcher factory worker making wind turbine this opportunity american ingenuity renew manufacturing base argue phyllis cuttino environment pew charitable trust sign activity great lake wind network based ohio help local firm sell wind industry toledo remain example town moving economy newer one hub glass manufacturing century innovation solar technology university toledo home cluster firm xunlight state grant university hatch company regional growth partnership local business group venture capital michigan despair bred bold action past year democratic gov jennifer granholm dangled billion attract alternativeenergy firm million tax credit develop electriccar battery michigan thirdhighest number cleantech patent california york reckon pew number rise year michigan passed requirement power company boost efficiency order renewable source account percent state electricity investment federal stimulus help too shareout aug michigan won grant electric car state nevertheless cleanenergy economy remain small green job increasing number accounted percent job ohio pew share michigan indiana smaller percent percent respectively manufacturing trouble behemoth comparison accounting percent employment ohio percent michigan percent indiana dirty giant dependent cheap coal midwest emit outsize share carbon report chicago council global affair indiana worst offender spewing percent americas carbon emission home percent population capandtrade concern fear capandtrade bill expand promising sector devastate struggling larger one indiana gov mitch daniel republican worked hard maintain state manufacturing base price carbon argue threaten version capandtrade passed house meant appease critic include manufacturer eager retool industry allowance away auctioned urging member house michigan bill would tax import country restrict emission democrat wary indianas house democrat voted bill tough battle loom senate report energy information administration eia forecast house bill depress industrial shipment percent assume quick expansion nuclear plant unlikely eias worstcase scenario shipment drop percent theyre huxtering huff sen george voinovich rohio green enthusiast support nuclear power fear house bill transfer wealth heartland aug voinovich democratic colleague including midwest wrote obama fretting bill cripple manufacturing industry toledo xunlight president xunming deng forward capandtrade bill cost investment economy future say remain danger however compromise produce clunker bill slow climate change revive economy boost one depend handful state heartland ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.startribune.com/winds-of-change/53843782/","m_Places":["Toledo, Ohio","Toledo","Ohio","Belt","Indiana","Michigan","Amherst","California","New York","Last Year, Michigan","America","United States"],"m_People":["Sarah Palin","Barack Obama","Biden","Phyllis Cuttino","Jennifer Granholm","Mitch Daniels","George Voinovich","Xunming Deng"],"m_Companies":["Congress","Xunlight Corp.","U.s. House","Senate","University Of Massachusetts","Environment Group","Pew Charitable Trusts","Great Lakes Wind Network","University Of Toledo","Hatch","Chicago Council","House","2020","Democrats","House Democrats","Energy Information Administration","Eia"],"m_BiGrams":["capandtrade bill","climate bill","rust belt","green job"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":515}
