{"m_szDocID":"388544","m_szDocTitle":"Japan creating 'smart city' of the future - SFGate","m_szYear":"2010","m_szDocSumamry":"Japan creating 'smart city' of the future TECHNOLOGY Tomoko A. Hosaka, Associated Press Published 4:00 am, Monday, October 11, 2010 There were gadgets and robots galore at Japan's premier electronics show last week. But one of the biggest attractions wasn't anything you could touch - an energy-efficient city of the future. For the first time, the Combined Exhibition of Advanced Technologies, better known as CEATAC, devoted one area of the show floor to selling a vision of urban life in 2020 and beyond. 'Smart city' The Japanese version of the \"smart city\" exists in a post-fossil fuel world. Al","m_szDocBody":"japan creating smart city future technology tomoko hosaka press published monday gadget robot galore japan premier electronic show week biggest attraction touch energyefficient city future time combined exhibition advanced technology ceatac devoted area show floor selling vision urban life beyond smart city japanese version smart city exist postfossil fuel world alternative source sun wind nuclear power harnessed mass quantity power distributed building home electric car connected smart grid monitor energy network maximise efficiency goal drastically cut carbon emission scientist global warming ideally zero bigger dream smart city japan big export fueling growth ambition time country find economic rut eclipsed china world secondbiggest economy united state city yokohama southwest tokyo social infrastructure experiment create smart city rest world emulate begun year yokohama smart city project fiveyear pilot programme consortium japanese company nissan motor panasonic corp toshiba corp tokyo electric power tokyo gas accenture japan unit meidensha corp build social model overseas masato nobutoki executive director yokohamas climate change policy headquarter keynote event ceatac yokohama place foreign culture entered japan year ago spread rest country now said japan converging preparing expansion wider world japan japan country working smart grid australia committed million developing commercialscale smart grid newcastle city south wale state south korea embarking billion smart grid project jeju island part effort cut national energy consumption percent china expected invest worldleading billion smart grid related technology year ahead united state billion energy department grant market research firm zpryme zpryme estimate global smart grid market worth billion year sharply billion week toyota motor corp separately announced introduction home smart grid system japan coincide plugin hybrid car sale early smart energy called toyota smart centre calculate efficient energy eliminating waste shutting gadget taking advantage recharging benefit hybrid recharge run hard imagine nissan offering peek future ceatac centrepiece automaker pavilion theatre inch screen giving viewer virtualreality drive yokohama future virtual city tour replicated leader asia gather yokohama month asiapacific economic cooperation meeting turn talk reality minoru shinohara senior vice president technology development nissan begin selling leaf electric car december talk great fear surpassed shinohara ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/article/Japan-creating-smart-city-of-the-future-3171405.php","m_Places":["Japan","China","United States","Yokohama","Tokyo","Australia","Newcastle","New South Wales","South Korea","Jeju Island","Asia"],"m_People":["Tomoko A. Hosaka","Masato Nobutoki","Minoru Shinohara"],"m_Companies":["Associated Press","Advanced Technologies","2020","City Project","Nissan Motor Co","Panasonic Corp","Toshiba Corp","Tokyo Electric Power Co","Tokyo Gas Co.","Accenture","Meidensha Corp.","Energy Department","Zpryme","Toyota Motor Corp","Asia-pacific Economic Cooperation"],"m_BiGrams":["smart grid","smart city"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,6],"m_TriCnt":[],"m_iDocBodyWordCnt":339}
