{"m_szDocID":"392291","m_szDocTitle":"Some new developments we may have missed this week | ZDNet","m_szYear":"2010","m_szDocSumamry":"textArticle -------------------- Some new developments we may have missed this week Electrics: where do you plug in?  Our energy future and update on East Anglia hacking. Remember the hacking of the computers at the University of East Anglia's climate research unit ? Now the UK's top 'domestic extremism team\" is working with the local constabulary in trying to track down the hackers. WHERE'S OUR ENERGY FUTURE IN THE U.S.? A study released this week outlined what the U.SA. energy picture will likely took like in 2034. The greentech headline: alternative energy use will be more than twice as imp","m_szDocBody":"development missed week electric plug energy future update east anglia hacking remember hacking computer university east anglias climate research unit uks top domestic extremism team working local constabulary track hacker energy future study released week outlined usa energy picture greentech headline alternative energy important national energy supply fossil fuel provide twothird energy america use foresee continuing nuclear increase onefifth energy predict short business prettymuch usual exxon relax terrified carbon tax rest easy change folk hybrid delivery vanswhat saving national renewable energy lab released finding hybrid van realtime realworld business saving operator ups fedex post office thousand truck van real money zapcar owned local business live recharge outlet extension cord around parking lot parking garage accessible outlet pull standard roadside motel night recharge cord window downtown san francisco chicago areas america extension cord theft automatic secure location recharging needed businesse give electricity require metering etc folk thinking slow progress madebut electric vehicle general recharging assistance info plugin america recharging electric list recharging station electric vehicle noteworthy state heading arizona california georgia folk website station state oregon travel east nashville ooop information complete uptodate website data found coulomb company site american automobile association huge driver service company online locating charging station wedded gasoline gmt pst","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.zdnet.com/article/some-new-developments-we-may-have-missed-this-week/","m_Places":["Uk","United States","Chicago","America","Arizona","California","Georgia","Nashville"],"m_People":[],"m_Companies":["Energy Future","University Of East Anglia","U.sa.","Exxon","Fedex","State Of Oregon","American Automobile Association"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":202}
