{"m_szDocID":"392421","m_szDocTitle":"Oil jumps the couch, can coal be far behind? | ZDNet","m_szYear":"2008","m_szDocSumamry":"textArticle -------------------- Oil jumps the couch, can coal be far behind? $102 per barrel, does anybody bid one-oh-three?  Do I hear one-oh-five? | Topic: CXO $102 per barrel, does anybody bid one-oh-three?  Do I hear one-oh-five?  Not yet perhaps, but soon enough.  Now the excuse for record oil prices: investors are buying oil as a hedge against inflation in the American economy. And some instability in Nigeria.  Back in the old days it was gold that was a hedge, or my new fav, platinum . Lower US dollar values means higher commodity prices all round. Record crude oil prices are no longer","m_szDocBody":"oil jump couch coal behind barrel bid oneohthree hear oneohfive topic cxo barrel bid oneohthree hear oneohfive perhap enough excuse record oil price investor buying oil hedge inflation american economy instability nigeria back day gold hedge fav platinum lower dollar value mean higher commodity price round record crude oil price longer worthy headline therre storey energy biz day more coal gong front centre future energy planning purchasing policy smart green tech exec told recently expect largely fossilfuel dependent year lot coal burning lot political attention coal burning doe half energy coal quarter world coal ground burn baby burn future trend liquid fuel weaken power petroleum industry decade biofuel electric car mass transit major city increase power coal powering thng dependent natural gas fuel oil coal industry ready making outflanked pointyheaded regulator populist pol lobby baby lobby interestingdo coalfired company nuclear power play public opposition block nuclear development lot easier coal plant built nuc week missouri opted coal emission state nuclear power plant built thirty year coal war kansas continue state legislature pass bill forcing throuigh coalburning plant state epa rejected governor kansas bill legislature pass big coal lobby gmt pst","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.zdnet.com/article/oil-jumps-the-couch-can-coal-be-far-behind/","m_Places":["Nigeria","United States","Missouri","Kansas"],"m_People":[],"m_Companies":["Epa"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":189}
