{"m_szDocID":"402006","m_szDocTitle":"Toyota, BMW Power Up Fuel Cells Despite Cheap Oil | Stock News & Stock Market Analysis - IBD","m_szYear":"2016","m_szDocSumamry":"Toyota, BMW Power Up Fuel Cells Despite Cheap Oil Reprints Toyota Motor ( TM ) and BMW are reportedly discussing expanding their fuel cell partnership as Toyota continues its drive to make fuel cell cars mainstream. The news comes despite the low price of oil, which has ravaged sales of some fuel-efficient cars lately. In August, U.S. sales of Toyota’s Prius hybrid plunged 21%. BMW Chief Finance Officer Friedrich Eichiner said Tuesday at the Frankfurt Motor Show that talks between the companies will build on their existing alliance but will stop short of any kind of capital exchange, according","m_szDocBody":"toyota bmw power fuel cell cheap oil reprint toyota motor bmw reportedly discussing expanding fuel cell partnership toyota continue drive make fuel cell car mainstream new low price oil ravaged sale fuelefficient car lately august sale toyotas prius hybrid plunged bmw chief finance officer friedrich eichiner frankfurt motor show talk company build existing alliance stop short kind capital exchange wall street toyota launched mirai commercial fuelcellpowered car los angele auto show company set goal selling mirais toyotas european ceo johan van zyl told reporter frankfurt show question question hydrogen technology mainstream car reported toyota make fuel cell system hydrogen air liquide linde element fuel growth fuel cell vehicle market spur fuel cell maker company plug power plug ballard power system bldp clean energy fuel clne provide fuel cell forklift offroad vehicle buse vehicle fuelcell energy fcel make fuel cell power plant carmaker turning green technology including electric vehicle hybrid fuel cell meet increasingly stringent emission regulation elsewhere toyota bmw year confirmed pact german automaker toyotas fuel cell technology develop hybrid model bmw sery earlier month bmw revealed coupe concept sport car run toyotas hydrogen tank technology fuel cell convert chemical energy electrical energy combustion hydrogen fuel byproduct water meanwhile tesla motor tsla luxury electric vehicle maker slated launch model crossover suv sept start production model massmarket car year audi porsche owned volkswagen vlkay unveiling luxury evs frankfurt auto show toyota motor share closed stock market today tesla motor volkswagen rose plug power rose ballard sold fuelcell dipped ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.investors.com/news/toyota-bmw-said-in-talks-to-expand-fuel-cell-alliance/","m_Places":["Toyota","Frankfurt","Los Angeles","Linde","U.s."],"m_People":["Friedrich Eichiner","Johan Van Zyl"],"m_Companies":["Bmw","Toyota Motor","Tm","Alliance","Wall Street Journal","Ap","Air Liquide","Ballard Power Systems","Bldp","Clean Energy Fuels","Clne","Tesla Motors","Tsla","Audi","Volkswagen","Vlkay"],"m_BiGrams":["fuel cell","make fuel"],"m_TriGrams":["make fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[11,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":247}
