{"m_szDocID":"445451","m_szDocTitle":"Honda to offer new electric car, plug-in hybrid model by 2018 | VentureBeat | Business | by John Voelcker, Green Car Reports","m_szYear":"2015","m_szDocSumamry":"Honda to offer new electric car, plug-in hybrid model by 2018 January 14, 2015 12:01 AM Above: The 2014 Honda Accord Plug-In Hybrid Honda had no new products to unveil at this year’s Detroit Auto Show, although it did show its hydrogen fuel-cell powered Honda FCV Concept car for the first time in North America. The company announced, however, that it would produce two all-new plug-in vehicles by 2018: one battery-electric car and one plug-in hybrid. Frustratingly, however, that was absolutely all the company was willing to say. “What we’re not sharing is anything else” about either of those ve","m_szDocBody":"honda offer electric car plugin hybrid model above honda accord plugin hybrid honda product unveil year detroit auto show show hydrogen fuelcell powered honda fcv concept car time north america company announced however produce allnew plugin vehicle batteryelectric car plugin hybrid frustratingly however absolutely company say sharing vehicle robert bienenfeld honda north americas senior manager environment energy strategy hourlong roundtable reporter vehicle launched ensure hondas environmental vehicle remain strong competitor provide salesvolume pillar word company announcement morning honda offer application twomotor hybrid system offer honda accord hybrid plugin hybrid midsize sedan threemotor hybrid system acura sport luxury model future batteryelectric vehicle place honda fit compliance car offered leasenot purchasestarting fit largely showroom honda near required total zeroemission vehicle plugin hybrid number german luxury suvs introduce plugin hybrid option year however system logically acura crossover utility vehicle vehicle include audi launched yesterday detroit show media day well bmw mercedesbenz suvs gle nee mlclass gle coupe unveiled yesterday global debut gasoline price lowest level year suvs crossover utility vehicle size classe taking increasingly large share market carmaker boost fuel efficiency vehicle meet steadily rising corporate average fuel economy goal hence plugin hybrid version expensive suvs higher price electric hardware impediment sale production version hydrogenpowered fcv concept introduced month toyota mirai sale limited number region california ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://venturebeat.com/2015/01/14/honda-to-offer-new-electric-car-plug-in-hybrid-model-by-2018/","m_Places":["Detroit","North America","U.s.","Toyota","California"],"m_People":["Robert Bienenfeld"],"m_Companies":["Honda","Honda North America","Audi Q7","Bmw X5","Mercedes-benz"],"m_BiGrams":["plugin hybrid"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7],"m_TriCnt":[],"m_iDocBodyWordCnt":213}
