{"m_szDocID":"451704","m_szDocTitle":"All Articles - Oil & Gas Journal","m_szYear":"2015","m_szDocSumamry":"All Articles Statoil tests N. Sea oil, plans other projects Mon, Jan 1, 1996 Norways Den norske stats oljeselskap AS has gauged what appears to be the largest oil strike off Denmark in almost 20 years. License partner Enterprise Oil plc, London, said preliminary estimates indicate Statoils 1 Siri wildcat in Block 5604/20 of the North Sea is Denmarks biggest discovery since Skjold field was found in 1977. Meantime, Statoil announced plans to develop three discoveries near its Gullfaks field in the Norwegian North Sea as subsea satellites of Gullfaks A platform. Oil shale development scheduled i","m_szDocBody":"article statoil test sea oil plan project mon norway den norske stat oljeselskap gauged appear largest oil strike denmark year licence partner enterprise oil plc london preliminary estimate statoil siri wildcat block north sea denmark biggest discovery skjold field found meantime statoil announced plan develop discovery gullfak field norwegian north sea subsea satellite gullfak platform oil shale development scheduled australia mon canadianaustralian combine agreed proceed oil shale development programme queensland australia phased development port city gladstone produce ultimate oil stuart deposit queensland coral sea coast phase combine member suncor inc calgary spend million canadian conduct preliminary engineering complete project negotiation partner australias southern pacific petroleum central spill cleanup capability show marked improvement mon year massive exxon valdez oil spill alaska prepared respond accident major oil company established independent oil spill reaction force marine spill response corp msrc fully functional largest competitor national response corp smaller firm cooperative established cooperative strong lower west coast combined arsenal ogj newsletter mon rush impose mandate alternative vehicle fuel stumbling expected california air resource board scrap rule calling state quotas electric vehicle retain quota speculation happen study found technology commercially acceptable emission vehicle zev ogj dec industry brief mon paso city council year contract option year mesa pacific lng provide liquefied natural gas pasos sun metro transit bus system sun metro operate lng buse plan buy contract boost volume mesa pacific market mesa pacific venture mesa inc dallas pacific enterprise los angele nelsonfarrar quarterly costimating mon gary farrar contributing editor yearly value nelsonfarrar refinery inflation cost index byte based date index inception value back calculated copyright oil gas journal right reserved modification improve waterflood performance model mon elbanbi texas a&m university college station tex abdel wally king alsaud university riyadh saudi arabia abdel fattah sayyouh cairo university giza egypt modification craiggeffenmorse cgm waterflooding model improve reservoir performance prediction inclusion pressure drop variation time modified model validated numerical simulation result waterflooding increase production rate improve ultimate oil underbalanced operation offer pluse minuse mon brant bennion hycal energy research laboratory ltd calgary byte byte byte underbalanced drilling properly designed executed minimise eliminate problem invasion particulate matter formation invasion damage greatly reduce productivity oil gas reservoir open hole horizontal application industry brief mon japanese shipping company led mitsui osk line spend billion yen build liquefied natural gas carrier transport lng qatar japan recent contract qatar liquefied natural gas agreed supply million lng japan year starting watching world win algerian gas megadeal mon david knott london exploration operating ltd expect groundbreaking deal develop gas field algeria agreed algerian state firm sonatrach billion development discovery sahara desert south algier deal involve exploration potential development salah sector district sonatrach found gas reservoir district well drilled worldwide production ogj special nonopec oil supply continue grow mon global reserve crude oil remain trillion bbl ogjs annual survey producing country significant gain brazil colombia congo egypt libya nigeria oman papua guinea decrease reported indonesia norway iran canada mexico natural gas reserve slipped quadrillion major production trend lasting surge opec year worldwide production report begin detailed analysis independent explore polish licence area mon poland assigned exploration licence large onshore tract eastern baltic region unit frontier exploration salt lake city frontier poland exploration producing ltd formally received million acre tract ceremony dec approval deal local government region frontier independent operator agreement poland mining law licence require company pay fixed oil gas editorial nonopec oil supply mon half century decade end wrap coming oil supply trend turned market insideout supply organisation petroleum exporting country surging noticed early year rise oil supply selected areas opec tended dismissed temporary standard belief nonopec reserve couldnt sustain steady gain production recently moreover plummeting output russia technology temperature pressure measurement solve column operating problem mon scott golden process consulting service inc grapevine tex refinery process engineer computer modelling design monitor operate troubleshoot refinery unit basic chemical engineering principle coupled hightechnology tool offer engineer opportunity identify fix process unit problem pressure temperature composition profile fundamental process measurement simple tool identify system design operating problem africa cut price protection synfuel mon south africas cabinet unveiled plan begin phased cut price protection synthetic fuel jan expected cost johannesburg sasol ltdsouth africas largest synfuel manufacturer marketabout billion rand million mid synfuel receive tariff protection world market price oil fall half synfuel producer receive government handout world market price ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.ogj.com/all-articles.4465.leftinheritedtop_standard.html#","m_Places":["Mon","Norways","Denmark","London","North Sea","Denmarks","Australia","Queensland","Gladstone","Queenslands","Coral Sea","Calgary","Australias","Valdez","Alaska","El Paso City Council","Mesa","El Pasos","Dallas","Los Angeles","Nelson","Farrar","Tex.","Giza","Egypt","Qatar","Japan","London Bp","Algeria","Brazil","Colombia","Congo","Libya","Nigeria","Oman","Papua New Guinea","Indonesia","Norway","U.k.","Iran","Canada","Mexico","Poland","Salt Lake City","Polands","Russia","Africa","South Africas","Johannesburgs Sasol Ltd"],"m_People":["Siri","Zev","Gary Farrar","Abdel Wally","King Al-saud University Riyadh, Saudi Arabia K.a","Abd","Geffen","Brant Bennion","Mitsui O.","David Knott","Scott W. Golden"],"m_Companies":["Statoil","Enterprise Oil Plc","Statoils","Gladstone","Suncor Inc","Exxon","Spill Response Corp.","Response Corp.","California Air Resources Board","El Paso City Council","El Pasos","Metro Transit","Los Angeles","Nelson","Banbi Texas A&m University College Station","King Al-saud University Riyadh, Saudi Arabia K.a","Cairo University","Hycal Energy Research Laboratories Ltd.","Bp","London Bp","Exploration Operating Co. Ltd.","Sonatrach","Opec","Salt Lake City","Producing Co. Ltd.","Organization Of Petroleum Exporting Countries","Process Consulting Services Inc.","Johannesburgs Sasol Ltd"],"m_BiGrams":["natural gas","oil supply","mesa pacific","liquefied natural","oil gas"],"m_TriGrams":["liquefied natural gas"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":712}
