{"m_szDocID":"467724","m_szDocTitle":"What Alternative Fuels are on the Road Right Now?  - Nov 15 2015 12:00 AM - Breaking News -  Petro Online","m_szYear":"2015","m_szDocSumamry":"Nov 15 2015 12:00 AMFuel for Thought What Alternative Fuels are on the Road Right Now? Share this   There’s no denying that the world is rapidly running out of oil. So what happens when we’ve bled the planet’s resources dry? Already, scientists are starting to come up with a myriad of alternatives that could see cars, trucks, planes, trains and other vehicles powered by alternative fuels. Here are some of the top contenders that have already hit the road running: Hydrogen While it may have a dodgy reputation, hydrogen is actually an extremely safe fuel alternative. It’s used to power both fuel","m_szDocBody":"amfuel thought alternative fuel road now share denying world rapidly running oil weve bled planet resource dry already scientist starting myriad alternative car truck plane train vehicle powered alternative fuel top contender hit road running hydrogen dodgy reputation hydrogen extremely safe fuel alternative power fuel cell vehicle internal combustion engine electricity electric car revolution arrived battery technology state art today electric vehicle capable holding charge power wheel mile road trip biodiesel manufactured cooking oil grease biodiesel literally turn food waste fuel excuse indulge big mac cheap clean ecofriendly ethanol derived plant matter ethanol increasingly popular alternative fossil fuel added gasoline bid cut emission meet environmental regulation usual blend percent gasoline percent ethanol liquefied natural gas found layer underground rock lng burn cleaner oil gasoline counterpart usa lng industry booming reserve uncovered regular basis liquefied petroleum gas commonly referred propane lng coming resource liquid form extreme pressurisation dense form energy make great powering truck car compressed natural gas similar fuel cook heat home cng provided gas company selling resource highpressure cylinder simply hook canister gas engine youre good coal surprise contender coal newest fuel alternative hit road driver wont shovelling coal engine coal fired plant generate electricity power electric car ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.petro-online.com/news/fuel-for-thought/13/breaking_news/what_alternative_fuels_are_on_the_road_right_now/36934/","m_Places":["Usa"],"m_People":[],"m_Companies":["Revolution"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":199}
