{"m_szDocID":"468294","m_szDocTitle":"All Articles - Oil & Gas Journal","m_szYear":"1993","m_szDocSumamry":"All Articles A SYSTEMATIC APPROACH TO RESERVES AUDITING, TRACKING Mon, Apr 12, 1993 Peter Cockroft Pertamina-Canada Northwest Energy (South Sumatra) Ltd. Jakarta Joseph R. de Kehoe GeoMark Research Inc. Houston A major source of confusion in the oil and gas industry is the different perceptions of reserves, not only within a company-an explorationist's estimate is usually quite different from an engineer's-but also at different stages of development of the hydrocarbon resource. This commonly bemuses managers and outsiders, particularly bankers, who are accustomed to PIPELINE-WORLDWIDE CONSTRUC","m_szDocBody":"article systematic approach reserve auditing tracking mon peter cockroft pertaminacanada northwest energy south sumatra ltd jakarta joseph kehoe geomark research inc houston major source confusion oil gas industry perception reserve companyan explorationist estimate engineersbut stage development hydrocarbon resource commonly bemuse manager outsider banker accustomed pipelineworldwide construction mon designate project listed time journal arco alaska inc mile line mcintyre field prudhoe bay lisburne production facility design stage contr brown root braun completion cajon pipeline mile line offshore calif san joaquin valley oil field los angele basin completion early celreon corp mile line gaviota calif lasflore calif construction sulfurworldwide construction mon designate project listed time journal amoco oil texas city tex expansion sulphur recovery unit planned whiting tex expansion sulphur recovery unit planned salt lake city utah sulphur recovery unit engr ford bacon davis cenex farmer union laurel mont sulphur recovery unit upgrade completion mid expansion claus tail gas treating contr foster wheeler completion chevron usa salt lake city epa clarify waste exemption rcra mon environmental protection agency moved clarify oil gas production waste exempt regulation resource conservation recovery act rcra exempted general production waste now clarified status waste crude oil production service company oil pipeline gas processing plant feeder pipeline italian refiner environmental spending soar mon italian refiner environmental spending poised industry estimate italian refiner capital outlay total trillion lire billion currency spending earmarked develop cleaner fuel plantspecific environmental mitigation measure related european community regulation ogj jan mobil slate well california mon mobil exploration producing inc begun drilling programme call well year giant heavy oil field california drilling rig contract seventh join soon mobil active operator state major petroleum company slashed upstream programme favour nonus investment well planned midwaysunset south belridge lost hill field san joaquin valley san ardo field nelsonfarrar quarterly costimating indexe changed mon gerald farrar contributing editor cost selected equipment item refinery construction operation surveyed threeyear time period accompanying table show nelsonfarrar equipment indexe item equipment valve fitting showed greatest increase cost rising quarter fourth quarter slow rise natural gas motor fuel mon natural gas shot transportation fuel market before part sponsorship make significant inroad market government help beginning analysis provided natural gas vehicle advocate boone picken late month houston club distinguished speaker sery luncheon electric car chance said fluidizedbed technology continue develop mon fluidizedbed combustion technology commercially introduced decade ago promising approaches fuelefficient environmentally sound steam generation industrial utility application research development advanced fluidizedbed system power generation began foster wheeler corp launched research programme early john blizard research centre livingston the company pioneered fluidizedbed venezuelas lng project partner agreement mon venezuelas long negotiated liquefied natural gas export project green light project partner petroleos venezuela unit lagoven shell international petroleum ltd exxon corp mitsubishi corp late month signed joint venture agreement billion project develop gas field eastern venezuela export gas lng partner cristobal colon lng export project estimate preliminary investment watching washington environmental issue centre stage mon patrick crow heady day environmentalist washington greener clinton administration office senate government affair committee reported bill raise environmental protection agency cabinet status proposed department environment cabinet department house representative begun hearing similar bill epa quasicabinet agency now proponent change increase industry brief mon canadas government double funding oilsand heavy oil research centre devon alta million western research centre renamed national centre upgrading technology fiftyfour oilsand researcher move ottawa devon increasing research staff major objective centre research way reduce cost upgrading bitumen uprc complete austin chalk mon union pacific resource fort worth completed horizontal austin chalk trend south texas louisiana uprc walther unit flowed oil mmcfd gas psi flowing tubing pressure well fayette county tex portion gidding field dual opposing lateral well horizontal extension direction opposite direction total lateral displacement diverless subsea systemsconclusion feature rovs control system add flexibility cut cost mon robert rothberg johnce hall amoco production houston larry douglas oil industry engineering inc houston kerry kirkland consulting engineer houston william manuel manuel design inc houston subsea maintenance remotely operated vehicle rovs substantial role defining diverless subsea operation system complexity cost reliability affected type maintenance interface available ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.ogj.com/all-articles.4682.leftinheritedtop_standard.html","m_Places":["Mon","Canada","South Sumatra","Jakarta","Los Angeles","Gaviota, Calif.","Lasflores, Calif.","Texas","City, Tex.","Whiting, Tex.","Salt Lake City","Utah","Farmers","Mont.","U.s.a","California","Hills","Nelson","Farrar","Houston","Livingston","N.j.","Venezuela","Washington","Take Center Stage","Alta","Ottawa","Fort Worth","Austin","South Texas","Louisiana","Tex.","Giddings","Houston William S. Manuel Manuel Designs Inc.","Houston Subsea"],"m_People":["Peter Cockroft Pertamina","Kehoe","Houston A Major","Mcintyre","Engr","Claus","Ardo","Costimating How","Gerald L. Farrar","Boone Pickens","He","John Blizard","Patrick Crow","Austin Chalk","Walther Ol","Robert H. Rothberg","Larry D. Douglas","Kerry G. Kirkland","Houston William S. Manuel Manuel Designs Inc.","Houston Subsea"],"m_Companies":["Geomark Research Inc.","Pipeline","Arco Alaska Inc","Pt","Los Angeles","Celreon Corp.","Amoco Oil Co","Salt Lake City","Foster Wheeler","Chevron","Epa","Environmental Protection Agency","European Community","Mobil","Producing U.s. Inc.","Midway","Nelson","Foster Wheeler Corp","Research Center","Pioneered","Lagoven Sa","International Petroleum Co. Ltd.","Exxon Corp","Mitsubishi Corp","Take Center Stage","Senate","Cabinet Department","House Of Representatives","Devon","Alta","National Center","Union Pacific","Fayette County","Amoco Production Co","Oil Industry Engineering Inc.","Houston William S. Manuel Manuel Designs Inc."],"m_BiGrams":["sulphur recovery","recovery unit","natural gas","inc houston","mile line","italian refiner","research centre"],"m_TriGrams":["sulphur recovery unit"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,4,3,3,3,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":666}
