{"m_szDocID":"487943","m_szDocTitle":"GM testing Apple Watch app to open car doors","m_szYear":"2016","m_szDocSumamry":"GM testing Apple Watch app to open car doors John D Stoll Print Unlock your car with your Apple Watch. Source: General Motors Ever lock your keys in the car? General Motors says it’s going to have an app for that. Vice President of Strategy Mike Ableson, speaking during an analyst presentation at the company’s suburban-Detroit proving grounds, showed images of an Apple Watch app under testing that lets owners lock or unlock their cars, or start them remotely. The application would ride a trend in the auto business of moving away from conventional components to operate the car, and it is one it","m_szDocBody":"testing apple watch app open car door john stoll print unlock car apple watch source general motor lock key car general motor app that vice president strategy mike ableson speaking analyst presentation company suburbandetroit proving ground showed image apple watch app testing let owner lock unlock car start remotely application ride trend auto business moving conventional component operate car item stable experiment employing industry tech race gms exploration apple watch fuelled technology long held onstar unit telematic service fitted vehicle automaker buyer car lost key automaker laid initiative aimed helping detroit automaker compete traditional industry player including bmw taking startup uber technology tesla motor believe handle threat posed google selfpiloted car apple inc electric car targeted late decade instance year add fleet chevrolet volt drive autonomously engineering campus southeast michigan volt operate battery power mile transition gasoline engine employee allowed reserve volt app selfdriving feature travel campus fit cadillac autonomousvehicle technology year announced carsharing initiative york resident ritz plaza luxury apartment building time square shared chevrolet suvs parking spot parking garage sharing service expose people product wouldnt automaker ableson said automaker unveiled ebike concept provided detail plan put fuelcell vehicle sale codeveloped honda motor product chief mark reuss company open working japan honda product initiative wall street ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://www.theaustralian.com.au/business/technology/gm-testing-apple-watch-app-to-open-car-doors/news-story/29c24741d5ff8734296385ae553edeb0","m_Places":["Detroit","Southeast Michigan","New York","Japan"],"m_People":["John D Stoll","Mike Ableson","Mark Reuss"],"m_Companies":["General Motors","Bmw","Ups","Uber Technologies","Tesla Motors","Google","Apple Inc.","Volts","Volt","Cadillacs","Parking Spots","Honda","Wall Street Journal"],"m_BiGrams":["apple watch"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":207}
