{"m_szDocID":"488357","m_szDocTitle":"Tesla's 1,656 Job Openings Underpin Quest to Become Profitable","m_szYear":"2015","m_szDocSumamry":"Tesla's 1,656 Job Openings Underpin Quest to Become Profitable Monday, 07 Dec 2015 12:18 PM Close     Need a job? Not too particular about whether the company is profitable? Check out Tesla’s website. The maker of electric cars and energy-storage devices had 1,656 job openings posted as of Monday afternoon. Among them: a radar engineer with one to three years of experience with automotive radar systems; a manager to establish a service operation in Mexico City; product specialists in cities from Amsterdam and Milan to Shanghai and Chengdu. After losing $1.88 billion since 2007, Tesla is piling","m_szDocBody":"teslas job opening underpin quest profitable monday close jobnot company profitable cheque teslas website maker electric car energystorage device job opening posted afternoon thema radar engineer year experience automotive radar system manager establish service operation mexico city product specialist city amsterdam milan shanghai chengdu losing billion tesla piling personnel offer model build world biggest battery factory expand globally including store opening week mexico city edinburgh youngest publicly traded automaker race grow jeopardising chief executive officer elon musk push turn cashflow positive year quarter tesla face abalancing act funding rapid growth aspiration showing marketit ability deliver profit ben kallo analyst robert baird workforce expansion division task ahead carmaking battery businesse said end year initial public offering teslas headcount grown fold comparable increase enterprise value year ago thepalo alto californiabased company sold car limited edition roadster sell electric model continent tesla energy offer stationary battery system home business utility use business unit course nation youngest publicly traded automaker pipsqueak compared giant general motor employee end operate automotive brand world onstar telematic unit rapid hiring typical fastgrowing company tesla began delivering model suvs late september deliver vehicle year including vehicle fourth quarter autopilot team event marking release selfdriving feature tesla call autopilot musk autonomy electrification profound innovation auto industry tesla car shipped fourth quarter equipped combination camera radar ultrasonic sensor enable function adaptive cruise control automated lanechanging musk teslas headcount asked size autopilot unit musk small team term people working autopilot software people musk event term working autopilot hardware suite bigger people that increase time generally software amazing small team small team radical improvement big team month musk told million follower hes building team work fully autonomous car hardcore software engineer prior experience car required musk tweet mention interviewing people personally autopilot report directly super priority apple inc developing electric vehicle inc working selfdriving car startup san franciscobased cruise automation scene automotive engineer kind hot demand silicon valley tesla remain flooded job applicant company essentially acting recruiter top talent month weve million application world arnnon geshuri teslas vice president human resourcessaidin phone interview people work here executive hire manage growth tesla doesnt chief operating officer adding seasoned executive month thirdquarter earning call analyst musk announced hiring jason wheeler google chief financial officer replace retiring deepak ahuja jon mcneill ceo enservio head global sale service pretty excited people joining team expect additional announcement month add bench strength tesla management team musk copyright bloomberg new right reserved comment close ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.newsmax.com/Finance/StreetTalk/Tesla-jobs-cars-electric/2015/12/07/id/704864/","m_Places":["Tesla","Mexico City","Amsterdam","Milan","Shanghai","Chengdu","Edinburgh","U.s.","Palo Alto, California","Silicon Valley"],"m_People":["Elon Musk","Ben Kallo","Musk In A","Jason Wheeler","Deepak Ahuja","Jon Mcneill"],"m_Companies":["Rapid","Robert W. Baird & Co.","General Motors Co.","Twitter","Apple Inc.","Google Inc","Google","Enservio"],"m_BiGrams":["small team"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":404}
