{"m_szDocID":"488506","m_szDocTitle":"Doering Leasing embracing new technologies, industry changes","m_szYear":"2016","m_szDocSumamry":"Business Doering Leasing embracing new technologies, industry changes Chip Doering (left), president of Doering Fleet Management, and Adam Berger, vice president of sales, stand outside their Capitol Drive offices in Brookfield. Credit: Katie Klann Dec. 28, 2015 By Kathleen Gallagher of the Journal Sentinel Dec. 28, 2015 6 In an old-line, fiercely competitive industry that is grappling with new technologies for monitoring vehicles and their drivers, services like Uber and Lyft and the prospect of self-driven vehicles, Doering Leasing has found a way to grow. In 2009, Brookfield-based Doering s","m_szDocBody":"business doering leasing embracing technology industry chip doering left president doering fleet management adam berger vice president sale stand capitol drive office brookfield credit katie klann dec kathleen gallagher sentinel dec oldline fiercely competitive industry grappling technology monitoring vehicle driver service uber lyft prospect selfdriven vehicle doering leasing found grow brookfieldbased doering started division catapulted onceregional company national playing field called doering fleet management division helped expand business state contributed annual revenue growth adam berger coowner vice president sale architect fleet management idea year fleet management business expanded nashville tenn minneapolis opened fulltime office connecticut said anticipating growth company inside sale representative planning fill sale position nationally berger said before tiny company making headwind sheryl grossman retired earlier year job fleet operation manager healthcare that hard fleet management world fleet management industry billion year grow billion report published research market ltd dublin ireland firm market research data pressure greater operational efficiency concern environment driving growth report said technology monitor assess risk reduce cost global positioning system tracker sensor radio frequency identification tag tool were stale industry bifurcating eye berger said firm resistant change company uber potential massively disrupt industry said and half doubling technology offering broader service gps telematic track dispatch monitor fleet vehicle reduce dangerous behaviour berger said privately held doering group said example company fleet management business offer technology customised realtime feedback driver accelerate fast brake hard speed excessively help customer sort brand model technical detail make financial decision gas hybrid compressed natural gas pure electric vehicle make sense berger said focus saving customer time money business people chip doering company president coowner impressive doering level service dennis braun president chief executive officer total mechanical inc pewaukee initially braun thought doering simply provide vehicle lease learned company service that managing maintenance fighting insurer maximum accident decommissioning vehicle selling auction the scope idea braun said the process seamless economical end profitable doering biggest growth berger realised underserved area fleet management nonprofit religious organisation amazed indepth religious organisation grossman fleet manager theyre understanding part industry well taking time doering teaches group manage fleet areas maintenance fuel accident cost employee reimbursement determining time sell vehicle said berger doering educate client challenge leasing open practise line current market dynamic technology its industry needed renaissance said were kodak apple google kathleen gallagher ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.jsonline.com/business/doering-leasing-embracing-new-technologies-industry-changes-b99637107z1-363672991.html","m_Places":["Brookfield","Nashville, Tenn.","Minneapolis","Connecticut","Berger","Dublin","Ireland","Pewaukee"],"m_People":["Chip Doering","Adam Berger","Katie Klann","Kathleen Gallagher","Sheryl Grossman","Dennis Braun"],"m_Companies":["Uber","Lyft","Ge Healthcare","Markets Ltd.","Total Mechanical Inc.","Kodak","Apple","Google"],"m_BiGrams":["fleet management","berger said"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":379}
