{"m_szDocID":"490881","m_szDocTitle":"New Turns in the Race for Smarter Cars -- Tech Roundup - TheStreet","m_szYear":"2016","m_szDocSumamry":"New Turns in the Race for Smarter Cars -- Tech Roundup By Mathew Schwartz | 01/04/16 - 04:45 PM EST Reprint Ride-sharing major Lyft has just revealed a new alliance  with General Motors ( GM - Get Report ) under which the two will develop an autonomous, on-demand car network, Reuters reports. GM also invested $500 million in Lyft as part of its recent $1 billion funding round. Like its larger rival, Uber, Lyft is looking to solve the long-term problem of how it pays its drivers by automating many of them out of their jobs. But Uber wants to handle the tech side in house while Lyft is outsourci","m_szDocBody":"turn race smarter car tech roundup mathew schwartz est reprint ridesharing major lyft revealed alliance general motor report develop autonomous ondemand car network reuter report invested million lyft part recent billion funding round larger rival uber lyft solve longterm problem pay driver automating job uber handle tech side house lyft outsourcing detroit longterm threat auto sale posed socalled sharing economy attempting embed future vehicle massive selfdriving taxi network theroad future stranger twistier safer letting machine driving stock closed read electric car firm eye meanwhile driving car future ford report control entertainment toyota report adopt ford smartdevicelink software solution linking smartphone incar system reuter reported ford pushing sdl potential industrywide standard steam apple aapl alphabet googl effort rule dashboard rule smartphone ford honda hmc report subaru mazda peugeot jumping sdl bandwagon blackberry bbry report qnx software system produce infotainment system software automaker worldwide board ford closed toyota closed question tech company giving government customer data new late authority europe back door weaker encryption giant apple pushing back today tech giant economic superpower duelling out powerhouse blackberry apparently stared government pakistan information security front techcrunch reported threatening pull country governmental demand business customer data smartphone pioneer announced karachi withdrawn monitoring demand company continue serve pakistan market blackberry closed down ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.thestreet.com/story/13411366/1/new-turns-in-the-race-for-smarter-cars-tech-roundup.html?cm_ven=RSSFeed","m_Places":["Est","Detroit","Toyota","Subaru","U.s.","Europe","Pakistan","Karachi"],"m_People":["Mathew Schwartz"],"m_Companies":["Lyft","Alliance","General Motors","Reuters","Uber","Apple","Honda","Hmc","Mazda","Peugeot","Blackberry","Techcrunch"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":207}
