{"m_szDocID":"491707","m_szDocTitle":"Automakers Prepping for a Future Where Fewer People Buy Cars - NBC News","m_szYear":"2016","m_szDocSumamry":"NBC News Mar 17 2016, 5:21 pm ET Automakers Prepping for a Future Where Fewer People Buy Cars by Paul A. Eisenstein Ford's Sync 3 communications and entertainment system is displayed during a Ford Motor Co. press event for CES 2016 at the Mandalay Bay Convention Center on January 5, 2016 in Las Vegas, Neva Ethan Miller / Getty Images Share advertisement It may build cars, but Ford wants you to stop thinking of it as an automaker. Going forward, it plans to put more emphasis on what can be called \"mobility solutions.\" It will still sell you an F-150 pickup, or an Explorer SUV. But it's also get","m_szDocBody":"nbc new automaker prepping future fewer people buy car paul eisenstein ford sync communication entertainment system displayed ford motor press event ces mandalay bay convention centre las vegas neva ethan miller getty image share advertisement build car ford stop thinking automaker forward plan put emphasis called mobility solution sell pickup explorer suv businesse car ridesharing putting emphasis hightech service sync our plan quickly part growing transportation service market account trillion annual revenue global auto industry bring year noted ford ceo mark field announced creation ford smart mobility llc read more forget key car unlocked smartphone beginning year ford announced variety venture traditional line business launched partnership amazon give motorist incar hightech company voice assistant alexa motorist remotely control home thermostat light open garage door copy code website blog ford mean alone beginning year general motor launched maven carsharing service acquired bankrupt sidecar ridesharing service invested million lyft uber fastgrowing world ridesharing auto industry ceo mary barra consumer electronic show january will change year led announce major acquisition friday purchase cruise automation californiabased startup focusing development autonomous vehicle advertisement beginning coming decade fully autonomous vehicle expected hit road national highway traffic safety administration recently relax rule permit faster development technology believe yield sharp reduction highway fatality squeezing vehicle efficiently existing road read more driving decline automaker climb aboard sharing economy fully autonomous vehicle bring customer enormous benefit term greater convenience lower cost improved safety daily mobility need president dan ammann statement announcing cruise automation acquisition newly revised forecast ihs automotive predict american buy autonomous vehicle grow million decade later million car year hit road requiring driver fact control found today vehicle steering wheel pedal biggest gamechanger all analyst believe thing encouraging entrant auto industry time decade lead development driverless technology question build car seek partner secretive apple believed working autonomous technology advertisement analyst broader impact sharp decline vehicle sale thing lower operating cost service lyft uber point easier cheaper call ride car parked driveway play copy code website blog study released past month conflict longterm impact autonomous vehicle alternative mobility service one sale website kelley blue book contend impact car sale minimal survey american found percent prefer vehicle report suggesting car ridesharing service largely replace taxis daily rental company separate study aaa found majority american remain sceptical autonomous vehicle read more electric car enough tesla vegan report boston consulting group suggested concern fade time study predicted ridesharing example fivefold growth number people service year clear affect traditional automaker rushing enter nontraditional businesse whatever happen prepared respond global product development director mark reuss recent interview set unit focus alternative ranging electric car autonomous vehicle ridesharing service echoe ford chairman bill ford ensuring freedom mobility require continually today interpret mobility future generation paul eisenstein ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.nbcnews.com/business/autos/automakers-prepping-future-where-fewer-people-buy-cars-n540346","m_Places":["Las Vegas","California","Tesla"],"m_People":["Paul A. Eisenstein","Bill Ford","Ethan Miller","Mark Fields","Mary Barra","Dan Ammann","Mark Reuss"],"m_Companies":["Nbc News","Sync","Ford Motor Co","Mandalay Bay Convention Center","Getty Images","Ford Smart Mobility Llc.","Amazon","General Motors","Lyft","Uber","Consumer Electronics Show","National Highway Traffic Safety Administration","Google","Apple","Aaa","Boston Consulting Group"],"m_BiGrams":["autonomous vehicle","auto industry","read more","ridesharing service"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":451}
