{"m_szDocID":"505887","m_szDocTitle":"Moving Beyond the Grid to the Sun: Ford’s C-MAX Solar Energi Concept Car « Breaking Energy - Energy industry news, analysis, and commentary","m_szYear":"2014","m_szDocSumamry":"Energy industry news, analysis, and commentary Moving Beyond the Grid to the Sun: Ford’s C-MAX Solar Energi Concept Car By Zina Huxley-Reicher on January 07, 2014 at 2:00 PM With electric vehicle sales on the rise, many auto makers are looking for the next advance in the technology. The electric vehicle removes dependence on gasoline but the concept car announced by Ford last week removes the vehicle’s dependence on anything but the sun. The C-MAX Solar Energi concept car is a solar-powered hybrid vehicle that is able to store solar energy using concentrating solar technology. This new car off","m_szDocBody":"energy industry new analysis commentary moving grid sun ford cmax solar energi concept car zina huxleyreicher withelectric vehicle sale rise auto maker advance technology electric vehicle remove dependence gasoline concept car announced ford week remove vehicle dependence sun cmax solar energi concept car solarpowered hybrid vehicle store solar energy concentrating solar technology car offer potential owner greater reduction greenhouse gas emission open interesting possibility place grid fuel access cmax solar energi concept car technology similar csp harvest sun energy charge car battery ford model share mpg cmax energi model draw equivalent fourhour charge daily sun important technology context hybrid electric vehicle technology challenge widespread plugin vehicle market uptake stem lack charging infrastructure concept car independent lack infrastructure robust fueling maintenance framework natural gas hydrogen electricity alternativelyfueled vehicle gain significant market share ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://breakingenergy.com/2014/01/07/moving-beyond-the-grid-to-the-sun-fords-c-max-solar-energi-concept-car/#comments","m_Places":[],"m_People":["Zina Huxley","Reicher"],"m_Companies":["Mpg"],"m_BiGrams":["concept car","cmax solar","solar energi","energi concept"],"m_TriGrams":["cmax solar energi","solar energi concept","energi concept car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3,3],"m_TriCnt":[3,3,3],"m_iDocBodyWordCnt":131}
