{"m_szDocID":"505880","m_szDocTitle":"US Fuel Cell Market Shows Significant Growth « Breaking Energy - Energy industry news, analysis, and commentary","m_szYear":"2014","m_szDocSumamry":"Energy industry news, analysis, and commentary US Fuel Cell Market Shows Significant Growth By Energy Solutions Forum on January 06, 2014 at 3:30 PM DOE reports the U.S. at the forefront of the global fuel cell industry with significant advancements in the fuel cell and hydrogen technologies market. On December 19, 2013, the Department of Energy (DOE) released three reports highlighting strong progress in the U.S. fuel cell and hydrogen technologies market.  The U.S. remains at the forefront of the global fuel cell industry, with U.S. companies accounting for approximately 80 percent of 2012 i","m_szDocBody":"energy industry new analysis commentary fuel cell market show significant growth energy solution forum doe report forefront global fuel cell industry significant advancement fuel cell hydrogen technology market department energy doe released report highlighting strong progress fuel cell hydrogen technology market remain forefront global fuel cell industry company accounting approximately percent investment industry support doe national laboratory research development r&d effort reduced fuel cell cost percent fuel cell durability doubled automotive fuel cell cost reduced track reach goal further expensive platinum fuel cell reduced percent projected transportation fuel cell system cost eere fuel cell technology market report describe market trend highlighting continued growth commercial fuel cell deployment represented largest market fuel cellbased material handling equipment nationwide fuel cell shipment increased unit approximately unit domestic manufacturing increased percent ongoing r&d effort lightduty fuel cell electric vehicle expected commercialised husa publicprivate partnership addresse hydrogen infrastructure challenge facilitate additional transportation option state state fuel cell america report describing state effort foster fuel cell manufacturing deployment recognise california connecticut york ohio south carolina top state underscore role city town san diegos fuel cell installation spartanburg bmw production facility world largest fuel cell material handling fleet doe houston galveston area council operate heavy duty hydrogen fuel cell electric hybrid truck houston port area pathway commercial success technology product supported fuel cell technology office report fuel cell r&d effort year highlight development approximately commercial technology doe expected commercialise technology year patent ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://breakingenergy.com/2014/01/06/us-fuel-cell-market-shows-significant-growth/#respond","m_Places":["The States","America","California","Connecticut","New York, Ohio","South Carolina","San Diego","Spartanburg","Houston","Houston Port"],"m_People":[],"m_Companies":["Department Of Energy","U.s. Companies","Nationwide","Bmw","Pathways"],"m_BiGrams":["fuel cell","technology market","r&d effort"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[21,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":235}
