{"m_szDocID":"508631","m_szDocTitle":"Making Better Batteries With Hydrogen « Breaking Energy - Energy industry news, analysis, and commentary","m_szYear":"2015","m_szDocSumamry":"Energy industry news, analysis, and commentary By Anne M. Stark | U.S. Department of Energy on November 05, 2015 at 5:00 PM   These researchers are part of a team studying the use of hydrogen for longer-lasting batteries. | Photos by Julie Russell, LLNL. Lawrence Livermore Nation al Laboratory scientists have found that lithium ion batteries operate longer and faster when their electrodes are treated with hydrogen. Lithium ion batteries (LIBs) are a class of rechargeable battery types in which lithium ions move from the negative electrode to the positive electrode during discharge and back whe","m_szDocBody":"energy industry new analysis commentary anne stark department energy researcher part team studying hydrogen longerlasting battery photos julie russell llnl lawrence livermore nation laboratory scientist found lithium ion battery operate longer faster electrode treated hydrogen lithium ion battery lib class rechargeable battery type lithium ion move negative electrode positive electrode discharge back charging growing demand energy storage emphasise urgent higherperformance battery key characteristic lithium ion battery performance capacity voltage energy density ultimately determined binding lithium ion electrode material subtle structure chemistry shape electrode significantly affect strongly lithium ion bond experiment calculation livermore team discovered hydrogentreated graphene nanofoam electrode lib show higher capacity faster transport performance improvement weve electrode breakthrough real world application jianchao paper leading lithium ion battery growing popularity electric vehicle aerospace application example lithium ion battery common replacement lead acid battery historically golf cart utility vehicle heavy lead plate acid electrolyte trend lightweight lithium ion battery pack provide voltage leadacid battery requiring modification vehicle drive system commercial application graphene material energy storage device including lithium ion battery supercapacitor hinge critically ability produce material large quantity low cost however chemical synthesis method frequently leave significant amount atomic hydrogen effect electrochemical performance graphene derivative difficult determine livermore scientist that experiment multiscale calculation reveal deliberate lowtemperature treatment defectrich graphene hydrogen improve rate capacity hydrogen interact defect graphene open small gap facilitate easier lithium penetration improve transport additional reversible capacity provided enhanced lithium binding edge hydrogen bind research suggest controlled hydrogen treatment strategy optimising lithium transport reversible storage graphenebased anode material learn research editor note version post originally appeared llnlgov lawrence livermore national laboratory department energy national laboratory ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://breakingenergy.com/2015/11/05/making-better-batteries-with-hydrogen/","m_Places":[],"m_People":["Lawrence Livermore"],"m_Companies":["Subtle Changes","Hinge","Lawrence Livermore National Laboratory","Department Of Energy"],"m_BiGrams":["lithium ion","ion battery"],"m_TriGrams":["lithium ion battery"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,7],"m_TriCnt":[7],"m_iDocBodyWordCnt":266}
