{"m_szDocID":"520423","m_szDocTitle":"Cleantech Trends and Prediction Quotes | The Energy Collective","m_szYear":"2015","m_szDocSumamry":"0 Posted December 22, 2014 As we reach the end of 2014, our thoughts naturally turn to what 2015 might bring. In the cleantech industry, in particular, there exists a lot of questions regarding the future year. For example: Will the recent elections result in new government policies that slow cleantech’s growth? Will the surge we are seeing in the energy storage market continue? What will the EPA’s final Clean Power Plan look like? And will legal challenges keep it from being implemented? Will stable financing mechanisms for energy efficiency projects finally emerge? To gain some perspective o","m_szDocBody":"posted reach end thought naturally turn bring cleantech industry particular exist lot question future year example recent election result government policy slow cleantech growth surge energy storage market continue epas final clean power plan like legal challenge implemented stable financing mechanism energy efficiency project finally emerge gain perspective question perhap importantly learn question asking polled cleantech industry leader expecting coming year response found below ucilia wang contributing writer forbe competition zeroemission vehicle category hydrogen fuelcell car model introduced fuel cell charging infrastructure expanded interesting tesla deal development addition residential solar market continue grow strong rate idea generate power continue catch public lyndsey gilpin staff writer techrepublic year cleantech mainstream dropping panel price convince people solar stay addition drop solar panel price mainstream acceptance cleantech driven tech company increasingly sourcing renewable energy datacenter operation expect vcs back cleantech game big way lot startup emerge seeking tackle existing problem battery storage energy transmission data analytic facing energy sector jame tong vice president strategy clean power finance big utility engagement distributed energy resource der include solar wind energy storage demand response smart thermostat utility reevaluating role market increasingly businesse succeed helping company consumer manage energy consume reevaluation leading utility accommodate encourage development der addition innovation der financing sidenew loan product underwriting service capital type investor dan rosen founder president mosaic continue movement distributed world distributed energy solar rooftop home commercial building electric car energy storage garage distributed financial system enable masse invest solar finally penetration ultimate distribution tool internet enable big data social network spread solar quickly zachary shahan director cleantechnica grid storage big bigger market evolve idea real major player are alsoran solar continue amazing growth solar soft cost continue elsewhere big electric vehicle market dominated early adopter main barrier greater adoption lack customer knowledge experience quickly eroding people increasingly realise evs competitive traditional vehicle term price performance michael kanellos senior vice president eastwick communication finance word interesting innovation racking solar electronic year main activity industry revolve financing vehicle residential commercial solar youre lot variation ppas loan lease solar storage efficiency sunedison kicked bigger revolution people thought year ago jennifer runyon chief editor renewable energy world expect lot transformation change utility sector solar renewable energy technology force utility grapple handledistributed generation clear utility change business model question change integration distributed energy resource grid alla weinstein ceo president principle power continuation current trend solar energy continue mainstream declining installation cost wind continue expand offshore electric car road specifically faced fact climate change real impact live people increasingly realise renewable energy electric vehicle luxury necessity sustainable planet science fact ground make difficult head sand climate change consensus great year solar renewable finance electric vehicle hold cleantech ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/jasonbrown/2174661/year-ahead-2015-trends-cleantech#comments","m_Places":["Tesla"],"m_People":["Ucilia Wang","Forbes","Lyndsey Gilpin","James Tong","Dan Rosen","Zachary Shahan","Michael Kanellos","Eastwick","Jennifer Runyon","Alla Weinstein"],"m_Companies":["Epa","Ups","Clean Power Finance","Ders","Der","Mosaic","Sunedison","Revolution"],"m_BiGrams":["renewable energy","energy storage","distributed energy","electric vehicle"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":442}
