{"m_szDocID":"522155","m_szDocTitle":"The New EPA Fuel Standards: Why MPG No Longer Matters | The Energy Collective","m_szYear":"2015","m_szDocSumamry":"Please login or register to follow this user. The New EPA Fuel Standards: Why MPG No Longer Matters Like it? Keywords: Carbon and De-carbonization , co2 , epa , mpg , transportation By Dave Rochlin - originally posted on care2.com I love the ambitious new automobile efficiency targets set by the EPA this week. This is long overdue. As the EPA pointed out , \"transportation sources accounted for 28 percent of all U.S. greenhouse gas emissions in 2007, and have been the fastest-growing source of U.S. GHG emissions since 1990.\" While the new targets works out to an average of 35.5 MPG by 2016, the","m_szDocBody":"follow user epa fuel standard mpg longer matter keyword carbon decarbonization epa mpg transportation dave rochlin originally posted carecom love ambitious automobile efficiency target set epa week long overdue epa pointed transportation source accounted percent greenhouse gas emission fastestgrowing source ghg emission target work average mpg rule set term gramme mile suspect epas found authority regulate highlight mile gallon matter climate change oil perspective setting aggressive target single important action preserve united state robert lee surrender appomattox balanced trade dependence foreign oil created systematic drain dollar tune billion year negative implication stability economic country additionally massive military expenditure driven protect overseas oil supply see carter doctrine looming spectre peak oil oil closing spigot needed dealing climate change lot gasoline burned good reducing gasoline related emission assuming mile life car mpg burn gallon lifetime resulting tonne emission raising fuel efficiency mpg car gallon gasoline keeping tonne emission atmosphere reduce amount spent gasoline automobile manufacturer estimating cost meet higher target car put consumer ahead game honda crx owner and miss pocket rocket case crx mileage mpg performance pricedand year ago secret small efficient engine lightweight designwhich bring bad lifecycle impact automobile awful lot rubber steel plastic material making car energy power gigantic factory stamping part assembling significant recent estimate producing midsized sedan result roughly tonne emission guessing fullsized suv inch wheel tvs seat cheque lot higher that unfortunately automobile designed obsolescence reuse material recycled modular cradle cradle approach automotive design ecofriendly support system automobile consequence autocentric culture led large emission footprint road building maintenance replacing natural habitat asphalt sprawl lack convenient public transportationall create automobile emission intensive culture car cheaper operate simply demand version autobahn drive often avoiding ugly swapping coal oil biggest battle epa rule treat electric car industry like term zero emission vehicle plugin car require electricity grid estimate put amount energy range mile kwh connected hydroelectricpowered clean grid washington plugin time carbon intensive gas powered vehicle operate car coaldependent north dakota zero emission vehicle emission intensive gasoline offset electricity supporting wind farm north dakota vehicle zero emission hybrid prius generate electricity braking system emission perspective plugin case epa gave automobile manufacturer zero emission car waiver mean mpg closer mpg that know cheer epa thinking oil emission replace gasoline electricity created coal biodiesel corn hydrogen produced refinery focus gramme mile mpg great start thinking footprint actual vehicle consumable tyre oil consumable hybrid crxs plug escaladesor light rail both ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/daverochlin/30287/new-epa-fuel-standards-why-mpg-no-longer-matters","m_Places":["United States","Appomattox","Carter","Washington","North Dakota"],"m_People":["Dave Rochlin","Swapping"],"m_Companies":["Epa","Mpg","Diesel"],"m_BiGrams":["zero emission","tonne emission"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":398}
