{"m_szDocID":"523811","m_szDocTitle":"I want my (fuel cell powered) jet pack! | The Energy Collective","m_szYear":"2015","m_szDocSumamry":"Please login or register to follow this user. I want my (fuel cell powered) jet pack! Like it? 1 Posted August 6, 2010 Every once in a while I stumble across a rude reminder of just how precarious? perverse? stupefyingly weird? the road from laboratory to the mainstream commercial market can be for new technology.  While looking for something in my countless gigs of downloaded reports and scientific papers, I ran across the February, 2002 document, Guidance for Transportation Technologies: Fuel Choice for Fuel Cell Vehicles [PDF] , which has a real stunner of a chart on page 5, showing the pro","m_szDocBody":"follow user fuel cell powered jet pack posted stumble rude reminder precarious perverse stupefyingly weird road laboratory mainstream commercial market technology countless gig downloaded report scientific paper ran february document guidance transportation technology fuel choice fuel cell vehicle pdf real stunner chart showing projected rollout vehicle fuel cell wont fit here youll open window hydrogen fuel cell commercial prototype commercial introduction market penetration methanol gasoline fuel cell basically schedule ouch point beat author report slap fuel cell spectacularly bad idea vehicle posting rude reminder difficulty making projection development commercialization technology weve technology rocket computer hobbyist professional form frontrow seat astonishing history played tiny role software designer programmer instance pretty easy predict success computer chip moore law electric vehicle now evs easy simple reason standing phenomenal growth evs cheaper battery yes issue customer acceptance gasp different hurdle insignificant solve price battery car down token hydrogen fuel cell make dim picture problem present yes fueling infrastructure point out hydrogen production infrastructure create extremely pure hydrogen doesnt create significant emission mean electrolysis which buttload electricity rely ccs which magic fairy dust category drive cost fuel cell dramatically way store highly compressed hydrogen vehicle thought manage begin achieve market penetration jet pack supposed that ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/lougrinzo/41205/i-want-my-fuel-cell-powered-jet-pack#comments","m_Places":[],"m_People":[],"m_Companies":["Seat","Magic"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8],"m_TriCnt":[],"m_iDocBodyWordCnt":200}
