{"m_szDocID":"526345","m_szDocTitle":"Ari Peskoe: As Electric Vehicles Return, Will Federal Support Continue? | The Energy Collective","m_szYear":"2015","m_szDocSumamry":"Please login or register to follow this user. Ari Peskoe: As Electric Vehicles Return, Will Federal Support Continue? Like it? By Ari Peskoe | originally posted at Americans for Energy Leadership The electric car is back.  With an assist from government, Nissan delivered the first models of its new electric vehicle (EV) to customers earlier this month , and thanks to a $100 million Federal program hundreds more will be on the road soon.  Nissan is the first manufacturer out of the gate, but others are expected to offer EVs for sale in the next couple of years.  While governments at the Federal","m_szDocBody":"follow user ari peskoe electric vehicle return federal support continue ari peskoe originally posted american energy leadership electric car back assist government nissan delivered model electric vehicle customer earlier month million federal programme hundred road soon nissan manufacturer gate expected offer evs sale couple year government federal state local level heavily involved rollout evs congress decide evs continue receive government support primary rationale continued government support evs wean addiction oil day burn million gallon gasoline percent oil consumed imported million oil guzzling registered vehicle today optimistic forecast predict decade evs meaningfully contribute reduction oil consumption evs touted mean creating job stimulating struggling car industry end recovery act included billion grant battery component manufacturer advanced technology vehicle manufacturing loan programme passed congress bush administration lent billion support development factory state leveraged federal money successfully michigan revitalise auto industry offering package tax credit combination federal incentive state attracted eighteen company developing advanced battery effort governor predict generate job state local government active developing plan deploy public charger buying evs fleet clearing regulatory obstacle shortening permitting process charger installation funding washington including million programme buy nissan deploy charger select market federal government handing tax credit worth purchaser evs home charger federal funding expiring running out incoming congress important decision make nearterm progress evs recent tax bill signed law president obama extend reduce tax credit charger tax credit vehicle purchaser run set expire sale threshold reached grant manufacturer part recovery act onetime funding boost department energy accepting application loan programme created ultimately federal government future evs pace scale adoption largely influenced price oil rate technological innovation nonetheless areas market overlook opportunity government investment example congress continue fund arpae office originally funded recovery act support highrisk highreward energy r&d funding recently renewed public charging profitable larger volume evs road overlooked private sector additional public charging consumer interested driving evs congress consider continue recent stimulus put evs context widerange recent transportation fuel initiative single solution reducing reliance oil transportation federal government invest advanced biofuel natural gas vehicle hydrogen fuel cell regard traditional combustion engine recently updated fuel efficiency standard lightduty vehicle mandate improvement average mpg include bonus manufacturer sell evs administration announced intention stringent standard vehicle manufactured proposed efficiency standard heavy duty vehicle daily show recently documented president nixon talked reducing country dependence foreign oil import steadily grown tempting conclude government support transition oil irrelevant futile counterproductive important government ignore government military largest consumer oil world investing future transportation fuel simply good idea government bottom line ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/aelstaff/49137/electric-vehicles-return-will-federal-support-continue#comments","m_Places":["Grants","Michigan","Washington"],"m_People":["Ari Peskoe","Obama","Arpa"],"m_Companies":["Advanced Technology","Federal Government","Department Of Energy","Mpg","Us Government"],"m_BiGrams":["tax credit","government support","recovery act","federal government"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":410}
