{"m_szDocID":"526471","m_szDocTitle":"Would GOP Budget Ax Cut Clean Tech? | The Energy Collective","m_szYear":"2011","m_szDocSumamry":"Please login or register to follow this user. Would GOP Budget Ax Cut Clean Tech? Like it? 0 Posted January 6, 2011 Keywords: Green Business , Green Jobs , Energy and Economy , Politics & Legislation , arpa-e , Budget Cuts , clean energy innovation , clean tech , Congress. energy policy Taking House Republicans at face value on their pledge to cut 20% of  all non-defense discretionary spending, we took a quick look at what  cuts might mean for America's ability to compete in the $2 trillion  clean energy market.  While there are certainly areas of the nation's  energy budget that should get cu","m_szDocBody":"follow user gop budget cut clean tech posted keyword green business green job energy economy politic legislation arpae budget cut clean energy innovation clean tech congress energy policy taking house republican face pledge cut nondefense discretionary spending quick cut americas ability compete trillion clean energy market areas nation energy budget cut eliminated achieve billion saving programme fuel economic growth majority suffer smart government investment clean energy businesse ground expanding mean job created dow battery plant michigan nissan electric vehicle tennessee southern company build nuclear reactor georgia chop like billion cut federal loan guarantee programme potentially cripple muchneeded nuclear renaissance time china planning fivefold expansion decade loan guarantee building nuclear power plant year creating job georgia today million arpae meagre million budget gutting funding advanced energy storage generation nuclear power microbattery technology military eliminating million grant company innovating renewable energy advanced vehicle technology battery storage kill emerging clean energy businesse potential century google general electric exxon slicing million r&d investment school purdue university penn state university wisconsin iowa state university developing generation innovator ideas spawn businesse job conservative columnist george ringing alarm bell warned house freshmen making government lean cutting defensible productive federal spending akin making overweight aircraft flightworthy removing engine cutting uss meagre innovation budget troubling vacuum clean energy crowded global marketplace economic competitor china south korea japan increasing clean tech funding fuel growth making tough decision areas slash budget deficit ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/joshfreed/49468/would-gop-budget-ax-cut-clean-tech#comments","m_Places":["America","Michigan","Tennessee","Georgia","Georgia Today","Uk","South Korea","Japan"],"m_People":["Arpa","Dow"],"m_Companies":["House Republicans","Southern Company","Georgia Today","Us Military","Google","General Electric","Exxon","Purdue University","Penn State","University Of Wisconsin","Iowa State University"],"m_BiGrams":["clean energy","budget cut","clean tech"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":231}
