{"m_szDocID":"527566","m_szDocTitle":"California Cuts Zero Emission Vehicles 70-79% | The Energy Collective","m_szYear":"2008","m_szDocSumamry":"Please login or register to follow this user. California Cuts Zero Emission Vehicles 70-79% Like it? 0 Posted March 30, 2008 Late last week, the California Air Resources Board (CARB) held the Zero Emission Vehicle (ZEV) board meeting previewed in Killing the Electric Car Again Part 1 and Part 2 . CARB appears to have put on a partially choreographed show. Agency staff played the role of “ bad cop .” Before the meeting they proposed cutting ZEVs by 90%, setting the scene for the Board appointees to play “ good cop ” and change the cuts to 70%.  This allowed CARB to spin it as a tripling in the ","m_szDocBody":"follow user california cut emission vehicle posted late week california air resource board carb held emission vehicle zev board meeting previewed killing electric car part part carb appear put partially choreographed show agency staff played role bad cop meeting proposed cutting zevs setting scene board appointee play good cop change cut allowed carb spin tripling number press release air resource board today voted triple amount emission vehicle staff proposed automaker produce directing staff overhauling programme account climate change benefit fcvs mile range used cut vehicle zevs board member insisted playing role bumble cop understanding voting board member initially stated thought number increased decreased suddenly forget remark docilely follow lead board member daniel sperling end flashed slide filled table number presumably prepared advance suggested board mile range fcvs year board meeting fifty speaker minute slot explaining board carb retreat year mandate approximately california vehicle sale dozen speaker primarily represented automaker interest requesting peculiar situation issue transition intermediate volume manufacturer status hydrogen internal combustion engine cia director jame woolsey testified carb meeting wastefulness diverting resource hydrogen fuelcell programme plugin car road order reduce dependence oil increase national security secretary state george shultz deputy secretary education peter greer served president ronald reagan wrote gov schwarzenegger imploring electric vehicle market ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/josephromm/28544/california-cuts-zero-emission-vehicles-70-79#comments","m_Places":["California"],"m_People":["Zev","Daniel Sperling","James Woolsey","George Shultz","Peter R. Greer","Ronald Reagan","Schwarzenegger"],"m_Companies":["California Air Resources Board","Carb","Air Resources Board"],"m_BiGrams":["emission vehicle","board member"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":206}
