{"m_szDocID":"527990","m_szDocTitle":"Replacing Gasoline with Solar Power | The Energy Collective","m_szYear":"2008","m_szDocSumamry":"Please login or register to follow this user. Replacing Gasoline with Solar Power Like it? Posted May 12, 2008 Executive Summary If you don't want to run through the calculations, here is the summary. I attempted a thought experiment in which I calculated whether it would be feasible to use solar power to generate enough energy to offset all U.S. gasoline consumption. My conclusion is that it will take about 444,000 megawatts of electrical generating capacity. Current U.S. generating capacity is over 900,000 megawatts, but there isn't a whole lot of spare capacity in that number. To generate 4","m_szDocBody":"follow user replacing gasoline solar power posted executive summary run calculation summary attempted thought experiment calculated feasible solar power generate energy offset gasoline consumption conclusion megawatt electrical generating capacity current generating capacity megawatt lot spare capacity number generate megawatt solar require square mile mile mile square surface area generate power solar thermal including supporting infrastructure require square mile mile mile square large area impossible envision eventually achieving this introduction made attempt calculate number square mile replace current electricity consumption solar solar thermal challenged exercise replacing gasoline usage fact told kind calculation done told idea calculation turn out suspect similar previous calculation replacing electrical consumption guess mile mile note thought experiment idea achieve this first caveat technical obstacle prevent scenario realised are battery range low the plugin prius mile battery power solar power adequately stored however purpose exercise purpose satisfy curiosity replace gasoline solar power land requirement prohibitive calculation gasoline electricity power longhaul truck airplane need consume million gallon gasoline day source eia gallon gasoline btus source epa energy equivalent trillion btus day average efficiency internal combustion engine ice percentage btus moving vehicle road source doe therefore energy moving vehicle trillion btus day efficiency electric infrastructure broken step source respective efficiency transmission line charging vehicle efficiency efficiency after electricity produced replace gasoline btus moving vehicle electricity require trillion btus convert electricity kwh thus trillion equal billion energy need convert power multiply hour million kilowatt megawatt power generation required back solar thought experiment calculated square mile replace peak electrical demand however current calculation sort calculation previously previous calculation attempted installed solar meet peak demand case replacing transportation fuel panel produce required transportation energy hour sun shining conservative assume hour mean time solar previous essay conservative watt square foot generating capacity actual panel area billion square feet square mile area mile mile however surface area required generate electricity include area required supporting infrastructure solar thermal calculation based solar thermal output running solar power expectation megawatt produced acre include land infrastructure number generate million acre square mile square mile mile reality combination solar solar thermal lot rooftop create electricity solar large tract land sunny arizona nevada create electricity solar thermal conclusion clearly lot area required impossibly large achieve this couple big problem resolved first battery life improve people embrace electric transport abc new storey average commute mile oneway range plugin prius expected mile aptera hand claim range mile change drive hand lot commuter climb aptera share road large suvs second bigger issue good store excess solar power good storage mechanism electric car charged night solar electricity produced day idea floated peak solar energy electrolyze water store hydrogen centralised location hydrogen burned night run centralised electrical generator efficient method storing solar energy technically workable finally current electrical grid handle large increase model envision generate consume electricity locally note delayed posting week error calculation finally found turned kilowatt watt error incorrect assumption ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/robertrapier/31782/replacing-gasoline-solar-power#comments","m_Places":["Arizona","Nevada"],"m_People":[],"m_Companies":["Guess","Epa","Abc News"],"m_BiGrams":["square mile","solar power","solar thermal","thought experiment","generating capacity","mile square","trillion btus","moving vehicle","area required"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,6,4,3,3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":476}
