{"m_szDocID":"530043","m_szDocTitle":"Energy crisis?  | The Energy Collective","m_szYear":"2008","m_szDocSumamry":"0 Posted September 10, 2008 In a small, two-windowed, state-issued office near a quaint downtown, a medium sized blogger has spent the past year trying to solve the nation's energy crisis one post at a time ( Cars converted to the future ): In a windowless workshop near the county landfill, a small Raleigh company has spent the past year trying to solve the nation's energy crisis one car at a time. The cluttered Advanced Vehicle Research Center garage, tucked in an office park, can accommodate two Toyota Priuses. Lately, the bay stays full. Demand keeps the cars rolling in for a makeover some ","m_szDocBody":"posted small twowindowed stateissued office quaint downtown medium sized blogger spent past year solve nation energy crisis post time car converted future windowless workshop county landfill small raleigh company spent past year solve nation energy crisis car time cluttered advanced vehicle research centre garage tucked office park accommodate toyota priuse lately bay stay full demand car rolling makeover standard car industry wean gasoline hour mechanic garage outfit prius battery pack emerge hybrid plug wall outlet recharge cell phone result car break onceunimaginable fuel efficiency barrier deliver mile gallon spare battery cost cent charge plugin prius mile range solely electric power making gasoline optional short commute retrofitting priuse fulltime occupation advanced vehicle research centre gas price retreated record high cost tanking changing lifestyle people driving ditching suvs smaller car automaker switching production economy model rushing roll hybrid research accelerating technology longrange electric car hydrogenpowered vehicle advanced vehicle research centre handful company convert prius hybrid plugin hybrid doubling gas mileage auto centre see demand corporate customer fleet car recently converted car private consumer please please please odo comment ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/johnwhitehead/27114/energy-crisis","m_Places":["Raleigh","Toyota","Odo"],"m_People":[],"m_Companies":["Research Center"],"m_BiGrams":["advanced vehicle","vehicle research","research centre"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":176}
