{"m_szDocID":"530846","m_szDocTitle":"Not the only car-of-the-future looking for a handout | The Energy Collective","m_szYear":"2008","m_szDocSumamry":"Please login or register to follow this user. Not the only car-of-the-future looking for a handout Like it? Posted November 11, 2008 Michael Giberson Jeffrey Ball at the WSJ's Environmental Capital blog describes Xcel Energy's first steps in bringing Vehicle-to-grid power into its SmartGridCity effort in Boulder, Colorado: So far, it's pretty small potatoes, involving exactly one car and one plug. But boosters say it has the potential to revolutionize - and revitalize -- our aging power grid. Here's what's happened so far: Xcel Energy, Inc. spent $30,000 to convert a Ford Escape hybrid into a ","m_szDocBody":"follow user carofthefuture handout posted michael giberson jeffrey ball wsjs environmental capital blog describe xcel energy step bringing vehicletogrid power smartgridcity effort boulder colorado far pretty small potatoe involving car plug booster potential revolutionise revitalise ageing power grid happened far xcel energy inc spent convert ford escape hybrid plugin electric car utility gave suv chancellor university colorado residence test xcel smartgridcity project twoyear experiment modernising power grid chancellor vehicle draw power part solar panel roof exciting part car send stored power battery back grid small windturbine inverter xcel engineer grafted suv commercial test vehicletogrid technology month xcel add toyota priuse boulder county government fleet experiment core opportunity chasing xcel average hybrid driver pull garage night battery twothird full mean kilowatt hour stored energy power home hour xcel engineer draw power peak usage sticky summer day reverse grid send power back car lowdemand hour middle night battery fully juiced driver morning commute next xcel funding far xcel funded project own federal government goal adding car test year utility line carofthefuture handout actually mind funding basic research carsofthefuture hand funding carmakersstuckinthepast deal ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/michaelgiberson/31948/not-only-car-future-looking-handout","m_Places":["Boulder, Colorado","Toyota","Boulder County"],"m_People":["Michael Giberson","Jeffrey"],"m_Companies":["Ball","Xcel Energy","Xcel Energy, Inc.","University Of Colorado"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":180}
