{"m_szDocID":"531323","m_szDocTitle":"Tom Friedman and Don Boudreaux: arguments against the auto bailout | The Energy Collective","m_szYear":"2008","m_szDocSumamry":"Please login or register to follow this user. Tom Friedman and Don Boudreaux: arguments against the auto bailout Like it? 6 Posted December 11, 2008 Editor's Note: This post is actually from Mike's colleague, Lynne Kiesling, but mistakenly posted under Mike's name. But since there are already a number of comments here, we're going to leave it be--great post Lynne! Tom Friedman and Don Boudreaux are making different, but complementary, arguments against the auto bailout. If you think that you recognize Tom Friedman's argument in his most recent NYT column , you should: he is analyzing Better Pl","m_szDocBody":"follow user tom friedman don boudreaux argument auto bailout posted editor note post mike colleague lynne kiesling mistakenly posted mike name number comment here leave begreat post lynne tom friedman don boudreaux making different complementary argument auto bailout recognise tom friedman argument recent nyt column should analysing place business model post important point friedman column exciting place building car company industrial platform century exact steve job overturn music business apple understand first one today technology platform computer record music two internet player transfer music digital form else cds record company anymore apple simply innovation integrated single musicgenerating purchasing listening system completely disrupted music business agassi founder place generate mobility music platform take kind auto battery ipod storey kind national plugin network itune store make business model work electric car cent mile average american paying today cent mile gasoline transportation add global warming strengthen petrodictator expect innovation detroit remember ford modelt mileage mile gallon ford chrysler model made surprised else done done miss chance win race car mindlessly bailing car blame detroit shareholder taxpayer love this advantage knowledge problem sure friedman larger audience piling message point across similarly don boudreaux commentary today wall street auto company bankruptcy catastrophic idea big three member congress believe bankruptcy make asset factory machine contractual option buy raw material worker skill disappear market exist product produced firm chapter discover this worker lose job supplier lose market industrywide collapse sort portrayed bailout cheerleader government bailout big huge amount productive input firm efficiently forcing taxpayer subsidise continued employment gargantuan quantity raw material labour capital good unproductive pursuit recipe economic stagnation popular politically convenient myth matter backward bigger unprofitable firm vital allowed fail note similarity conclusion friedman boudreaux argument artificial perpetuation obsolete unprofitable business model stifle development better innovative resource geoffrey style say sympathetic argument naive nearterm result consumer unlikelyto suddenly embrace highmpg hybrid million gas remain big pickup truck willsimply buy toyota tundra mpg ford mpg hankering big suv choose nissan armada toyota sequoia dodge durango disappear obvious switching people acyl chevy malibu cyl honda accord environment detroit problem fuel economy making detroit vanishif outcomewont suddenly add mpg average newcar fleet changing priority mindset million people buying detroit car post comment ","m_szGeo1":"","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.theenergycollective.com/michaelgiberson/30520/tom-friedman-and-don-boudreaux-arguments-against-auto-bailout","m_Places":["Detroit","Malibu"],"m_People":["Tom Friedman","Don Boudreaux","Mike","Lynne Kiesling","Lynne","He","Steve Jobs","Agassi","Chrysler","Boudreaux","Geoffrey Styles"],"m_Companies":["Nyt","Apple","G.m.","Wall Street Journal"],"m_BiGrams":["tom friedman","don boudreaux","business model"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":363}
