{"m_szDocID":"548854","m_szDocTitle":"Tesla unveils its $35,000 Model 3 for the masses","m_szYear":"2016","m_szDocSumamry":"Tesla unveils its $35,000 Model 3 for the masses 3,200 shares At an event in Los Angeles, Tesla today unveiled its latest electric car, the Model 3 . The $35,000 vehicle is designed to seat five adults comfortably and can travel 215 miles on a single charge. It goes from 0-60mph in six seconds. Our best speaker lineup, ever. This year’s edition of TNW Conference in Amsterdam includes some          of the biggest names in tech. Learn more CEO Elon Musk presented the car on stage and announced that the company’s Autopilot 3 self-driving feature as well as support for its  Superchargers  (which d","m_szDocBody":"tesla unveil model masse share event los angele tesla today unveiled latest electric car model vehicle designed seat adult comfortablyand travel mile singlecharge frommph sixsecond speaker lineup ever year edition tnw conference amsterdam include biggest name tech learn ceo elon musk presented car stage announced company autopilot selfdriving feature support supercharger which deliver power mile minute standard comparison model sedan range mile full charge mile highspeed ludicrous mode model mile small compared model teslas latest car feature plenty storage front rear accommodate sevenfoot long surfboard cabin model front rear trunk storage fit foot surfboard cabin week ago company allowed owner model sedan model suv skip queue book vehicle meanwhile andreas stephen waited hour dealership sydney prebook model putting deposit musk noted tesla received preorder car model begin rolling end arrive market including australia order limited maximum person adding country model order tonight cheque detail include india brazil sing ireland elon musk musk tweeted teslas entire range country brazil india ireland zealand south africa south korea andsingapore tesla model launches end year company total supercharger worldwide number run time sale service location end north america europe asia pacific present watch full reveal car livestream recap below that tesla poised electric vehicle mainstream model price point model model cost accessible line car buyer expect pay appointed gasoline vehicle today plus tesla keen expanding country including challenging pricesensitive india itll interesting musk usher era motoring globe year tesla reveal model soon musk tweet indicate tuning model unveil part part super level ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://thenextweb.com/gadgets/2016/04/01/tesla-unveils-35000-model-3-masses/","m_Places":["Tesla","Los Angeles","Amsterdam","Sydney","United States","Australia","India","Brazil","Nz","Ireland","New Zealand","South Africa","South Korea","Singapore","North America","Europe"],"m_People":["Elon Musk","Andreas Stephens"],"m_Companies":["Tesla Today","Asia Pacific","Musk And Co."],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":248}
