{"m_szDocID":"553281","m_szDocTitle":"'Bright' vlogger Tests Model X Door Closing Sensors with His Hand | CleanTechnica","m_szYear":"2016","m_szDocSumamry":"March 29th, 2016 by Kyle Field   While the vehicles we drive and the tools we use continue to get smarter and smarter, proof that humans don’t always follow suit abounds. The latest example of this is, ironically, tied in with arguably the most technologically advanced vehicle on the planet — the Tesla Model X and it’s beautiful falcon-wing doors. The doors are equipped with a full suite of sensors that, when combined with the ability to pivot on two unique axes, allow them to open in even the tightest of spaces. When open , the doors allow most normal-sized adults to step into the rear of the","m_szDocBody":"kyle field vehicle drive tool continue smarter smarter proof human dont follow suit abound latest ironically tied arguably technologically advanced vehicle planet tesla model beautiful falconwing door door areequipped full suite sensor that combined theability pivot unique axe open tightest space open door normalsized adult step rear car duck appreciated enjoyed interesting exercise human body manipulation required enter rear seat suvs blend case close human hand squash bug question burning mind adventurous folk bright channel call question accuracy channel tesla showroom film update decided put rear door test personally opted attached body hey cheque video below recently shared tesla motor subreddit cleantechnicas completely free electric car report electric car early adopter follower want attend cleantechnicas cleantech revolution tour event berlin germany date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/03/29/bright-vlogger-tests-model-x-door-closing-sensors-hand/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IM-cleantechnica+%28CleanTechnica%29","m_Places":["Tesla","Berlin, Germany"],"m_People":[],"m_Companies":["Youtube","Tesla Motors"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":143}
