{"m_szDocID":"557307","m_szDocTitle":"Unplugged Performance CEO Ben Schaffer (Video Interview)","m_szYear":"2016","m_szDocSumamry":"April 13th, 2016 by Zachary Shahan   It was great fun touring Unplugged Performance on my trip to Los Angeles for the Tesla Model 3 unveiling. Whether you are familiar with Unplugged Performance or not, the videos below should be quite interesting to you. CleanTechnica & EV Obsession  got to interview Ben Schaffer, the CEO and founder of Unplugged Performance , regarding what they do, where their inspiration originates, the company makeup, the Tesla Model 3 & Model X & Model S , and more. We also chatted about the underlying fundamentals of how to make a car faster — make it more powerful or l","m_szDocBody":"zachary shahan great fun touring unplugged performance trip los angele tesla model unveiling whetheryou familiar withunplugged performance not videos interesting you cleantechnica obsession interview ben schaffer ceo founder unplugged performance dowhere inspiration originate company makeup tesla model model model more chatted underlying fundamental make car faster make powerful lighter led bit chat bmw bmw compare suv tesla etc video cheque unplugged performance superlight part created genuine carbon fibre unplugged performance produce house videos enjoy bunch beautiful photos kyle field huge ben taking time busy day chat host evening something express for nicolas zart video work kyle field great pic tag ben schaffer bmw bmw bmw california hawthorne tesla tesla aftermarket tesla model tesla model tesla model unplugged performance zachary shahan tryin and specy letter time spend time cleantechnica director chief editor otherwise enthusiastically fulfilling duty obsession gas solar love planetsave bikocity president important media zach recognised globally solar energy electric car energy storage wind energy expert speak related conference event connect social media zacharyshahancom related post ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/04/13/interviewing-unplugged-performance-founder-ben-schaffer-exclusive-video/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IM-cleantechnica+%28CleanTechnica%29","m_Places":["Los Angeles","Tesla","California"],"m_People":["Zachary Shahan","Ben Schaffer"],"m_Companies":["Bmw","I3"],"m_BiGrams":["unplugged performance","tesla model"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,5],"m_TriCnt":[],"m_iDocBodyWordCnt":166}
