{"m_szDocID":"558793","m_szDocTitle":"Why Is China Still Building New Coal Plants?","m_szYear":"2016","m_szDocSumamry":"Why Is China Still Building New Coal Plants? April 18th, 2016 by Guest Contributor   By Jeremy Deaton There have been mixed messages coming from China lately. The country’s carbon emissions may be  declining  more than a decade earlier than anticipated, thanks in part to reductions in coal power. And yet, China is planning  210 new coal-fired power plants  despite existing overcapacity. Why? “In short, Chinese provinces are promoting construction of unneeded coal plants for precisely the same reason they are promoting every other kind of construction as well,” said Lauri Myllyvirta, Senior Glo","m_szDocBody":"china building coal plant guest contributor jeremy deaton mixed message coming china lately country carbon emission declining decade earlier anticipated part reduction coal power yet china planning coalfired power plant existing overcapacitywhy short chinese province promoting construction unneeded coal plant precisely reason promoting kind construction well lauri myllyvirta senior global campaigner greenpeace boost economic activity short term regard longerterm profitability debt problem generally oversight due diligence obtaining finance project this china ramping capacity wind solar rapidly displacing coal myllyvirta existing coal plant operating percent capacity consequence mining sector facing oversupply cheap coal beijing aim close mine year national government draw coal production response coalproducing province build power plant province struggling coal mining industry locating coal plant province shift coal demand province grab larger slice shrinking pie mylyvirta course slice electricity producer deployed similar strategyexplained mylyvirta power plant roughly amount operating hour building grow market share revenue expense other far gain building coalfired power plant outweigh cost low coal price lowtonointerest credit tariff regulated level ensure profitability incentive build make sense economy whole mylyvirta weve called problem perverse incentive beijing problem cheque chinas national energy administration ordered provincial government stop approving coalfired power plant ordered province halt construction coalfired power plant approved provincial level power plant offer bulwark unemployment civil unrest china expected lay million coal steel worker roughly percent workforce pursuit economic plan government set billion aid region hit hardest unemployment remain unclear sector absorb worker jettisoned coal steel mylyvirta bad new key reason china developing overcapacity coal mining coal power rapid successful deployment clean energy making coal plant redundant explained provincial government vying job threatened growth wind solar shift renewable power promise job breathable air vibrant clean energy sector move challenge chinas transition clean energy economy prove instructive nation aiming move fossil fuel jeremy deaton write science policy politic climate energy nexus media follow cleantechnicas completely free electric car report electric car early adopter follower want attend cleantechnicas cleantech revolution tour event berlin germany date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/04/18/why-is-china-still-building-new-coal-plants/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IM-cleantechnica+%28CleanTechnica%29","m_Places":["China Still Building","China","Beijing","Berlin, Germany"],"m_People":["Jeremy Deaton","Said Lauri"],"m_Companies":["Greenpeace","Ramping","Slice","Energy Administration","Nexus"],"m_BiGrams":["power plant","coal plant","coalfired power","clean energy"],"m_TriGrams":["coalfired power plant"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,5,4,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":347}
