{"m_szDocID":"569569","m_szDocTitle":"$8.5 Million Raised By Viridity Energy | CleanTechnica","m_szYear":"2016","m_szDocSumamry":"$8.5 Million Raised By Viridity Energy May 20th, 2016 by Jake Richardson   Battery storage solutions provider Viridity Energy has raised $8.5 million from AltEnergy LLC. Viridity makes demand response and management software to optimize energy revenue and cost reductions, in combination with battery storage solutions. AltEnergy is an investment firm that focuses on demand response, renewables, energy storage, high-voltage transmission, demand management, and cyber security. It invests in early stage and high-growth opportunities. “AltEnergy’s commitment to Viridity Energy with this latest inve","m_szDocBody":"million raised viridity energy jake richardson battery storage solution provider viridity energy raised millionfrom altenergy llc viridity make demand response managementsoftware optimise energy revenue cost reduction combination battery storage solution altenergy investment firm focuse demand responserenewable energy storage highvoltage transmission demandmanagement cyber security invest early stage highgrowth opportunity altenergy commitment viridity energy latest investment continue rapid growth weve experienced year capital expand resource software technology service demand response battery storage customerswe large commercial industrial enduser leveraging software lower spend energy battery storage solution rapid area growth explained ceo viridity energymack treece viridity selected operate solar power energy storage facility ohio capacity provide energy market service system related rail pennsylvania altenergy original investment viridity company evolved industry leader innovative software technology maximise flexible energy load investment fuel continued rapid growth company extend leadership position energy storage advanced demand responsesaid russell stidolphaltenergy managing director viriditysheadquarter pennsylvania founded altenergy llc founded office connecticut york cleantechnicas completely free electric car report electric car early adopter follower want date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter tag altenergy viridity jake richardson hello writing online time enjoy outdoor like follow related post ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/05/20/8-5-million-raised-viridity-energy/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IM-cleantechnica+%28CleanTechnica%29","m_Places":["Ohio","Pennsylvania","Connecticut","New York"],"m_People":["Jake Richardson","Mack Treece","Russell Stidolph"],"m_Companies":["Altenergy Llc.","Google"],"m_BiGrams":["battery storage","viridity energy","storage solution","energy storage"],"m_TriGrams":["battery storage solution"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":200}
