{"m_szDocID":"588716","m_szDocTitle":"New Audi Q2 and Q5 confirmed for 2016, EV for 2018","m_szYear":"2016","m_szDocSumamry":"New Audi Q2 and Q5 confirmed for 2016, EV for 2018 Pin Part of a 3-billion-euro investment strategy for 2016, Audi plans to introduce a new Q5 and also to bring a smaller Q2 to its SUVs line-up. The Ingolstadt-based company wants to extend its sport utility vehicles range in 2016 by adding a small Q2 and also by launching a new Q5. This announcement comes as part of Audi’s investment plan for next year, the intended capital expenditure being more than 3 billion euros. It has been a while since the premium automaker has brought something new to its Q range. Therefore, Audi will venture into a n","m_szDocBody":"audi confirmed pin part billioneuro investment strategy audi plan introduce bring smaller suvs lineup ingolstadtbased company extend sport utility vehicle range adding small launching announcement part audis investment plan year intended capital expenditure billion euros premium automaker brought range therefore audi venture market segment model car rival bmw countryman however successor arrival obvious step current model launched back received facelift ring brand promising launch large sery battery electric vehicle based etron quattro concept audi expand model range include automobile significant proportion investment naturally field alternative drive system stated audi ceo rupert stadler luxury automaker confirmed etron sport utility vehicle hit production line set allelectric range mile term alternative technology audi admitted ready bring light hydrogen car promise reshape green car industry arrived mysterious fcv built previous hydrogenpowered concept current sportback htron quattro electric drive fuel cell energy source combination hybrid battery additional electric motor rear ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.inautonews.com/new-audi-q2-and-q5-confirmed-for-2016-ev-for-2018","m_Places":["Ingolstadt"],"m_People":["Audi","Rupert Stadler"],"m_Companies":["Alternative Technologies"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":145}
