{"m_szDocID":"589149","m_szDocTitle":"Hydrogen fuel cell-powered Audi A7 hits the road this August | Digital Trends","m_szYear":"2016","m_szDocSumamry":"inbox for free! Audi is covering all of the bases when it comes to alternative fuels. In addition to the A3 e-tron plug-in hybrid and A3 g-tron natural gas production cars, not to mention the stillborn R8 e-tron electric supercar , The Ingolstadt gang is reportedly working on a hydrogen-powered version of the A7 as well. According to Autocar , the prototype A7 will be powered by hydrogen fuel cells, as opposed to using straight hydrogen to power an internal combustion engine as Aston Martin did with its recent Hybrid Hydrogen Rapide S. With fuel cells generating electricity from the reaction o","m_szDocBody":"inbox free audi covering base alternative fuel addition etron plugin hybrid gtron natural gas production car mention stillborn etron electric supercar ingolstadt gang reportedly working hydrogenpowered version well autocar prototype powered hydrogen fuel cell opposed straight hydrogen power internal combustion engine aston martin recent hybrid hydrogen rapide fuel cell generating electricity reaction oxygen ambient air essentially electric car tech made road prototype limitedproduction car honda fcx clarity abundant element universe leaving emission water run fuel cell hydrogen ultimate alternative fuel however lack refuelling infrastructure costly dirty refining process limited far make lack convenient hydrogen filling station onboard battery regenerative braking extend range remain prototype remember audi built etron electric supercar technically possible shelved didnt make sense production car begin trial august serve similar purpose test capability fuel cell giving audi green tech option future sleek fivedoor also said damn good top storey delivered inbox ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.digitaltrends.com/cars/hydrogen-fuel-cell-powered-audi-a7-hits-the-road-this-august/","m_Places":["Ingolstadt"],"m_People":["Audi","Fcx Clarity"],"m_Companies":["Autocar","Aston Martin","Honda"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":144}
