{"m_szDocID":"589195","m_szDocTitle":"Honda's fast-fill hydrogen station replenishes fuel cell cars in just 3 minutes","m_szYear":"2014","m_szDocSumamry":"Honda’s fast-fill hydrogen station replenishes fuel cell cars in just 3 minutes March 7, 2014 | In: Charging & Refueling Leave a Comment The wheels of Honda’s attempt to make hydrogen a viable fuel for personal transport are turning ever-quicker with the unveiling of a new state-of-the-art refuelling station. Although operational the station – capable of storing hydrogen at a pressure of 10,000 psi – is more of a prototype for investigating refuelling procedure. It can refuel a hydrogen fuel cell car in less than three minutes, which is around 45 percent faster than a standard station. “In ord","m_szDocBody":"hondas fastfill hydrogen station replenishes fuel cell car minute charging refuelling leave comment wheel hondas attempt make hydrogen viable fuel personal transport turning everquicker unveiling stateoftheart refuelling station operational station capable storing hydrogen pressure psi prototype investigating refuelling procedure refuel hydrogen fuel cell car minute percent faster standard station order meet customer expectation hydrogen fuel cellpowered vehicle driving range fueling time comparable conventional gasoline vehicle steve mathison senior engineer honda r&d americas inc fueling protocol fcev customer realise short fueling time wide range temperature key quick fueling time station ability precisely control temperature hydrogen supplied importantly fill absorb heat generated refuelling keeping delivery safe fast honda revealed latest vision hydrogen fuel cell car fcev concept year auto show remarkably similar chief rival toyota concept touted power output driving range mile single tank compressed hydrogen hondas fcev company plan market production version car widely believed breakthrough year hydrogen electric vehicle charging station proliferating forgetting home north america potential charging station real challenge hydrogen fuel cell technology face infrastructure public refuelling station hydrogenpowered car refuel predicted cost reduction national renewable energy laboratory estimate early commercial station cost million instal comparison tesla began installing supercharger station capable supplying electric model min range min cost company time widespread hydrgoen refuelling infrastructure develop however debate fuel cell car popular quickly performance characteristic closely matches conventional car albeit harmful emission share ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://ecomento.com/2014/03/07/hondas-fast-fill-hydrogen-station-replenishes-fuel-cell-cars-just-3-minutes/","m_Places":["Americas, Inc.","Toyota","North America","Tesla"],"m_People":["Honda","Honda R","Will Honda"],"m_Companies":["Americas, Inc.","National Renewable Energy Laboratory"],"m_BiGrams":["fuel cell","cell car","hydrogen fuel","fueling time"],"m_TriGrams":["fuel cell car","hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,4,3],"m_TriCnt":[4,3],"m_iDocBodyWordCnt":225}
