{"m_szDocID":"589181","m_szDocTitle":"Forze VI Breaks Nurburgring Fuel Cell Record | Pictures, Specs | Digital Trends","m_szYear":"2008","m_szDocSumamry":"Delivered to your inbox for free! Hydrogen fuel cell cars aren’t typically known for their speed, but that doesn’t mean they have to be boring. Students at the Delft University of Technology in the Netherlands have been tuning hydrogen powertrains for performance for almost a decade, starting with the debut of the Forze I electric vehicle in 2008. Since then, Team Delft has developed several prototypes, many of which have competed in the Formula Zero hydrogen fuel cell racing series. Formula Zero unfortunately ran out of steam years ago, but the Delft team is still going strong. Its latest cre","m_szDocBody":"delivered inbox free hydrogen fuel cell car arent typically speed doesnt boring student delft university technology netherland tuning hydrogen powertrain performance decade starting debut forze electric vehicle then team delft developed prototype competed formula hydrogen fuel cell racing sery formula ran steam year ago delft team strong latest creation forze sleek shapely racecar make peak horsepower sprint mph second showcase potential hydrogen forze recently made trip germany jaunt famed nurburging pound car running half power traversed minute clear fast time normal standard german racing driver occasional top gear guest sabine schmitz managed lap horsepower ford transit van official record either wasnt professionally timed due public track day car course related toyota prius plugin hybrid set kind nurburgring lap record still forze fastest hydrogenpowered vehicle lap ring great increase public interest room improvementwith full power left impression formula driver lammer happened piloting forze track day aweinspiring student designed built race car handle well highly advanced technology contain said tip hat them top storey delivered inbox ","m_szGeo1":"Netherlands","m_szSourceType":"source_news","m_szSrcUrl":"http://www.digitaltrends.com/cars/forze-vi-breaks-nurburgring-hydrogen-record-pictures-specs/","m_Places":["Vi","Germany"],"m_People":["Top Gear","Sabine Schmitz","Jan Lammers"],"m_Companies":["Delft University Of Technology","Sprint"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":164}
