{"m_szDocID":"589223","m_szDocTitle":"Hydrogen fuel cell powered VW Golf SportWagen HyMotion unveiled with 310-mile range - Pocket-lint","m_szYear":"2016","m_szDocSumamry":"Hydrogen fuel cell powered VW Golf SportWagen HyMotion unveiled with 310-mile range Comment Volkswagen has unveiled an innovative new car, the Golf SportWagen HyMotion that uses hydrogen fuel cells, making it eco-friendly but super high tech. Hydrogen powered cars only produce water as a byproduct making them environmentally friendly. They can also be filled up quickly like current cars giving them that advantage over pure electric cars that require charging. The HyMotion is currently a \"progressive research vehicle\" meaning it's not aimed at the road just yet but is helping VW to perfect its ","m_szDocBody":"hydrogen fuel cell powered golf sportwagen hymotion unveiled mile range comment volkswagen unveiled innovative car golf sportwagen hymotion hydrogen fuel cell making ecofriendly super tech hydrogen powered car produce water byproduct making environmentally friendly filled quickly current car giving advantage pure electric car require charging hymotion progressive research vehicle meaning aimed road helping perfect fuel cell tech front wheel drive car achieve mph acceleration second manage mile full tank hydrogen refilling tank concept car take minute golf hydrogen fuel cell powered car feature lithiumion battery store energy regenerative breaking assist starting phase fuel cell booster acceleration volkswagen start release fuel cell car current model golf feature perfected system wait happen due developmental hurdle infrastructure fuel cell station recharge needed plant manufacture fuel ecofriendly defeat object hydrogen powered car ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.pocket-lint.com/news/131804-hydrogen-fuel-cell-powered-vw-golf-sportwagen-hymotion-unveiled-with-310-mile-range","m_Places":[],"m_People":[],"m_Companies":["Volkswagen","Progressive"],"m_BiGrams":["fuel cell","hydrogen fuel","powered car"],"m_TriGrams":["hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":128}
