{"m_szDocID":"589214","m_szDocTitle":"California pushes hydrogen cars with 2X the rebate of EVs - Torque News","m_szYear":"2015","m_szDocSumamry":"By John Goreham G+ 2015-04-30 14:49 California pushes hydrogen cars with 2X the rebate of EVs Why does California offer twice the rebates on hydrogen fuel cell cars that it does for EVs?  And where is the Toyota we keep hearing about? Subscribe to TorqueNewsVideo on Youtube Become a TorqueNews Paid Contributor, Contact Us for Details We’ve been following the hydrogen car scene now for a few years.  At first all the news was about the Honda FCX Clarity.  Folks in the green car movement found it cute and interesting in a funny sort of way.  Nobody’s laughing anymore since Toyota threw its hat in","m_szDocBody":"john goreham california pushes hydrogen car rebate evs california offer rebate hydrogen fuel cell car evs toyota hearing about torquenewsvideo torquenew paid contributor contact detail weve hydrogen car scene year new honda fcx clarity folk green car movement found cute interesting funny sort way nobody laughing anymore toyota threw hat ring fourth automaker producing hydrogen fuel cell electric vehicle hfc battery electric vehicle bev evangelist sort insulted plan government backing rapidly typing angrygram post blog delicious irony team mandated evs gave future fuel cell vehicle better folk california marketbygovernmentmandate plan hydrogen powered evs bevs website taxpayer dollar choose buy evs california show preference hfc evs offering instant rebate buy honda mercede hyundai hydrogen fuel cell powered car favoured top earner bmw tesla model price car affordable evs bestselling leaf qualify rebate list sortof evs volt plugin prius california punish car run electron favour car prefer element electron carb california cleanair group put speed fuel local emission vehicle important range vehicle travel refuelling turn out hfc evs simply spank bevs important areas carb reward them answer question teaser above toyotas mirai expected join party year doe company sell green car california automaker begin support carb mandate vengeance toyota planning put financial hydrogen fuel cell push market world profitable automaker guessing bit time tell part greencar discussion chance greencar expert automaker expert world converging massachusett institute technology add voice ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.torquenews.com/1083/california-pushes-hydrogen-cars-2x-rebate-evs","m_Places":["California","Toyota"],"m_People":["John Goreham","Fcx Clarity","Honda, Mercedes","Carb"],"m_Companies":["Youtube","Honda","Hyundai","Bmw","I3","Volt","Massachusetts Institute Of Technology"],"m_BiGrams":["fuel cell","hydrogen fuel"],"m_TriGrams":["hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":227}
