{"m_szDocID":"589226","m_szDocTitle":"Toyota Mirai becomes first hydrogen-fuelled electric car eligible for the plug-in car grant","m_szYear":"2015","m_szDocSumamry":"Toyota Mirai becomes first hydrogen-fuelled electric car eligible for the plug-in car grant Was this article useful? 1 person found this useful The new Toyota Mirai hydrogen fuel cell saloon is eligible for the plug-in car grant in recognition of its zero emissions performance. The Office for Low Emission Vehicles (OLEV) has added Mirai to the list of cars and vans that qualify for a £5,000 reduction on the car’s purchase price. It’s the first hydrogen-fuelled model to be featured in the approved list, alongside electric and plug-in vehicles – among them the Toyota Prius Plug-in hybrid. The av","m_szDocBody":"toyota mirai hydrogenfuelled electric car eligible plugin car grant useful person found toyota mirai hydrogen fuel cell saloon eligible plugin car grant recognition emission performance office low emission vehicle olev added mirai list car van qualify reduction car purchase price hydrogenfuelled model featured approved list alongside electric plugin vehicle toyota prius plugin hybrid availability grant mean customer choosing purchase mirai outright price tag reduced transport minister andrew jone said hydrogenfuelled electric car eligible plugin car grant milestone industry develop low emission technology pace government stand way investing million electric vehicle year position world leader forward exciting car road adding wide choice green vehicle british driver paul van der burgh president managing director toyota said mirai fuel cell technology taking important step helping create future low emission hydrogen society toyota selected european market mirai support government agency businesse promote development national hydrogen infrastructure decision support mirai olev grant system create financial incentive customer stand independent acknowledgement mirais status genuine lowemission vehicle reflect clean performance driven potential hydrogen produced sustainably lowcarbon renewable source mirai monthly cost fouryear period package include vehicle hydrogen fuel routine servicing cost dedicated concierge service deal customer requirement including organisation servicing maintenance read review clicking ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fleetnews.co.uk/news/manufacturer-news/2015/11/19/toyota-mirai-becomes-first-hydrogen-fuelled-electric-car-eligible-for-the-plug-in-car-grant","m_Places":["Toyota","Uk"],"m_People":["Andrew Jones","Paul Van"],"m_Companies":[],"m_BiGrams":["eligible plugin","plugin car","car grant","low emission"],"m_TriGrams":["eligible plugin car","plugin car grant"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":197}
