{"m_szDocID":"589291","m_szDocTitle":"Don't buy the fuel-cell hype -- electric cars hold the most promise - LA Times","m_szYear":"2014","m_szDocSumamry":"Don't buy the fuel-cell hype -- electric cars hold the most promise Automakers look to hydrogen fuel cell technology Christina House / For The Times Hyundai started leasing a hydrogen fuel cell version of its Tucson SUV, above, this year. To the right is a fuel cell stack on display at the 2013 L.A. Auto Show. Hyundai started leasing a hydrogen fuel cell version of its Tucson SUV, above, this year. To the right is a fuel cell stack on display at the 2013 L.A. Auto Show. (Christina House / For The Times) To the editor: I have been driving electric cars for 24 years, and contrary to what a Toyot","m_szDocBody":"buy fuelcell hype electric car hold promise automaker hydrogen fuel cell technology christina house time hyundai started leasing hydrogen fuel cell version tucson suv above year fuel cell stack display auto show hyundai started leasing hydrogen fuel cell version tucson suv above year fuel cell stack display auto show christina house time editor driving electric car year contrary toyota motor corp official said knocking company door one carmaker prepare shift hydrogen fuel cell oct knocking anyone door hydrogen vehicle build hydrogen fuel station million pop million energy station electric vehicle electric outlet house building answer big oil consumer control energy source also take electricity make hydrogen fuel efficient simply putting power directly batterypowered electric car state sale battery electric plugin hybrid vehicle year demand alexandra paul pacific palisade editor disparage fuel cell car consideration missing reader aware hydrogen fuel pump dig ground grow tree manufactured ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.latimes.com/opinion/readersreact/la-le-1029-wednesday-hydrogen-fuel-cell-cars-20141029-story.html","m_Places":["Tucson","L.a.","Palisades"],"m_People":["Christina House","Alexandra Paul"],"m_Companies":["Hyundai","Toyota Motor Corp"],"m_BiGrams":["hydrogen fuel","fuel cell","electric car"],"m_TriGrams":["hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,7,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":145}
