{"m_szDocID":"589296","m_szDocTitle":"Mercedes hydrogen fuel cell car due 2017 - SlashGear","m_szYear":"2016","m_szDocSumamry":"Mercedes hydrogen fuel cell car due 2017 Reddit Mercedes-Benz is readying \"the next level\" of hydrogen fuel cell cars, aiming to get a production model on the road by 2017 in the form of what's believed to be a new SUV. Although the complexities of sustaining a hydrogen-fuel car is way more than an electric one, hopefully the pact signed by parent company Daimler, Ford and Nissan will make it more affordable. Mercedes-Benz is an old player in the field of fuel-cell vehicles and has showcased several concepts, including the F-Cell prototype. To ignite things for 2017, the automakers have disclo","m_szDocBody":"mercede hydrogen fuel cell car due reddit mercedesbenz readying the level hydrogen fuel cell car aiming production model road form believed suv complexity sustaining hydrogenfuel car electric one pact signed parent company daimler ford nissan make affordable mercedesbenz player field fuelcell vehicle showcased concept including fcell prototype ignite automaker disclosed bringing generation fuelcell vehicle soon motoring report german company thought release production model based existing test vehicle mercede eventually dropped plan launch viability issue arose environment conducive hydrogenfuel car integrated dedicated fuelfilling station mushroomed batterypowered electric vehicle easier hit road earlier mentioned before agreement daimler ford nissan sharing technology development cost make onroad price hydrogenfuel car approachable expected bclass fcell developed mercede modelled firstgeneration mercede bclass range mile good range urban city car model offer ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.slashgear.com/mercedes-hydrogen-fuel-cell-car-due-2017-16320863/","m_Places":[],"m_People":["Mercedes","Mercedes B-class"],"m_Companies":["Reddit","Mercedes-benz"],"m_BiGrams":["hydrogenfuel car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":125}
