{"m_szDocID":"589225","m_szDocTitle":"Fuel-Cell Cars Receive Hydrogen-Station Boost From U.S. - Bloomberg Business","m_szYear":"2014","m_szDocSumamry":"Fuel-Cell Cars Receive Hydrogen-Station Boost From U.S. Christopher Martin Share on LinkedIn Share on Reddit Share on Google+ E-mail Share on Twitter Share on WhatsApp The U.S. Energy Department is seeking to accelerate the design and construction of fueling stations for cars that run on hydrogen. Under the H2FIRST project announced today, the agency will collaborate with Sandia National Laboratories and the National Renewable Energy Laboratory on designs and materials for hydrogen fueling stations. Researchers will also share data with state agencies, automakers and hydrogen suppliers to redu","m_szDocBody":"fuelcell car receive hydrogenstation boost christopher martin share linkedin share reddit share google share share whatsapp energy department seeking accelerate design construction fueling station car run hydrogen hfirst project announced today agency collaborate sandia national laboratory national renewable energy laboratory design material hydrogen fueling station researcher share data state agency automaker hydrogen supplier reduce cost time needed develop infrastructure programme officially hydrogen fueling infrastructure research station technology part nascent effort promote wider vehicle run hydrogenpowered fuel cell technology offer promise fossilfuel replacement year mainstream hurdle lack fueling station success hydrogen fuelcell electric vehicle largely depend station available daniel dedrick hydrogen programme manager sandia statement road making happen quickly hyundai motor offer fuelcell vehicle toyota motor corp expect follow suit year meet mandate state including california requiring car company sell increasing number zeroemission vehicle fuelcell car produce electricity hydrogen chemical reaction emit greenhouse gase governor state including california york massachusett committed putting million fuelcell car road california providing million year fund hydrogen filling station state ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.bloomberg.com/news/articles/2014-04-30/fuel-cell-cars-receive-hydrogen-station-boost-from-u-s-","m_Places":["California","New York","Massachusetts"],"m_People":["Christopher Martin","Daniel Dedrick","Sandia"],"m_Companies":["Linkedin","Reddit","Google","Twitter","Energy Department","Sandia National Laboratories","National Renewable Energy Laboratory","Hyundai Motor Co","Toyota Motor Corp"],"m_BiGrams":["fuelcell car","fueling station"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":164}
