{"m_szDocID":"589240","m_szDocTitle":"Are hydrogen fuel cell range-extenders the perfect solution? The French investigate...","m_szYear":"2014","m_szDocSumamry":"Are hydrogen fuel cell range-extenders the perfect solution? The French investigate… January 30, 2014 | In: Innovation Leave a Comment In the raging battle for future automotive sustainability you’re either pro-hydrogen fuel cell or pro-battery-electric. Honda FCEV or Tesla Model S . Electrolysis or redox. It is a choice, but you cannot – could not ever – be for both. Especially not at the same time. It’s unthinkable. Or is it? An innovative solution has come from an unlikely source, and from early this year a small fleet of electric vans belonging to the iconic French postal service, La Poste","m_szDocBody":"hydrogen fuel cell rangeextender perfect solution french investigate innovation leave comment raging battle future automotive sustainability youre prohydrogen fuel cell probatteryelectric honda fcev tesla model electrolysis redox choice both time unthinkable innovative solution source early year small fleet electric van belonging iconic french postal service poste experiment hydrogen fuel cell rangeextender idea offer range normal electric car emitting harmful emission keeping affordable akin pot gold end rainbow van long time standard form electric renault kangoo van mile emission range youre lucky idea rangeextender isnt new either chevrolet volt bmw technology rangeextender them small gasoline engine fitted electric car car battery run charge grid mile volt mile bmw rangeextender whir life generate electricity recharge battery add weight huge gain usability effect rangeextender profound bmw roughly double range mile volt rangeextender deliver impressive mile surplus range hykangoos supply compressed hydrgoen sit rear axle snag rangeextender eliminate range anxiety emit harmful emission ultimately unsustainable stopgap enter hydrogen fuel cell rangeextender symbio fcell company building them poste kangoos benefit double driving range have allowing long delivery route hilly terrain cold weather single carbon dioxide molecule left behind full battery charge compressed hydrogen board total range hydrogen rangeextender renault mile percent poste fleet cover mile day benefit fitting electric car hydrogen range extender considerable fuel cell solution improve winter working condition postal worker providing heating defogging impacting battery performance jeanfranois courtoy industrial director poste franche comt region addition make replacing diesel vehicle today longer route possible significantly improve level global carbon dioxide emission thing however symbio fcell hoping deliver hykangoo inventively named euros production full swing expensive considerably cheaper pure hydrogen fuel cell car enter market year hykangoo compromised hydrogen refuelling station found station interested buying hykangoo full spec community rating ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://ecomento.com/2014/01/30/hydrogen-fuel-cell-range-extenders-perfect-solutions-french-investigate/","m_Places":[],"m_People":["Honda","Poste","Renault Kangoo Ze Vans","Jean","François"],"m_Companies":["Renault Kangoo Ze Vans","Bmw","I3","Volt","Renaults","Diesel"],"m_BiGrams":["fuel cell","hydrogen fuel","cell rangeextender","electric car"],"m_TriGrams":["hydrogen fuel cell","fuel cell rangeextender"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3],"m_TriCnt":[4,3],"m_iDocBodyWordCnt":286}
