{"m_szDocID":"589371","m_szDocTitle":"2015 Hyundai Tucson Fuel Cell Photos and Info – News – Car and Driver","m_szYear":"2015","m_szDocSumamry":"TWEET Official Photos and Info Hyundai America CEO John Krafcik is a pretty complimentary guy. He says Subaru has an unquestionably strong lineup, he thinks the Ford Fusion is an unqualified success, and he even gave props to your author’s tie during a recent conversation. But Krafcik doesn’t have much positive to say about battery-electric vehicles. He doesn’t like the excess weight that comes with batteries, he doesn’t like their limited range and long recharge times, and he thinks that the cost of recharging them at home is only going to go up as more households adopt the technology. He is,","m_szDocBody":"tweet official photos info hyundai america ceo john krafcik pretty complimentary guy subaru unquestionably strong lineup think ford fusion unqualified success gave prop author tie recent conversation krafcik doesnt positive batteryelectric vehicle doesnt excess weight battery doesnt limited range long recharge time think cost recharging home household adopt technology however smitten hydrogen prospect selling americansor specifically californianson technology enter hydrogenpowered hyundai tucson fuel cell tucson fuel cell isnt earthshatteringly new though hyundai sell fuel cell identical usspec model debuting los angele auto show save namein europe tucsonbadged model inhousedeveloped fuelcell stack lithiumpolymer battery hydrogen tank capable carrying pound gas euromarket counterpart deliver horsepower lbft torque mean electric motor tucson fuel cell hydrogen tank lithiumpolymer battery gobble underbody space room passenger cargo compared standard usspec tucson length increase inch secondrow legroom diminishes inch cargo capacity drop cubic feet hyundai hydrogenpowered tucson capable travelling mile fill process brand assure minutesonce youve found hydrogen filling station california fuel cell partnership filling station metro los angele bay area serve public california legislature provide million annually year construction additional location located largely san francisco current lack infrastructure hyundais fuel expenditure reason mile distance san francisco mean operator tucson fuel cell cuvs confined respective metro areas krafcik homefueling system considered moment hyundai tucson fuel cell leased select california dealership starting early april lease cost owner month month include maintenance unlimited fuel cost hyundai plan build hydrogen tucson annually alongside standard crossover automaker primary production facility ulsan south korea krafcik company move hydrogen crossover year distinct lack hydrogen pump today corner gas station hyundai deserve plaudit own ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.caranddriver.com/news/2015-hyundai-tucson-fuel-cell-photos-and-info-news","m_Places":["America Ceo","Subaru","Tucson","Los Angeles","Europe","Tucsons","California","San Francisco","L.a.","Ulsan","South Korea"],"m_People":["John Krafcik","Krafcik"],"m_Companies":["Hyundai","Subaru","Los Angeles"],"m_BiGrams":["fuel cell","tucson fuel"],"m_TriGrams":["tucson fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,5],"m_TriCnt":[5],"m_iDocBodyWordCnt":260}
