{"m_szDocID":"589338","m_szDocTitle":"Did Audi Just Wreck the Argument for Toyota's Hydrogen Car? -- The Motley Fool","m_szYear":"2015","m_szDocSumamry":"Login Did Audi Just Wreck the Argument for Toyota's Hydrogen Car? Toyota says that it built the fuel-cell Mirai because battery-powered cars take too long to recharge. But Audi just unveiled an electric SUV with over 300 miles of range that can be recharged in less than an hour -- and it’ll be on the market soon. John Rosevear ( TMFMarlowe ) Sep 19, 2015 at 8:05AM Toyota says that recharging time makes its hydrogen-powered Mirai a better bet than battery electric cars. But a new Audi SUV calls that claim into question. Source: Toyota. Toyota's (NYSE: TM) Mirai is an electric sedan powered by a","m_szDocBody":"audi wreck argument toyotas hydrogen car toyota built fuelcell mirai batterypowered car long recharge audi unveiled electric suv mile range recharged hour itll market soon john rosevear tmfmarlowe toyota recharging time make hydrogenpowered mirai bet battery electric car audi suv call question source toyota toyotas nyse mirai electric sedan powered hydrogen fuel cell device chemically extract energy hydrogen gas produce electricity clean technology exhaust water vapour producing hydrogen affordably clean process now led greencar enthusiast disparage toyotas effort toyota fuel cell superior battery electric car tesla motorsnasdaq tsla model toyota see electriccar battery long recharge batteryelectric car breaking mass market toyota scientist fast recharging realistic past week audi showed electric suv teslabeating range fully recharged hour production year company say audi send toyota back drawing board making huge bet batteryelectric technology audis corporate parent volkswagen nasdaqoth vlkay world largest automaker toyotas biggest rival determined outdo japanese giant electric car toyota lead world batteryelectric hybrid shied commitment pure batteryelectric car concern recharging time say executive decided tackle problem headon made significant progress audis etron quattro concept preview batteryelectric suv audi plan put production early mile range recharged hour source audi audi calling suv etron quattro concept company making clear preview vehicle audi intend put production say early production vehicle called audi capability close audi claiming concept impressive product audi etron quattro concept range kilometre mile fully charged electric motor give allwheel drive ability accelerate kilometre hour about mph second fast suv hottest version teslas model suv beat audi drag strip audi tesla beat time recharge vws combined charging system audi suvs kwh battery pack fully recharged minute toyota left behind audi executive tesla seriously convinced outdo silicon valley upstart possible tesla built great car audi devote resource interior design suspension refinement tesla match true audis corporate sibling porsche showed batteryelectric sport sedan past week matter clear tesla compete audi and porsche vice versa volkswagen commitment batteryelectric vehicle starting make battery viable massmarket option toyota audis recharging time fast render toyotas objection batteryelectric moot least big step direction suggest improvement likely toyota mirai interesting product compelling one case suddenly starting thin toyota make big bet wrong horse stay tuned billiondollar isecret world biggest tech company forgot show recent event wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them john rosevear position stock mentioned motley fool own recommend tesla motor foolish newsletter service free day fool hold opinion diverse range insight make investor motley fool disclosure policy ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fool.com/investing/general/2015/09/19/did-audi-just-wreck-the-argument-for-toyotas-hydro.aspx","m_Places":["Toyota","Tesla","Silicon Valley","Wall Street"],"m_People":["Audi Just","John Rosevear","Will Toyota","Porsche"],"m_Companies":["Audi","Nyse","Tesla Motors","Nasdaq","Volkswagen Group","Volkswagen","Revolution","Motley Fool"],"m_BiGrams":["recharged hour","recharging time","electric car","etron quattro","quattro concept"],"m_TriGrams":["etron quattro concept"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":418}
