{"m_szDocID":"589316","m_szDocTitle":"Hydrogen cars: all you need to know | Carbuyer","m_szYear":"2016","m_szDocSumamry":"Hydrogen cars: all you need to know Hydrogen cars: all you need to know What is a hydrogen car? How much do they cost? How far can I drive one? We've got all the answers What is a hydrogen car? A hydrogen car is driven by electric motors rather than a conventional petrol or diesel engine. But unlike more familiar electric vehicles like the Nissan Leaf and Renault ZOE , hydrogen cars don’t have batteries that need to be charged up. Instead, they generate power for their motors by mixing hydrogen with oxygen in something called a fuel cell. They need to be regularly filled up with hydrogen just ","m_szDocBody":"hydrogen car hydrogen car hydrogen car cost drive one answer hydrogen car hydrogen car driven electric motor conventional petrol diesel engine unlike familiar electric vehicle nissan leaf renault zoe hydrogen car dont battery charged instead generate power motor mixing hydrogen oxygen called fuel cell regularly filled hydrogen youd refuel petrol diesel car major advantage emit pollution whatsoever harmless water vapour make candidate replace petrol diesel automotive technology choice future reason isnt driving hydrogen car firstly technology new hydrogen car expensive secondly handful hydrogen filling station country severely limit driven hydrogen car now toyota mirai above hyundai fuel cell below government grant bring steep price manufacturer negotiate similar rebate buyer get drive hydrogen car hyundai fuel cell below travel mile tank hydrogen toyota claim range mile mirai refuelling complicated petrol diesel careful journey planning needed due limited number public hydrogen fuelling station running moment due open hydrogen cost simply put kilogramme now doesnt youre pence litre mile gallon diesel petrol toyota reckon equate mpg car travel kilo hydrogen litre petrol diesel mirai end costing half run buy hydrogen car bit private buyer yet mentioned above model offer hyundai fuel cell toyota mirai theyre extremely expensive buy rendered pretty impractical sparse hydrogen refuelling infrastructure theyll bought corporate customer keen handle potential challenge running hydrogenfuelled fleet theyve worked kink fuel station start open hydrogen car realistic option ordinary motorist buy hydrogen hydrogen refuelling location open public theyre london southeast heathrow hendon swindon teddington site east london sheffield due open limited infrastructure leave large part country offlimit hydrogen car time being thinking buying alternatively fuelled car cheque how guide hybrid electric car range extender read about ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.carbuyer.co.uk/tips-and-advice/144957/hydrogen-cars-all-you-need-to-know","m_Places":["Uk","Toyota","London","Swindon","East London","Sheffield"],"m_People":["Renault Zoe","Buyers","Hendon"],"m_Companies":["Renault Zoe","Diesel","Hyundai"],"m_BiGrams":["hydrogen car","petrol diesel","fuel cell","car hydrogen","hyundai fuel"],"m_TriGrams":["hyundai fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[13,5,4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":272}
