{"m_szDocID":"589454","m_szDocTitle":"6 questions about hydrogen fuel cell cars you were too embarrassed to ask | Al Jazeera America","m_szYear":"2014","m_szDocSumamry":"6 questions about hydrogen fuel cell cars you were too embarrassed to ask Contributor Phil Torres previews the future of hydrogen powered vehicles. October 8, 2014 2:00PM ET We recently toured the Toyota Technical Center in Gardena, CA to learn all about Toyota’s HFCV and the future of cars powered by hydrogen. Is that really water that comes out of the exhaust? Believe it or not, yes. Out of the exhaust comes water so pure you could drink it (but shouldn’t). The fuel you pump into these cars is hydrogen gas.  The energy is created in the fuel cell by reacting the hydrogen in the tanks with ox","m_szDocBody":"question hydrogen fuel cell car embarrassed contributor phil torre preview future hydrogen powered vehicle recently toured toyota technical centre gardena learn toyotas hfcv future car powered hydrogen water exhaust not yes exhaust water pure drink but shouldnt fuel pump car hydrogen gas energy created fuel cell reacting hydrogen tank oxygen air called proton exchange membrane end result electricity water water made hydrogen atom oxygen atom hence remnant fuelair interaction record drink water toyotas people didnt legal reason exhaust pipe pick dirt pollutant driving around hard trust water glass take energy make hydrogen fuel natural gas isnt bad environment normal car fortunately future production hydrogen fuel generally produce carbon dioxide greenhouse gas smaller carbon footprint currently majority hydrogen fuel made natural gas aid energy independent future isnt longterm option engineer working method solar power wind bacteria produce hydrogen fuel water waste greener future hydrogen flammable gas responsible explosive hindenburg blimp disaster tank car sceptical hydrogen gas tank safe safer drive demonstrating strength toyota shot gas tank bullet fact couldnt break tank shot armorpiercing bullet twice spot case leak hydrogen gas lighter air gas fairly quickly leave pool fuel normal gas tank tesla quite downside upcoming hydrogen fuel cell car dont speed flash tesla electric car notable superior acceleration torque compared gas diesel car filling hydrogen tank price filling normal gas car run mile tank mean expensive hybrid car prius fuel efficient mile electric car emission vehicle youre lessen impact environment great place start speaking electric car doesnt energy charge coal plant polluting car common argument electric car electricity charge car power plant fair share polluting energy efficiency pollutant output efficient produce lot energy larger power plant produce small amount energy car yes power plant charge electric car polluting air normal gas combustion engine car fill hydrogen fuel car appear biggest hurdle hydrogen fuel cell car industry simply arent station fill hydrogen car electric car number hydrogen fuel station increase price fuel lifetime cost car decrease significantly california ahead game hydrogen car map station theyve set million creation station aiming station state end ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://america.aljazeera.com/watch/shows/techknow/articles/2014/10/8/6-questions-abouthydrogenfuelcellcarsyouweretooembarrassedtoask.html","m_Places":["Toyota Technical Center","Gardena, Ca","Toyota","Tesla","California"],"m_People":["Phil Torres"],"m_Companies":["Gardena, Ca","Pool","Diesel"],"m_BiGrams":["hydrogen fuel","electric car","fuel cell","cell car","hydrogen gas","gas tank","normal gas","power plant"],"m_TriGrams":["hydrogen fuel cell","fuel cell car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,6,4,3,3,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":341}
