{"m_szDocID":"589439","m_szDocTitle":"BMW i5 Will Be A Hydrogen-Powered Crossover, Says BMWBlog - Gas 2","m_szYear":"2015","m_szDocSumamry":"BMW i5 Will Be A Hydrogen-Powered Crossover, Says BMWBlog September 12th, 2015 by Steve Hanley     Rumors are strange things. Some are just silly, like the rumor that Michael and Janet Jackson were the same person. Others are more substantive. The key to whether you should believe one or not is the source. When that source is BMWBlog , the likelihood that the rumor is true goes up. Way up. BMWBlog says the BMW i5 won’t arrive until 2020 and, when it gets here, it will be a hydrogen-powered crossover SUV. Didn’t see that one coming, did you? We know that BMW R&D chief Klaus Froehlich has said t","m_szDocBody":"bmw hydrogenpowered crossover bmwblog steve hanley rumour strange thing silly rumour michael janet jackson person substantive key source source bmwblog likelihood rumour true bmwblog bmw wont arrive and here hydrogenpowered crossover suv didnt coming you bmw r&d chief klaus froehlich that bmw wont arrive thatpartagree bmwblog folksthe rumour mill saysthe production model spectacular design brother butterfly door attractive appearance sacrifice comfort itspassenger thinking electric car bmw perfect daily urbanite suburbanite hydrogenpowered fuel cell car suited longdistance travel minimal time refuelling required note whole competitiveness purpose hydrogen fuel cell vehicle highly questionable bmw tested fuel cell powered sery sedan july sharing development duty toyota company plan sport car both surely mean bmw toyota fuel cell technology embodied hydrogenpowered mirai doesnt big question hydrogen refuelling infrastructure pay available bmw working creating electric charging network rival tesla moment total commercial hydrogen station located southern californiabmw mercede and other hedging bet electric car fuel cell technology elon musk call fool cell lot smart people investing time money fuel cell technology case bmwblog rumour true dont know part agree known bmw crawl fuel cell limb think make money right image credit bmwblog ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://gas2.org/2015/09/12/bmw-i5-will-hydrogen-powered-crossover-says-bmwblog/","m_Places":["Toyota","Means Bmw","Tesla","California"],"m_People":["Steve Hanley","Michael","Janet Jackson","Klaus Froehlich","Mercedes","Elon"],"m_Companies":["Bmw","Mill","I3","Means Bmw"],"m_BiGrams":["fuel cell","cell technology"],"m_TriGrams":["fuel cell technology"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":187}
