{"m_szDocID":"589438","m_szDocTitle":"Is Toyota’s Fuel Cell Vehicle Actually a Green Car?","m_szYear":"2014","m_szDocSumamry":"Is Toyota’s Fuel Cell Vehicle Actually a Green Car? Reddit CLEMENS BILAN/AFP/Getty Images When the Toyota Mirai  fuel cell vehicle  debuts in 2015, it will be the first car of its kind on sale in a U.S. dealership and the symbol of the world’s largest automaker pushing back against battery  electric vehicles . Yet few impartial people are willing to say hydrogen cars offer a cleaner ride than EVs at the moment. In fact, the technology needed to make fuel cell vehicles “green” compared to alternatives may arrive to your neighborhood much later than the Mirai will. There are no emissions from th","m_szDocBody":"toyotas fuel cell vehicle green car reddit clemen image toyota mirai fuel cell vehicle debut car kind salein dealership symbol world largest automaker pushing back battery electric vehicle yetfew impartial people hydrogen car offera cleaner ride evs moment fact technology needed make fuel cell vehicle green compared alternative arrive neighbourhood mirai will emission tailpipe fuel cell vehicle instead emit water vapour excite expecting toxic smoke plume coming vehicle sometime water drizzling tailpipe point aretherecarbon emission unfortunately guarantee apply car operation production hydrogen fuel clean currently hydrogen fueling car produced natural gas kind take hydraulic fracturing fracking source necessary however renewable source procure hydrogen fuel purpose union concerned scientist note california mandated hydrogen renewable source number coming year operation concerned fuel cell vehicle produce fewer emission gasoline car hyundai tucson crossover compared hydrogen model study production emission higher fuel cell car even benefit matching toyota mirai against say mazda achieve mile gallon highway david image study university california irvine appearing confirmed equivalent gasoline car hydrogen fuel cell vehicle wheel natural gas production batterypowered evs operating california grid power greener thaneither option study apply day california serve model fuel cell vehicle viable golden state hydrogen station scarce future equation change renewable source hydrogen including solar wind bio gas source potential make fuel cell vehicle greenest going york time topic pointed station california turn municipal waste yes kind waste fuel power hydrogen vehicle day renewable source hydrogen continue turning well shell oil recently funded study scientist produced hydrogen fuel corn husk othertype biomass day hydrogen fuel cell vehicle greenest car road toyota start selling mirai californiathere greener car therebattery electric vehicle promise posted equation shift direction ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cheatsheet.com/automobiles/is-toyotas-fuel-cell-vehicle-actually-a-green-car.html/?a=viewall","m_Places":["Toyota","California","Irvine"],"m_People":["David Becker"],"m_Companies":["Reddit","Afp","Getty Images","Union Of Concerned Scientists","University Of California","New York Times"],"m_BiGrams":["fuel cell","cell vehicle","hydrogen fuel","renewable source"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,9,5,4],"m_TriCnt":[9],"m_iDocBodyWordCnt":273}
