{"m_szDocID":"589422","m_szDocTitle":"Fuel cell technology: Hydrogen will be the future for fleets","m_szYear":"2013","m_szDocSumamry":"Fuel cell technology: Hydrogen will be the future for fleets 4 people found this useful Nickie Brooks, MD of Alternative Route Finance, looks at fuel cell technology. Hydrogen fuel has steadily attracted more and more interest over the past year. The technology uses fuel cells so, unlike an ordinary engine, the fuel isn’t burnt. Instead, the hydrogen is chemically fused with oxygen to make water. Many car manufacturers have been getting behind  revolutionary new fuel, none more than Toyota, who at the recent Consumer Electronic Show gave away nearly 6,000 patents it owns that cover hydrogen fu","m_szDocBody":"fuel cell technology hydrogen future fleet people found nickie brook alternative route finance fuel cell technology hydrogen fuel steadily attracted interest past year technology fuel cell unlike ordinary engine fuel isnt burnt instead hydrogen chemically fused oxygen make water car manufacturer revolutionary fuel toyota recent consumer electronic show gave patent own cover hydrogen fuel cell technology toyota sharing intellectual property free show devotion creating hydrogen society presented hydrogenpowered car mirai benefit modern electric vehicle evs documented inception quiet smooth drive cheap run added incentive ability charge home fact reduced environmental impact advantage evs however main problem time take recharge vehicle lack charge point make driving long distance concern youre unable locate charge point way youll limited range single charge hydrogen vehicle hand method petrol diesel quick easy refuel implementing hydrogen fuel source expensive backing manufacturer daimler ford nissan renault agreed joint development fuel cell system launch massmarketing early mercedesbenz demonstrated belief latest concept car luxury motion put equal significance autonomous feature clean fuel electrichydrogen hybrid motor power car hydrogen fuel genuinely exciting manufacturer strong backing majority industry expect hydrogen car popular before ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fleetnews.co.uk/blog/entry/fuel-cell-technology-hydrogen-will-be-the-future-for-fleets/55145/","m_Places":["Md","Toyota"],"m_People":["Nickie Brooks"],"m_Companies":["Diesel","Daimler Ag","Renault","Mercedes-benz"],"m_BiGrams":["fuel cell","hydrogen fuel","cell technology"],"m_TriGrams":["fuel cell technology"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":182}
