{"m_szDocID":"589477","m_szDocTitle":"Porsche May Build Battery-Electric, Hydrogen Fuel Cell Vehicle | Digital Trends","m_szYear":"2015","m_szDocSumamry":"Delivered to your inbox for free! Last year, reports circled  that Porsche  was planning an all-electric version of the upcoming Pajun sedan. It appears that those claims weren’t just a pipe dream, as a Volkswagen Group executive has again teased the concept of a silent Porsche. But don’t worry, purists. Your 911s and Caymans are safe. Dr. Ulrich Hackenberg, the Research and Development Chief for Audi, recently displayed the following graphic at VW Group’s annual conference. The image comes courtesy of Autocar . Autocar As you can see, there are spots reserved for a BEV (Battery Electric Vehic","m_szDocBody":"delivered inbox free year report circled porsche planning allelectric version upcoming pajun sedan appear claim werent pipe dream volkswagen executive teased concept silent porsche dont worry purist cayman safe ulrich hackenberg research development chief audi recently displayed graphic group annual conference image courtesy autocar autocar see spot reserved bev battery electric vehicle fcev fuel cell electric vehicle porsche row placeholder real implication doubtful signify endeavour brand porsche hybrid vehicle porsche spyder pictured cayenne ehybrid panamera ehybrid evs fcvs however ball game porsches relationship audi fresh debut etron volkswagen who developing hydrogen car stuttgart bevvy technology choose brand flirted electric technology boxter prototype related ruf rgt add manual transmission and power porsche pajun expected show effectively smaller version current panamera gas diesel version reportedly well electric version taking tesla model head hackenberg conference detail technology audi feature include sensor piece autonomous gadgetry expect piloted driving version smaller car like golf ready road watch top expensive car world top storey delivered inbox ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.digitaltrends.com/cars/porsche-may-build-battery-electric-hydrogen-fuel-cell-vehicle/","m_Places":["Cayenne","Stuttgart"],"m_People":["Porsche","Ulrich Hackenberg","Audi","Hackenberg"],"m_Companies":["Volkswagen Group","Vw Group","Autocar","Volkswagen","Diesel","Around 2020"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":160}
