{"m_szDocID":"589418","m_szDocTitle":"Electric vs hydrogen cars, who wins?","m_szYear":"2015","m_szDocSumamry":"Electric vs hydrogen cars, who wins? August 26, 2015 | In: Green Car Industry , Technology , Videos 3 Comments The Motley Fool makes its living offering predictions about the future of the stock market. Since technology is a big factor in stock prices, it makes sense that The Fool (as it likes to call itself) should focus its attention on the electric vs hydrogen battle taking place among the world’s auto makers. Toyota has placed a huge bet on fuel cell technology. It’s hydrogen powered Mirai will be available in California shortly, where only a handful of hydrogen fueling stations are availa","m_szDocBody":"electric hydrogen car win green car industry technology videos comment motley fool make living offeringprediction future stock market technology big factor stock price make sense fool like call itself focus attention electric hydrogen battle taking place world auto maker toyota huge bet fuel cell technology hydrogen powered mirai california shortly handful hydrogen fueling station service mirai driver precisely problem motley fool contributor travis holum infrastructure key electric hydrogen contest public electric charging station charging outlet department energy private charging station installed people home people work toyota hope station operation california soon soon elon musk set tesla model loose world made company invested money build comprehensive system recharging station tesla driver toyota aggressive approach servicing mirai customersone reason hydrogen station cost million dollar construct electric charger cheap comparison advantage fuel cell car one exhaust emission water heat second refuelled minute less depending equipment working correctly fuel cell advocate insist average driver wait minute electric car recharge make home entire list minus side hydrogen cost gasoline more actually time unusually low oil price doesnt exist freely nature ocean filled trillion gallon water made hydrogen atom oxygen atom surely then ocean offer inexhaustible supply hydrogen power world millenia actually theenergy needed break chemical bond hydrogen oxygen energy produced word hydrogen sum game here consider hydrogen commercial purpose natural gas natural gas fracking ecology alert fuel cell advocate laud hydrogen power conveniently forget process needed make hydrogen place environmentally destructive commercial enterprise earth worse conventional oil drilling hydrogen clean energy solution future continue pillaging earth driver save minute refuelling here aspect electric hydrogen debate electric car driver rapid acceleration press pedal right electric car quicker line gas powered equivalent far report mirai performance leisurely people excitedthe internet filled videos teslas outgunning manner gas powered competitor drag strip car underwhelming performance making sedately tracklet face electric car sexy fuel cell car not upshot battle electric fuel cell car electric won motley fool auf wiedersehen baby hasta vista future here fuel cell car obscure footnote opinion vary dealer detail share ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://ecomento.com/2015/08/26/electric-vs-hydrogen-cars-who-wins/","m_Places":["Toyota","California","Tesla","Teslas"],"m_People":["Travis Holum","Elon"],"m_Companies":["Motley Fool","Us Department Of Energy"],"m_BiGrams":["fuel cell","electric hydrogen","cell car","electric car","motley fool"],"m_TriGrams":["fuel cell car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,4,4,4,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":334}
