{"m_szDocID":"589414","m_szDocTitle":"Pioneering hydrogen fuel cell station opens in West Sacramento - Sacramento Business Journal","m_szYear":"2014","m_szDocSumamry":"5 photos This is a Toyota Mirai, a fuel cell vehicle powered by renewable hydrogen. California has a goal of having 20,000 fuel cell cars on the road by 2020 and 1.5 million zero-emission cars on the road by 2025. To make that a reality, fueling stations are needed, so now the Sacramento region has one. Ramos Oil opened the 10th hydrogen fueling station in the state with fanfare on Wednesday. The station in West Sacramento is for fuel cell cars, which convert the hydrogen to electricity to drive the car. The fuel cell cars have a longer range than pure electric cars. Slideshow: Hydrogen fuel s","m_szDocBody":"photos toyota mirai fuel cell vehicle powered renewable hydrogen california goal fuel cell car road million zeroemission car road make reality fueling station needed sacramento region one ramos oil opened hydrogen fueling station state fanfare wednesday station west sacramento fuel cell car convert hydrogen electricity drive car fuel cell car longer range pure electric car slideshow hydrogen fuel station station part effort state california make hydrogen fuelcell car commercially viable creating network station hydrogen station operation bay area handful southern california station developed truckee california phenomenon hydrogen station developed northeast including york jersey connecticut rhode island far car model introduced free fuel year make fact hydrogen cost percent gasoline move car mile hydrogen used cheaper larger scale michael beckman head hydrogen fueling application linde llc munich germany based company built technology ramos fueling station building west sacramento hydrogen fueling station cost million cost station built beckman said construction cost pioneering station south river road supported million california energy commission expanding alternative renewable fuel april california energy commission invest million open public hydrogen station state goal station network currently automotive fuel station open development map california fuel cell partnership opening west sacramento station featured model introduced model year including hyundai tucson toyota mirai mercedesbenz fcell offered monthly include fuel maintenance buying toyota mirai cost state federal rebate craig scott national manager toyotas advanced technology vehicle toyota working fuel cell technology year road testing hydrogen car year scott said mirai sale month japan sale summer said toyota people list car technology work give consumer confidence toyota offering mirai eightyear mile warranty mark anderson cover technology agriculture banking finance venture capital energy mining hospitality sacramento business journal industry ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.bizjournals.com/sacramento/news/2014/12/10/pioneering-hydrogen-fuel-cell-station-opens-in.html","m_Places":["Toyota","California","Sacramento","Southern","Truckee","New York, New Jersey","Connecticut","Rhode Island","Munich","Germany","Japan"],"m_People":["Michael Beckman","Beckman","Craig Scott","Mark Anderson"],"m_Companies":["State Of California","Linde Llc","Energy Commission","Mercedes-benz","Advanced Technology","Sacramento Business Journal"],"m_BiGrams":["fuel cell","fueling station","toyota mirai","cell car","hydrogen fueling","west sacramento","hydrogen station"],"m_TriGrams":["fuel cell car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":275}
