{"m_szDocID":"589539","m_szDocTitle":"Test drive: Hydrogen fuel cell Toyota Mirai cruises 300 miles, costs $45K – can your EV do that? | ExtremeTech","m_szYear":"2015","m_szDocSumamry":"Test drive: Hydrogen fuel cell Toyota Mirai cruises 300 miles, costs $45K – can your EV do that? Test drive: Hydrogen fuel cell Toyota Mirai cruises 300 miles, costs $45K – can your EV do that? By Bill Howard on January 27, 2015 at 8:30 am Comment Share This article Most EVs give out after 75 miles. The Toyota Mirai hydrogen-to-electricity fuel cell car is the Energizer Bunny of electrically driven cars — it’s good for as much as 300 miles. A test drive shows the Mirai is quick if not cat-quick, with room for four and luggage, and unmistakable in looks. Best of all, it will be available this y","m_szDocBody":"test drive hydrogen fuel cell toyota mirai cruise mile cost that test drive hydrogen fuel cell toyota mirai cruise mile cost that bill howard comment share evs give mile toyota mirai hydrogentoelectricity fuel cell car energizer bunny electrically driven car good mile test drive show mirai quick catquick room luggage unmistakable look all willbe year factoring government incentive mirai run hydrogen converted electricity water vapour exhaust byproduct unlike evs minute overnight fully recharge mirais hydrogen tank refuelled minute place fill handful country california sale kick off place fill toyota pay fuel year ownership meantime mirai intriguing fairly polished car wheel uneventful detached performance hop driver seat futuristic glass cockpit lcd display centre stack touchscreen capacitive touch slider switches temperature setting addition instrument panel centre stack display eyebrow row instrumentat centre stack windshield startup procedure car press starter button youre ready going toyota estimate range mile meaning longest range hydrogen compressed natural gas electric vehicle yet assuming calculate driving range way front end toyotas fuel cell prototype mirai move smoothly small nimh battery pack boost car rolling because toyota say slight lag foot pushes throttle hydrogen strong electric power youre underway mirai drive evs sporty tesla chassis steering tuned undramatic performance mirai feel bit heavy plus pound pound heavier toyota camry length saved pound lithiumion battery made car technology contemporary steering doesnt provide lot road feedback regenerative braking isnt aggressive make mirai onepedal vehicle slow significantly lift foot throttle normal batterypriority mode increase regenerative braking bit meant sport car cabin comfortable four inches long size midsize sedan back seat passenger seat heater fixed armrest back make fourpassenger sedan trunk large unaffected hydrogen fuel tank mirais design polarising lot plane sharp edge eye ungainly not mirai distinctive toyota prius distinctive road prius mirai ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.extremetech.com/extreme/198231-test-drive-hydrogen-fuel-cell-toyota-mirai-cruises-300-miles-costs-45k-can-your-ev-do-that","m_Places":["Toyota","California","Tesla"],"m_People":["Bill Howard"],"m_Companies":["Energizer","Seat","Procedure"],"m_BiGrams":["fuel cell","test drive","hydrogen fuel","toyota mirai","centre stack"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":291}
