{"m_szDocID":"589507","m_szDocTitle":"How It Works: The Toyota Mirai | Popular Science","m_szYear":"2015","m_szDocSumamry":"The intake grill sends oxygen—a crucial component in the mix—to the fuel cell stack. 3. Power Control Unit As the car’s energy manager and brain, the power control unit draws electricity from the fuel stack and sends it to the motor. During acceleration, it draws stored energy from the battery for an extra boost. 4. Battery Unlike in tradi­tional electric cars, the nickel-metal hydride battery in the Mirai stores only excess energy for use during ignition and acceleration. 5. Electric Motor As electricity passes through the motor, it polarizes the stator—a stationary ring around the rotor—to c","m_szDocBody":"intake grill send oxygena crucial component mixto fuel cell stack power control unit car energy manager brain power control unit draw electricity fuel stack send motor acceleration draw stored energy battery extra boost battery unlike traditional electric car nickelmetal hydride battery mirai store excess energy ignition acceleration electric motor electricity passe motor polarise statora stationary ring rotorto create rotating magnetic field magnet mounted rotor align field spin rate power drivetrain electricity motor faster field spin faster car goe braking coasting motor generate electricity battery fuel cell basic form fuel cell anode cathode polymer electrolyte membrane pem cell generate voltage own engineer string seriesor stack mirais stack cell working transform stored chemical energy electricity here how cell hydrogen run flow field plate anode there platinumcobalt catalyst split hydrogen molecule positively charged ion negatively charged electron then pem permit hydrogen ion pass cathode stop electron forcing travel outer circuit creating electric current finally electron ion meet oxygen cathode form water emitted primarily vapour originally published popular science part annual work package tag ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.popsci.com/how-hydrogen-vehicles-work","m_Places":[],"m_People":[],"m_Companies":["Popular Science"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":170}
