{"m_szDocID":"589524","m_szDocTitle":"Toyota taking orders for Mirai fuel cell vehicle in U.S.","m_szYear":"2015","m_szDocSumamry":"FacebookEmail Twitter Google+ LinkedIn Pinterest Toyota taking orders for Mirai fuel cell vehicle in U.S. More hydrogen stations are being built as Toyota prepares to sell the Mirai fuel cell vehicle in the U.S. this fall. Post to Facebook Toyota taking orders for Mirai fuel cell vehicle in U.S. More hydrogen stations are being built as Toyota prepares to sell the Mirai fuel cell vehicle in the U.S. this fall. Check out this story on Freep.com: http://on.freep.com/1N7QdPp CancelSend A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 1 To ","m_szDocBody":"facebookemail google linkedin pinterest toyota taking order mirai fuel cell vehicle hydrogen station built toyota prepare sell mirai fuel cell vehicle fall post toyota taking order mirai fuel cell vehicle hydrogen station built toyota prepare sell mirai fuel cell vehicle fall cheque storey freepcom cancelsend link friend address posted link posted feed commenting read conversation guideline faqs toyota taking order mirai fuel cell vehicle alisa priddle detroit free press edt hydrogen station slowly added starting california justin ward toyota technical centre prove update mirai fuel cell vehicle seminar traverse city aug photo alisa priddle traverse city toyota prepare sell mirai fuel cell vehicle fall remain hydrogen station fill car tank toyota started production mirai japan sale waiting list customer justin ward general manager powertrain system control department toyota technical centre north america car hydrogen fuel cell stack generate electricity onboard power car ward speaker car management briefing seminar traverse city event resumed full session devastating storm tree cut power leaving hotel dark forcing cancellation session opening day monday order bank mirai opened month potential customer expressed interest ward said interviewed ensure live california roughly hydrogen station alternative fuel fit drive ward encouraged plan element fuel build stateoftheart retail station hydrogen swipe credit card fill tank gaseous hydrogen minute hopeful station place california end year rest end hoping partnership air liquide result hydrogen station mideast year hydrogen tank midsize mirai hold kilogramme collectively hydrogen fuel fuel cell stack produce electricity run mile car cost including destination charge eligible rebate california ward company rebate offered option month car year worth free hydrogen hydrogen range kilogramme toyota build mirais market end ward said deliberate strategy start small technology toyota alone hyundai introduced tucson fuel cell vehicle year leasedto customer honda offer fuel cell vehicle year honda partnered general motor continue development technology pam fletcher executive chief engineer electrified vehicle million mile test fleet chevrolet equinox fuel cell vehicle timeframe commercial sale fuel cell vehicle honda betting big hydrogen fuel cell car toyota honda introduced fuel cell vehicle testing decade ago honda original clarity toyotas fuel cell vehicle called fchv highlander body updated fchvadv miraiwhich unique body style time mirai battery electric motor key component family hybrid ward said car power control unit control output fuel stack battery charge discharge boost converter attached fuel cell stack ty hybrid system developed inhouse industry ward said piece hardware boost voltage volt volt fuel cell stack toyota break ground michigan tech centre expansion lot work crash testing hot cold temperature testing hydrogen tank fuel cell stack ward toyota confident safety performance japan toyota working hino fuel cell bus project pulled ahead north america ward dispute notion battle electric vehicle fuel cell vehicle there dukeout fight reality sustainable future house electric car fuel cell vehicle driveway contact alisa priddle follow connect tweet linkedin commentemailmore read share storey storey ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.freep.com/story/money/cars/2015/08/04/toyota-mirai-fuel-cell-vehicle-car-seminar-traverse-city/31104205/","m_Places":["Toyota","California","Japan","Toyota Technical Center","North America","Tucson","Michigan","Hino"],"m_People":["Alisa Priddle","Justin Ward","As Toyota","Honda","Pam Fletcher","Adv"],"m_Companies":["Twitter","Google","Linkedin","Pinterest","Facebook","Detroit Free Press","Control Department","Air Liquide","Hyundai","General Motors","Highlander","Volts"],"m_BiGrams":["fuel cell","cell vehicle","mirai fuel","hydrogen station","cell stack","ward said","toyota taking","taking order","order mirai","toyota prepare","prepare sell","sell mirai","vehicle fall","alisa priddle","traverse city","hydrogen fuel"],"m_TriGrams":["fuel cell vehicle","mirai fuel cell","fuel cell stack","toyota taking order","taking order mirai","order mirai fuel","toyota prepare sell","prepare sell mirai","sell mirai fuel","cell vehicle fall"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[21,15,7,6,5,4,3,3,3,3,3,3,3,3,3,3],"m_TriCnt":[15,7,4,3,3,3,3,3,3,3],"m_iDocBodyWordCnt":470}
