{"m_szDocID":"589530","m_szDocTitle":"New Method Improves Hydrogen Fuel Cell Efficiency","m_szYear":"2015","m_szDocSumamry":"New Method Improves Hydrogen Fuel Cell Efficiency Wed, 09/23/2015 - 9:09am Get daily news for laboratory professionals - Sign up now! With the growth of wind and solar energy and the increasing popularity of electric vehicles, many people in the U.S. may have forgotten about the promised “hydrogen economy.” But in research labs around the world, progress continues. Now scientists are reporting in the Journal of the American Chemical Society a new process that could help us move faster toward sustainable hydrogen-based energy. One of the major challenges to developing affordable hydrogen fuel c","m_szDocBody":"method improve hydrogen fuel cell efficiency wed daily new laboratory professional now growth wind solar energy increasing popularity electric vehicle people forgotten promised hydrogen economy research lab world progress continue scientist reporting american chemical process move faster sustainable hydrogenbased energy major challenge developing affordable hydrogen fuel cell storage hydrogen explosive require costly container hold safely recently scientist shown formic acid good candidate storing hydrogen common industrial chemical stuff ant venom stable inexpensive molecule acid made atom hydrogen atom splitting formic acid release hydrogen produce electricity require lot heating processing qiang colleague set way researcher developed simple method producing palladiumbased nanomaterial spur breakdown formic acid hydrogen carbon dioxide efficiency exceeded reported heterogeneous catalyst say found process produced carbon dioxide hydrogen carbon monoxide contamination problem method ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.laboratoryequipment.com/news/2015/09/new-method-improves-hydrogen-fuel-cell-efficiency","m_Places":[],"m_People":["Xu"],"m_Companies":["Journal Of The American Chemical Society"],"m_BiGrams":["formic acid"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":124}
