{"m_szDocID":"589549","m_szDocTitle":"Tesla CEO Elon Musk | Hydrogen fuel cells are 'extremely silly' | Digital Trends","m_szYear":"2016","m_szDocSumamry":"Delivered to your inbox for free! Tesla CEO Elon Musk is not a fan of flying cars  or artificial intelligence , but perhaps his biggest aversion is the hydrogen fuel cell vehicle. Speaking at the Automotive News World Congress in Detroit last month, Musk reiterated his critiques of the technology as both a power source and an automotive trend, saying, “I don’t want to turn this into a debate on hydrogen fuel cells, because I just think that they are extremely silly.” “It’s just very difficult to make hydrogen, and store it, and use it in a car,” he continued. “Hydrogen is an energy-storage mec","m_szDocBody":"delivered inbox free tesla ceo elon musk fan flying car artificial intelligence biggest aversion hydrogen fuel cell vehicle speaking automotive new world congress detroit month musk reiterated critique technology power source automotive trend saying dont turn debate hydrogen fuel cell extremely silly difficult make hydrogen store car continued hydrogen energystorage mechanism source energy hydrogen somewhere musk expanded point breaking hydrogen extraction process hydrogen water youre splitting electrolysis extremely inefficient energy process explained solar panel energy solar panel charge battery pack directly compared split water hydrogen dump oxygen compress hydrogen extremely pressure liquefy put car run fuel cell half efficiency terrible that asked make sense related gas past electric car pass pump forever musk explain hydrogen poor choice element referencing low density volatility statement video posted everyelonmuskvideo above prominent ceo spoke teslas sale china upcoming model model ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://www.digitaltrends.com/cars/elon-musk-says-fcvs-are-extremely-silly/","m_Places":["Tesla","Detroit","China"],"m_People":["Elon"],"m_Companies":["Automotive News"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":136}
