{"m_szDocID":"589640","m_szDocTitle":"NEL's Subsidiary H2 Logic Secures Repeat-Order for H2Station® to Danish Hydrogen Fuel A/S | Business Wire","m_szYear":"2015","m_szDocSumamry":"OSLO, Norway--( BUSINESS WIRE )--Regulatory News: H2 Logic A/S, a leading manufacturer of hydrogen fueling stations and a        subsidiary of Oslo Stock Exchange listed NEL ASA (OSE:NEL), has been        awarded a contract for one H2Station® fueling station for Danish        Hydrogen Fuel A/S (DHF). It constitutes the fourth repeat-order under an        existing collaboration agreement with DHF. The H2Station® is to be        delivered during 2016 and located in the city of Esbjerg, Denmark. In February 2015, Danish Hydrogen Fuel A/S (DHF) was established as a        joint venture between the","m_szDocBody":"oslo norway business wire regulatory new logic leading manufacturer hydrogen fueling station subsidiary oslo stock exchange listed nel asa osenel awarded contract hstation fueling station danish hydrogen fuel dhf constitute fourth repeatorder existing collaboration agreement dhf hstation delivered located city esbjerg denmark danish hydrogen fuel dhf established joint venture oil company gas company strandmllen logic dhf target build hydrogenfueling station onward denmark order hstation esbjerg fourth logic dhf hstation delivered dhf located korsr aarhus hstation delivery located city kolding nel nel asa dedicated hydrogen company oslo stock exchange foundation nel hydrogen proud history development continual improvement hydrogen plant nel global supplier hydrogen solution covering entire chain hydrogen production technology hydrogen refuelling station fuel cell electric vehicle logic leading manufacturer hstation hydrogen refuelling station fuel cell electric vehicle fast fueling long range conventional vehicle today information brought cision ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.businesswire.com/news/home/20151221005663/en/NELs-Subsidiary-H2-Logic-Secures-Repeat-Order-H2Station%C2%AE","m_Places":["Oslo","Norway","Denmark"],"m_People":["Ose","Nel","Kolding"],"m_Companies":["Business Wire","H2 Logic A/s","Oslo Stock Exchange","Nel Asa","Danish Hydrogen Fuel A/s"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":137}
