{"m_szDocID":"589685","m_szDocTitle":"Audi May Unveil a Hydrogen Fuel Cell Concept in Detroit | Digital Trends","m_szYear":"2016","m_szDocSumamry":"Delivered to your inbox for free! The Audi e-tron quattro concept that debuted at this year’s Frankfurt Motor Show is just the tip of the iceberg when it comes to the brand’s interest in electric cars. It previews a production model due in 2018, and Audi believes electric cars will comprise a quarter of its U.S. sales by 2025 . But the German carmaker may be looking to hedge its bets. Audi will debut a hydrogen fuel cell concept car at the 2016 Detroit Auto Show next month, according to Autobild . Possibly called h-tron quattro, the new concept will reportedly use the same body as the e-tron q","m_szDocBody":"delivered inbox free audi etron quattro concept debuted year frankfurt motor show tip iceberg brand interest electric car preview production model due audi believe electric car comprise quarter sale german carmaker hedge bet audi debut hydrogen fuel cell concept car detroit auto show month autobild possibly called htron quattro concept reportedly body etron quattro fuel cell battery mean htron quattro preview upcoming audi crossover coupe audis rival bmw mercedesbenz gle coupe vehicle drawback suv practicality alreadyconfirmed batteryelectric powertrain sold alongside internal combustion variant audi tack fuel cell version well related bmw show fuelcell prototype wont commit production audi isnt complete stranger fuel cell los angele auto show unveiled hydrogenpowered htron quattro concept individual electric motor power axle lithiumion battery pack charged plugging external source augmenting fuel cell stack htron quattro concept turn detroit interesting compare electric sibling etron quattro sport electric motor drive wheel produce horsepower normal condition red mist descend enoughfor mph second top speed electronically limited mph batteryelectric car gained beachhead past year fuel cell car starting assault hyundai began selling tucson fuel cell california year toyota delivered mirai october theyll year honda clarity fuel cell however network fueling station needed support car watch top expensive car world top storey delivered inbox ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.digitaltrends.com/cars/audi-hydrogen-fuel-cell-concept/","m_Places":["Frankfurt","Detroit","Los Angeles","Tucson","California","Toyota"],"m_People":[],"m_Companies":["Audi","Mercedes-benz","Bmw","Los Angeles","Hyundai","Honda"],"m_BiGrams":["fuel cell","quattro concept","htron quattro","etron quattro"],"m_TriGrams":["htron quattro concept"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,4,4,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":204}
