{"m_szDocID":"589677","m_szDocTitle":"Will Mercedes-Benz Be The Father Of Luxury Hydrogen Fuel-Cell Cars?","m_szYear":"2015","m_szDocSumamry":"Will Mercedes-Benz Be The Father Of Luxury Hydrogen Fuel-Cell Cars? by Gabriel Eum Share on Facebook Share on Twitter It may be onto something with this new crossover. Automakers have recently been trying out different green ways to power cars. Tesla has been at the top of the electric car game for some time. Toyota also has its funky-looking Mirai, powered by a hydrogen fuel-cell, that debuted last year . With a potential maximum range of 300 miles, the Mirai showed us that there is a possible future for hydrogen fuel-cell cars. It seems that Mercedes-Benz got jealous and decided to respond w","m_szDocBody":"mercedesbenz father luxury hydrogen fuelcell car gabriel eum share share crossover automaker recently green way power car tesla top electric car game time toyota funkylooking mirai powered hydrogen fuelcell debuted year potential maximum range mile mirai showed future hydrogen fuelcell car mercedesbenz jealous decided respond glc fcell car based glcclass revealed month ago share jaguarland rover spokesperson offroader hig secret nissan museum japan glc fcell set debut frankfurt motor show arrive showroom year autocar state car offered customer select market monthly programme outright purchase thomas weber mercedesbenz head research development told autocar automaker targeting combined range fuel cell battery mile refuelling time hydrogen tank minute impressive type powertrain weber told autocar continued cost fuel stack make hydrogen fuel cell model commercially viable higher classe share mean wont drive hydrogen fuelcell prius now doesnt wont all weber continued technology matured greatly recent year improved packaging efficiency remain infancy expensive conventional driveline standard give year hydrogenpowered prius bold move mercedesbenz sell car powered costly powertrain reasonable price mercede place affordable hydrogen fuelcell car tesla wellexecuted electric car time tell share ","m_szGeo1":"Japan","m_szSourceType":"source_news","m_szSrcUrl":"http://www.carbuzz.com/news/2015/12/6/Will-Mercedes-Benz-Be-The-Father-Of-Luxury-Hydrogen-Fuel-Cell-Cars-7730785/","m_Places":["Tesla","Toyota","Japan","Frankfurt"],"m_People":["Thomas Weber","Mercede"],"m_Companies":["Mercedes-benz","Facebook","Twitter","Jaguar","Land Rover","Hig","Autocar"],"m_BiGrams":["hydrogen fuelcell","fuelcell car"],"m_TriGrams":["hydrogen fuelcell car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":178}
