{"m_szDocID":"589628","m_szDocTitle":"Hyundai IONIQ vs Honda FCX and Hyundai Tucson Fuel-Cell","m_szYear":"2015","m_szDocSumamry":"tweet As the world continues to adapt, so do vehicle companies. Many companies have already started developing vehicles with alternative fuel and fuel-cell technology. Two companies, in particular, that have been are Hyundai and Honda. The Hyundai IONIQ, the Hyundai Tucson, and the Honda FCX are three of the top alternative fuel and fuel-cell vehicles as we speak. THE DIFFERENCE BETWEEN ALTERNATIVE FUEL AND FUEL-CELL VEHICLES Fuel-cell vehicles and vehicles that use alternative fuel do share a difference. Alternative fuel cars do not use an engine to burn gasoline for fuel. They are fueled by ","m_szDocBody":"tweet world continue adapt vehicle company company started developing vehicle alternative fuel fuelcell technology company particular hyundai honda hyundai ioniq hyundai tucson honda fcx top alternative fuel fuelcell vehicle speak difference alternative fuel fuelcell vehicle fuelcell vehicle vehicle alternative fuel share difference alternative fuel car engine burn gasoline fuel fueled electricity engine instead battery electricity stored power car electric motor now fuelcell vehicle electric motor powered battery themselve instead powered oxygen air stored hydrogen hyundai ioniq alternative fuelcar recently month company announced hyundai ioniq model released year vehicle engine choice making choose electric plugin gasoline hybrid electric regular gasoline hybrid full electric motor company stated vehicle world consumer choose phev hybrid honda fcx fuelcell vehicle honda fcx fuelcell vehicle work differently hyundai ioniq fuelcell vehicle powered battery themselve vehicle store electricity inside them honda fcx hydrogen tank store hydrogen combined oxygen create electricity stored lithiumion battery electricity vehicle run hyundai tucson fuelcell vehicle hyundai vehicle fuelcell technology now hyundai tucson leased month month vehicle fuelcell technology power company noted massproduced fuelcell vehicle world safety main point hyundai tucson blind spot remover automatic emergency braking system lane departure warning technology builtin alternative fuel fuelcell vehicle big similarity major similarity alternative fuel fuelcell technology similarity gasoline electricity achieve differently electricity aimed making world cleaner case alternative fuel fuelcell vehicle case made vehicle company make gasoline powered vehicle anymore due fact alternative fuel fuel cell emit carbon dioxide make world cleaner attributed helping climate change global warming producing vehicle emit carbon dioxide good step stopping global warming good world company produce fuelcell vehicle world making type vehicle ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://clapway.com/2015/12/18/hyundai-ioniq-alternative-fuel-car-vs-honda-fcx-and-hyundai-tucson-fuel-cell-vehicles/","m_Places":[],"m_People":["Ioniq Alternative"],"m_Companies":["Many Companies","Cell Technology","Two Companies","Hyundai","Honda","Vehicle Does Indeed Use Fuel"],"m_BiGrams":["fuelcell vehicle","alternative fuel","fuel fuelcell","fuelcell technology","hyundai ioniq","hyundai tucson","honda fcx","vehicle fuelcell","electric motor","vehicle world"],"m_TriGrams":["alternative fuel fuelcell","fuel fuelcell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[12,9,6,4,4,4,4,3,3,3],"m_TriCnt":[6,4],"m_iDocBodyWordCnt":264}
