{"m_szDocID":"589638","m_szDocTitle":"Hydrogen Vehicles Among London's Taxis, Soon - The Green Optimistic","m_szYear":"2015","m_szDocSumamry":"Samantha Joe December 20, 2015 Car industry , Hydrogen Power London has a new kind of taxi in town. Hydrogen fuel cell vehicles operated by a company called Green Tomato Cars, started to pick up passengers soon after COP21 (the Paris agreement) was signed by world leaders, officially recognizing the “urgent and potentially irreversible threat” to our world, posed by climate change. The cars being used are Toyota Mirai Saloons. When hydrogen fuel cell vehicles like the Mirai are driven, only warm water vapor is produced. This vapor condenses as it meets cooler air, meaning that water is the onl","m_szDocBody":"samantha joe car industry hydrogen power london kind taxi townhydrogen fuel cell vehicle operated company called green tomato car started pick passenger cop the paris agreement signed world leader officially recognising urgent potentially irreversible threat world posed climate change car toyota mirai saloon hydrogen fuel cell vehicle mirai driven warm water vapour produced vapour condense meet cooler air meaning water emission compared hybrid electric mirai good choice vehicle cab range vehicle mile fully powered refill time minute less reaching top speed mph achievable car helped acceleration rate mph second cab london refuelling point hatton cross near heathrow hendon bit noise produced traditional electric vehicle well cost bit steep company recognise cheap operate due fewer moving part lessened maintenance hydrogen fuel cell vehicle green car green tomato utilise fleet car london toyota prius model town london air pollution nitrogen dioxide airborne particulate found lead premature death year city possibly pollution exacerbate condition emission reduction done better ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.greenoptimistic.com/hydrogen-vehicles-london-taxi/","m_Places":["London","Paris","Toyota","Hatton","In A"],"m_People":["Samantha Joe","Hendon"],"m_Companies":[],"m_BiGrams":["fuel cell","cell vehicle"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":155}
