{"m_szDocID":"589752","m_szDocTitle":"VW Buybacks, Hyundai Fuel-Cell SUV, Tesla Model S Refresh: Today's Car News","m_szYear":"2015","m_szDocSumamry":"VW Buybacks, Hyundai Fuel-Cell SUV, Tesla Model S Refresh: Today's Car News Email This Page To (separate emails with commas) Message (optional) Your email was sent successfully. Close 5,078 views Dec 30, 2015 2015 Hyundai Tucson Fuel Cell at hydrogen fueling station, Fountain Valley, CA Enlarge Photo Today, we have the potential cost of Volkswagen diesel buybacks, a possible new Hyundai fuel-cell SUV, and a rumor that the Tesla Model S electric car is due for a redesign. All this and more on Green Car Reports. Check out a teaser video of the long-range electric Volkswagen Bus concept that will","m_szDocBody":"buyback hyundai fuelcell suv tesla model refresh today car new separate email commas message optional successfully close view hyundai tucson fuel cell hydrogen fueling station fountain valley enlarge photo today potential cost volkswagen diesel buyback hyundai fuelcell suv rumour tesla model electric car due redesign green car report cheque teaser video longrange electric volkswagen bus concept debut consumer electronic show ces tesla redesign model commonize recentlyunveiled model crossover rumour redesign work green car report today enthusiastic reader vein decided designate best reader year extend grant programme green car hoping double number buyer receiving grant hyundai launch mile hydrogen fuelcell suv dedicated platform report say cost volkswagen buy back modify diesel car equipped defeat device software potentially billion report ford patent transform car unicycle finally small crossover called audi confirmed production outline released german carmaker ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.greencarreports.com/news/1101624_vw-buybacks-hyundai-fuel-cell-suv-tesla-model-s-refresh-todays-car-news","m_Places":["Ca","Reader","U.k."],"m_People":["Will Tesla"],"m_Companies":["Hyundai","Volkswagen","Diesel","Consumer Electronics Show","Audi"],"m_BiGrams":["fuelcell suv","green car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":134}
