{"m_szDocID":"589721","m_szDocTitle":"DVIDS - News - Camp Pendleton hosts energy sustainment and security discussion","m_szYear":"2015","m_szDocSumamry":"Gunnery Sgt. Evan Ahlin Ms. Christine Harada, Chief of Federal Sustainability Officer, right, receives a brief from Mr. Charles Howell, left, on renewable energy using Marine Corps Camp Pendleton’s Solar Photovoltaic System at Box Canyon, aboard Camp Pendleton, Calif., Dec. 29, 2015. The purpose of the visit was to provide the new White House Federal Chief Sustainability Officer information and background regarding Marine Corps Installations West-Marine Corps Base Camp Pendleton’s electric vehicle procurement, renewable energy, and how water sustainability programs support the Untied States Ma","m_szDocBody":"gunnery sgt evan ahlin christine harada chief federal sustainability officer right receive charle howell left renewable energy marine corp camp pendleton solar photovoltaic system box canyon aboard camp pendleton calif dec purpose visit provide white house federal chief sustainability officer information background marine corp installation westmarine corp base camp pendleton electric vehicle procurement renewable energy water sustainability programme support untied state marine corp mission readiness marine corp photo gunnery sgt evan camp pendleton calif christine harada chief sustainability officer white house toured camp pendleton review onbase energy production facility dec base energy department led harada proposed photovoltaic box canyon convert sunlight energy hydrogen refuelling station order obtain firsthand account camp pendleton energy initiative chief sustainability officer responsible overseeing sustainability initiative federal agency harada wanted taking role federal government candidly washington marine corp installation west developing photovoltaic hydrogen refuelling station improve energy security sustainability base energy security main goal mciwest due importance training operation national security important reliable continuous source energy bob gilleskie regional energy manager here megawatt photovoltaic system box canyon replace energy previously supplied base san diego gas electric mix fossil renewable energy generated locally state hydrogen refuelling station line california energy commission effort establish hydrogen infrastructure state station camp pendleton property main gate civilian use development hydrogen infrastructure promote growth fuel cell electric vehicle reduction greenhouse gase accordance state federal mandate gilleskie tour harada met brig gen edward banta commanding general mciwest briefed mciwest resource sustainability project smart energy management smart environmental stewardship crucial harada department defence manage energy effectively efficiently key mitigating risk troop there ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.dvidshub.net/news/185484/camp-pendleton-hosts-energy-sustainment-and-security-discussion","m_Places":["Marine Corps Camp Pendleton","Camp Pendleton, Calif.","Pendleton","Camp Pendleton","Harada","Washington, D.c.","San Diego","California"],"m_People":["Evan Ahlin","Christine Harada","Charles Howell","Evan P. Ahlin","Edward Banta"],"m_Companies":["Marine Corps Camp Pendleton","White House","Marine Corps","Marine Corps Base Camp","Mci","Energy Commission","Department Of Defense"],"m_BiGrams":["camp pendleton","marine corp","sustainability officer","renewable energy","box canyon","chief sustainability","hydrogen refuelling","refuelling station"],"m_TriGrams":["chief sustainability officer","hydrogen refuelling station"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,5,4,3,3,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":258}
