{"m_szDocID":"589764","m_szDocTitle":"Mechanic develops car that uses water as fuel - BT","m_szYear":"1996","m_szDocSumamry":"Diesel prices may have just dropped to under £1 a litre , but a car mechanic has created a vehicle that costs just 2p a litre to run. Mohammed Raees Markani has developed a car that doesn’t need diesel or petrol. It includes a modified engine that works using a combination of water and calcium carbide, which creates acetylene gas when combined. As well as being incredibly cheap to run, the vehicle is kinder to the environment. Markani, from Madhya Pradesh in India, spent five years developing the idea. Since he started there’s much more awareness of the advantages that environmentally friendly","m_szDocBody":"diesel price dropped litre car mechanic created vehicle cost litre run mohammed raee markani developed car doesnt diesel petrol include modified engine work combination water calcium carbide create acetylene gas combined incredibly cheap run vehicle kinder environment markani madhya pradesh india spent year developing idea started awareness advantage environmentally friendly vehicle offer car mine good alternative cost close operate environmentally friendly told mirror watch car action below company developed environmentally friendly car year stanley mayer claimed developed water fuel cell stated power car idea debunked science nature mayer died suddenly leading murdered japanese company genepax unveiled electric car run water tea company closed toyota mirai powered hydrogen emission travel mile tank markani filed patent technology reduce reliance fossil fuel change automobile industry waterfuelled car comment section below ","m_szGeo1":"India","m_szSourceType":"source_news","m_szSrcUrl":"http://home.bt.com/tech-gadgets/tech-news/the-car-that-costs-2p-a-litre-to-run-using-water-as-fuel-11364031838035","m_Places":["Madhya Pradesh","India","Toyota"],"m_People":["Mohammed Raees Markani","Stanley Mayer"],"m_Companies":["Diesel","Several Companies"],"m_BiGrams":["environmentally friendly"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":127}
