{"m_szDocID":"591622","m_szDocTitle":"Cheaper Graphene Possible, say Caltech Researchers - The Green Optimistic","m_szYear":"2015","m_szDocSumamry":"Cheaper Graphene Possible, say Caltech Researchers Benji Jerew March 23, 2015 Green News , Nanotechnology Caltech’s Dr. David Boyd and Dr. Nai-Chang Yeh, who stumbled upon a fast and cheap graphene manufacturing process. Since its official discovery just over a decade ago, graphene has taken the scientific world by storm, and scientists and researchers are just scratching the surface of possible applications in the modern and future world. Indeed, we’ve seen graphene applications in everything from electric vehicle battery packs to water purification , not to mention supercapacitors , hydrogen","m_szDocBody":"cheaper graphene possible caltech researcher benji jerew green new nanotechnology caltech david boyd naichang yeh stumbled fast cheap graphene manufacturing process official discovery decade ago graphene scientific world storm scientist researcher scratching surface application modern future world indeed weve graphene application electric vehicle battery pack water purification mention supercapacitor hydrogen fuel cell selfstoring solar power problem spite cheaper material option platinum iridium graphene ridiculously expensive researcher scratched surface graphene massproduction method well ebay graphene youll talking about single circular cutout graphenelaced paper vial graphene oxide require preparation graphene course scientist researcher pricing research add thousand dollar production hydrogen fuel cell example spite cheaper platinum example caltech california institute technology researcher pasadena california practically stumbled solution cheaper simpler graphene production currentbest graphene production method require hour step temperature requiring special equipment handle process work take minute caltech david boyd searching way simplify graphene production success middle heating copper sheet required oxidise methane source carbon atom boyd interrupted phone call phone call turn led slight overheating copper sheet formation graphene previous problem copper oxide impede growth graphene overheating unexpected phone call evaporated copper oxide allowing graphene form place building oop moment boyd experiment chemistry found process worked lower temperature previously anticipated scaled cheaper simpler graphene increased research commercialization graphenebased product ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.greenoptimistic.com/cheap-graphene-caltech/","m_Places":["Pasadena, California"],"m_People":["Benji Jerew","David Boyd","Chang Yeh","Boyd"],"m_Companies":["Indeed","Ebay","California Institute Of Technology"],"m_BiGrams":["graphene production","phone call"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":208}
