{"m_szDocID":"594167","m_szDocTitle":"Revved up for auto show - Business News - Castanet.net","m_szYear":"2009","m_szDocSumamry":"Revved up for auto show The Canadian Press - Jan 8, 2016 / 11:13 am | Story: 155805 — Automotive News (@Automotive_News) January 7, 2016 That sound of engines revving? It's coming from Detroit. The North American International Auto Show opens next week in the Motor City. Automakers will debut around 45 new production vehicles and experimental concept cars during the media preview Monday and Tuesday. Starting Jan. 16, the public can see 750 cars spread over 17 acres at Detroit's Cobo Center. The Detroit show isn't the biggest in terms of public attendance or square footage — in the U.S., those ","m_szDocBody":"revved auto show canadian press storey automotive new sound engine revving coming detroit north american international auto show open week motor city automaker debut production vehicle experimental concept car media preview tuesday starting jan public car spread acre detroit cobo centre detroit show biggest term public attendance square footage honour york chicago detroit attract media journalist country state show hot ticket ten thousand automotive engineer designer industry attendee muscle car minivan year ford acura nsx supercar stole show year humble minivan turn chrysler debut allnew minivan vehicle invented year ago flashier car too porsche debut turbo mercedesbenz show sporty slc coupe honda nissan unveil pickup truck volvo hyundai show sedan waldo detroit show floor completely year major renovation year automaker moved spot spent million flashy display show organiser plan reflect industry fiat chrysler example room stretch group luxury maker together mobile app guide visitor flash information car electronic beacon floor show brand display detroit show past attending year including tesla motor mini jaguar land rover reason change tesla generally make splash auto show preferring unveil car timeline company frosty relation michigan ban teslas retail store jaguar land rover focus luxuryoriented york los angele show mini skipping geneva show detroit returning ultraluxury brand however aston martin attended detroit show gas low gas price hurt sale electric hybrid vehicle sale electric nissan leaf dropped cent year automaker exploring alternative gaspowered vehicle partly meet higher fuel economy standard lexus show hydrogen fuel cellpowered sedan lffc detroit ford expected plugin hybrid version fusion sedan show electric chevrolet bolt mile charge sale year crowded calendar big auto show january detroit show ces gadget show las vegas automaker eager show increasing amount technology car choosing debut autonomous system dashboard electronic entire vehicle ces week year general motor debuted chevrolet bolt electric car ces volkswagen showed experimental budde electric microbus kia promised selfdriving car ford bmw announced incar app driver control home appliance voice command photo ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.castanet.net/news/Business/155805/Revved-up-for-auto-show","m_Places":["Detroit","New York","Chicago","Tesla","Michigan","Los Angeles","Geneva","Las Vegas"],"m_People":["Chrysler","Porsche","Turbo","Honda","Waldo","Budd"],"m_Companies":["Canadian Press","Automotive News","International Auto Show","Mercedes-benz","Volvo","Hyundai","Tesla Motors","Jaguar","Land Rover","Los Angeles","Aston Martin","Lf","General Motors","Volkswagen","Bmw","Twitter"],"m_BiGrams":["detroit show","auto show"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4],"m_TriCnt":[],"m_iDocBodyWordCnt":319}
