{"m_szDocID":"594165","m_szDocTitle":"Your California EV tax incentives could dry up come March - Roadshow","m_szYear":"2016","m_szDocSumamry":"Your California EV tax incentives could dry up come March Your California EV tax incentives could dry up come March The Golden State will soon roll out income-based tax incentives for partial- or full-electric vehicle ownership. Andrew Krok Cars are Andrew's jam, as is strawberry. He started his auto-industry career working as a photographer and social media coordinator for Fluid MotorUnion, a prominent aftermarket parts fabrication garage for late-model European vehicles. That led to a job writing freelance features for \"Total 911: The Porsche Magazine.\" His most recent job prior to CNET was ","m_szDocBody":"california tax incentive dry california tax incentive dry golden state roll incomebased tax incentive partial fullelectric vehicle ownership andrew krok car andrew jam strawberry started autoindustry career working photographer social media coordinator fluid motorunion prominent aftermarket part fabrication garage latemodel european vehicle led job writing freelance feature total porsche magazine recent job prior cnet senior writer webcarzcom helped tweak develop buyingandselling site editorial department bring today day buy dream day full bio california tax incentive dry share california tax incentive dry enlarge image tesla model eligible incentive price tag make unattainable great car buyer tesla tax incentive purchasing electric vehicle sound winwin advance tech saving bit coin complained however current incentive structured benefit rich shoulder additional cost california addressing concern reshuffling incentive based income state clean vehicle rebate project announced individual making year jointfiler making state incentive disappear programme kick march bracket reap benefit buying hydrogen fuelcell electric vehicle fcev lowest bracket cover time federal poverty level individual family three incentive grow each folk receive electric vehicle plugin hybrid hydrogen car person family fall value change group incentive remain plugin fcev thus reside top tier wise move purchase advantage current incentive structure tag ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cnet.com/roadshow/news/your-california-ev-tax-incentives-could-dry-up-come-march/","m_Places":["California","Sc","Tesla"],"m_People":["Andrew Krok"],"m_Companies":["Cnet"],"m_BiGrams":["tax incentive","california tax","incentive dry","electric vehicle"],"m_TriGrams":["california tax incentive","tax incentive dry"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,4,3],"m_TriCnt":[4,4],"m_iDocBodyWordCnt":193}
