{"m_szDocID":"594240","m_szDocTitle":"Concept cars in CES 2016 | Aaj News","m_szYear":"2016","m_szDocSumamry":"Home / SCI-TECH / Concept cars in CES 2016 Concept cars in CES 2016 Posted on The most iconic automobile brands showed their concept cars for future in CES 2016 are below.   A Toyota FCV Plus, a hydrogen fuel-cell concept car.   A real-time 3D map, generated by LiDAR sensors, is shown on a monitor.   A 2016 Chevrolet Volt is displayed.   LiDAR sensors are shown on the roof of a Ford Fusion Hybrid. The sensors create a real-time 3D map of the vehicle’s surroundings.   Journalists look over the 2017 Chevrolet Bolt EV. The car will have a 200-mile range and cost about $30,000, said General Motors","m_szDocBody":"home scitech concept car ces concept car ces posted iconic automobile brand showed concept car future ces below toyota fcv plus hydrogen fuelcell concept car realtime map generated lidar sensor shown monitor chevrolet volt displayed lidar sensor shown roof ford fusion hybrid sensor create realtime map vehicle surrounding journalist chevrolet bolt car mile range cost general motor chairman ceo mary barra video show battery car chassis unveiling faraday future ffzero electric concept car mercedesbenz iaa intelligent aerodynamic automobile concept car displayed ces trade show car change shape driving condition increase fuel efficiency marcus screen delphis automated vehicle show car stopping communicating stop light intersection advanced software hardware delphis vehicle communicate street sign traffic light car pedestrian company cockpit faraday future ffzero electric concept car journalist volkswagen budde electric vehicle rear faraday future ffzero electric concept car volkswagen budde electric vehicle people bmw vision future interaction concept car car include bmw airtouch technology let driver control function simple gesture faraday future ffzero electric concept car unveiled bmw vlatko kalinic demonstrate gesture control feature control radio volume bmw sedan german love latest wave touchfree car control respond flick wrist swipe hand mean messy fingerprint spotless dashboard italian extravagant hand gesture two sure germany bmw demonstrated sery car recognise simple gesture finger twirl raise music volume hand swipe decline incoming call volkswagen budde electric vehicle displayed herbert diess keynote address faraday future ffzero electric concept car shown unveiling people bmw vision future interaction concept car car include bmw airtouch technology let driver control function simple gesture volkmar tanneberger head electric electronic development volkswagen discusse feature volkswagen egolf touch electric vehicle faraday future ffzero electric concept car shown unveiling ","m_szGeo1":"Germany","m_szSourceType":"source_news","m_szSrcUrl":"http://aaj.tv/2016/01/concept-cars-in-ces-2016/","m_Places":["Toyota","Germany"],"m_People":["Mary Barra","Steve Marcus","Budd","Vlatko Kalinic","Herbert Diess","Volkmar Tanneberger"],"m_Companies":["General Motors","Mercedes-benz","Reuters","Delphi","Volkswagen","Bmw","Airtouch Technology"],"m_BiGrams":["concept car","faraday future","future ffzero","ffzero electric","electric concept","electric vehicle","volkswagen budde","budde electric","simple gesture"],"m_TriGrams":["faraday future ffzero","future ffzero electric","ffzero electric concept","electric concept car","volkswagen budde electric","budde electric vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[13,6,6,6,6,4,3,3,3],"m_TriCnt":[6,6,6,6,3,3],"m_iDocBodyWordCnt":275}
