{"m_szDocID":"594244","m_szDocTitle":"GM's 2017 Chevy Bolt Poses Huge Threat to Tesla (TSLA) | InvestorPlace","m_szYear":"2016","m_szDocSumamry":"View All Posts I’ll start by saying this — there is no company in the world like Tesla Motors Inc ( TSLA ). It’s truly in a league of its own. No one makes sexy, sleek, safe electric cars like Elon Musk and his army of futurist nerds. But even that can’t keep crusty old auto industry codger General Motors ( GM ) from throwing its weight around the market. It can, and it is. General Motor’s 2017 Chevy Bolt, officially unveiled at the Consumer Electronics Show , plans to beat Tesla to the punch in one incredibly important respect — mass-production at an affordable price. That’s what the Tesla Mo","m_szDocBody":"post ill start company world tesla motor tsla league own make sexy sleek safe electric car elon musk army futurist nerd crusty auto industry codger general motor throwing weight aroundthe market can general motor chevy bolt officially unveiled consumer electronic show plan beat teslato punch incredibly important respect massproduction affordable price tesla model supposed company holy grail stock buy teslas infamous tendency sufferproduction delay long year cost companyit firstmover advantage chevy bolt hell aint tesla meaningful piece market share shouldve rightfully ceded model imagine frustrating musk teslas sleep deprived founder ceo phrase aptly describing dilemma simply snooze lose buzz bolt ces chevy unveiled bolt concept car year attendee production version tax incentive chevy bolt retail present obvious threat tsla pricing side thetesla model cost range difference price sway teslas flagship product future biggest reason chevy bolt bea massive headache tesla tsla stock owner release date chevy bolt year tesla model unveiled year musk wont released late teslas notoriously inaccurate release date guidance past fact chevy bolt mile charge pretty good evs hightech inch tabletlike display featuring functionality apple aapl carplay android autoand goog googl map chevy bolt wont destroy tesla built strong luxury brand itself day isnt market competitor chip advantage car running hydrogen fuel cell technology hitting market now make teslas gigafactory massive battery plant running massproduced tesla model finally launch important part tsla storey now competitor chevy bolt arent stopappearing how construction coming writing john divine long aapl stock follow investorplace ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://investorplace.com/2016/01/tsla-2017-chevy-bolt-tesla/","m_Places":["Tesla"],"m_People":["Elon","Chevy Bolt","John Divine"],"m_Companies":["Tesla Motors Inc","General Motors","Gm","Consumer Electronics Show","Apple","Aapl","Google","Twitter"],"m_BiGrams":["chevy bolt","tesla model"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,3],"m_TriCnt":[],"m_iDocBodyWordCnt":243}
