{"m_szDocID":"596162","m_szDocTitle":"Green Cars | Chronicle  - WCVB Home","m_szYear":"2016","m_szDocSumamry":"Green Cars Advertising Video Transcript THIS IS \"CHRONICLE\" ON WCVB CHANNEL FIVE. ED: AT THIS WII'S AUTO SHOW, GREEN IS IN. ALSO TONIGHT, HAVE YOU SEEN THE LINES AT PEPE 'S PIZZA? HEARD THE STORY OF THE COAST GUARD PUSHED FINEST HOURS? KNOW THE BOMBSHELL ELIZA DUSHKU'S DROPPING? PLUS, A FAVORITE FAMILY PLAYGROUND GETS A MAKEOVER. IT'S WHAT'S NEW FOR JANUARY, NEXT ON \"CHRONICLE.\" J.C.: GOOD EVENING, EVERYONE. THE NEW ENGLAND INTERNATIONAL AUTO SHOW IS UNDERWAY AT THE BOSTON EXHIBITION CENTER. HUNDREDS OF VEHICLES ARE ON DISPLAY THROUGH MONDAY, WITH THE NEW CLASS OF GREEN CARS LEADING THE PACK. ","m_szDocBody":"green car advertising video transcript chronicle wcvb channel five wiis auto show green tonight line pepe pizza heard storey coast guard pushed finest hour bombshell eliza dushkus dropping plus favourite family playground makeover january chronicle good evening everyone england international auto show underway boston exhibition centre hundred vehicle display monday class green car leading pack monahan decided spin bmw golf swing door twoseater hottest vehicle year auto show call excitement electric front wheel powered electricity rear wheel powered gasoline called hybrid plugin run electricity speedometer hit mile hour torque car incredible acceleration phenomenal people lose oomph electric close fastest car bmw make hybrid compromise enhancement lot case performance acceleration class green technology car featured auto show traditional hybrid fully electric car fuel cell hydrogen car toyota case sold start buying bmw technology geek people mit harvard architect hear reporter anchor you first good new test drive free button this manual really sweet ride head turner too earthbound plugin hybrid make special plugin uncle step completely emission vehicle price tag everybody hyundai play people discriminating good quality vehicle extra technology lower price tag interested car green tech prominent future massachusett thousand emission electric vehicle road carbon regulation require road green technology auto market toyota prius enduring hybrid suv green really biggest storey vehicle price people paying premium hybrid now price difference gas hybrid hybrid technology crossing kind model option newest green technology hydrogen fuelcell vehicle ambient air combined hydrogen produce electricity run car water tailpipe emitting water hydrogen clear advantage option wire back trunk plug power run home yes true massachusett hydrogen coalition tell hydrogen fuel cell car generate approximately kilowatt energy power average home week drawback now hydrogen filling station massachusett car yourself auto show run monday next line chevron hill related popular ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.wcvb.com/chronicle/green-cars/37445064","m_Places":["Boston Exhibition Center","Take","Toyota","Turner","Massachusetts","Hills"],"m_People":["Pepe","Eliza Dushku","Monahan","Architects"],"m_Companies":["Wcvb","Channel Five","Coast Guard","International Auto Show","Torque","I3","Bmw","M.i.t.","Good News","Hyundai","Chevron"],"m_BiGrams":["auto show","green technology"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3],"m_TriCnt":[],"m_iDocBodyWordCnt":293}
