{"m_szDocID":"596133","m_szDocTitle":"W.Va. International Auto Show roars into Charleston - Logan Banner - loganbanner.com","m_szYear":"2016","m_szDocSumamry":"W.Va. International Auto Show roars into Charleston First Posted: 1:33 am - January 15th, 2016 Staff Report Tweet CHARLESTON — The West Virginia International Auto Show is set to take over the city with hundreds of new model vehicles Friday Jan. 22 through Sunday Jan. 24. Follow the highway carpet through the Charleston Civic Center for an up-close look at the latest cars, crossovers, SUVs, trucks and all that is new in the automotive world. From Jeep to Jaguar, the auto show will feature the latest options in showrooms, as well as test drives, alternative fuel options, fun for the little ones","m_szDocBody":"wva international auto show roar charleston posted staff report tweet charleston west virginia international auto show set city hundred model vehicle jan jan follow highway carpet charleston civic centre upclose latest car crossover suvs truck automotive world jeep jaguar auto show feature latest option showroom test drive alternative fuel option fun more innovative safety feature savvy connectivity option manufacturer abundance showcase year including apple carplay west virginia automobile truck dealer president ruth lemmon gas price truck hot including ford super duty nissan titan toyota tacoma chevrolet colorado auto show perfect place learn cheque option manufacturer day auto show transform civic centre auto mecca offering consumer chance compare hundred model side side roof place attendee sit driver seat inspect engine kick tyre count cup holder cheque trunk space test drive vehicle car smell model set turn head show floor include honda civic sedan buick cascada chevrolet camaro subaru wrx volvo more showgoer luxury head luxury loft latest highend option audi bmw cadillac lexus lincoln green auto show learn variety fuel saving option driver gaselectric hybrid plugin electric vehicle auto show place question latest alternative fuel choice including toyota mirai hydrogen fuel cell vehicle hybridelectric chevrolet volt plugin electric mitsubishu imiev plugin hybrid ford cmax energi hybrid option driver invited auto show experience show floor road wheel allnew ford explorer edge focus fusion ford ride drive show day additionally toyota drive centre toyota camry highlander rav tacoma test drive saturday sunday invited enjoy close encounter west virginia state police ford taurus ford explorer talk law enforcement officer auto show cheque unique display show day courtesy west virginia state police fan favourite car club west virginia showcase return auto show special collection classic gem vintage ride state dont miss timeless treasure courtesy west virginia motorsport council what dream ride sweepstake return auto show showgoer encouraged snap selfie dream car auto show post facebook instagram #wvautoshow participant automatically entered win gift card family day sunday children younger admitted free accompanied paying adult special day family invited cheque latest row option minivan crossover enjoy fun interactive entertainment one west virginia international auto show open public friday sunday charleston civic centre located civic centre drive charleston show hour saturday sunday admission adult senior citizen older military dod children age children admitted free accompanied adult attendee receive free oneyear subscription motor trend magazine online box office purchase additional information visit follow instagram hashtag #westvaautoshow staff report ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://loganbanner.com/news/4967/w-va-international-auto-show-roars-into-charleston","m_Places":["W.va. International Auto Show","Charleston","West Virginia","Lincoln","Toyota","Toyota Drive Center","Tacoma","Id"],"m_People":["Sunday Jan","Ruth Lemmon","Buick","Drivers","Ford Cmax Energi"],"m_Companies":["International Auto Show","Civic Center","Jaguar","Apple","Truck Dealers Association President","Audi","Bmw","Cadillac","Highlander","Police","Facebook","Twitter","200 Civic Center Drive","Motor Trend"],"m_BiGrams":["auto show","west virginia","civic centre","international auto","test drive"],"m_TriGrams":["international auto show"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[13,7,4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":399}
