{"m_szDocID":"596269","m_szDocTitle":"Toyota Tells Dealers: Stop Mirai Deliveries! - Gas 2","m_szYear":"2016","m_szDocSumamry":"Toyota Tells Dealers: Stop Mirai Deliveries! January 15th, 2016 by Steve Hanley     More than any other car maker, Toyota has been a strong advocate for fuel cell powered cars. What is an FCEV? It’s an electric car that does not use a battery as its main source of power. Instead it has a fuel cell that converts liquid hydrogen into electricity, which is then used to turn an electric motor. The Mirai has a tiny 1 kWh battery to help out when demand for electricity is greater than the fuel cell can provide. The beauty of the whole hydrogen scenario is that emissions consist of nothing more than ","m_szDocBody":"toyota tell dealer stop mirai delivery steve hanley car maker toyota strong advocate fuel cell powered car fcev electric car battery main source power fuel cell convert liquid hydrogen electricity turn electric motor mirai tiny kwh battery demand electricity greater fuel cell provide beauty hydrogen scenario emission consist water vapour heat greener that you toyota invested billion develop fuel cell car mirai toyota expect deliver total car united state europe compared global automobile market million vehicle infinitesimal amount fly speck really toyota convinced hydrogen power future considerable urging japanese government bet virtually company entire future company hydrogen power nagoya problem inside evs jim lentz ceo toyota north america instructed dealer handle car includingit highest volume dealer located santa monica california stop delivering car customer why arent hydrogen refuelling station mirai sedan road exist dont work well either toyota advertising mirai carry slogan let place now precious place mirai driver stopsale asked the dealer make delivery station open lentz told press detroit auto showthere fewer station preferred now california energy commission projected hydrogen station open state end instead fiveand service time issue pumping hydrogen result toyota hastily instal temporary refuelling station meet demand mirai driver fill hydrogen tank board car half driver make appointment hydrogen left driver mile range agonising process again zipping quick fill toyota promised pretty confident end year growing pain lentz say doesnt foot bill station hydrogen refuelling station cost million construct clearly toyota expect taxpayer california pony money needed build more toyota left hydrogen fueled car homely mailman behind irish grandmother say mile half tank fuel require driver show scheduled slower battery electric car handling prowess hudson what like taxpayer california sense toyota build damn refuelling station tesla building supercharger network year now world run hydrogen power now wrong technology wrong time wrong price ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://gas2.org/2016/01/15/toyota-tells-dealers-stop-mirai-deliveries/","m_Places":["Toyota","United States","Europe","Nagoya","North America","California","Detroit","Tesla"],"m_People":["Steve Hanley","Jim Lentz","Santa Monica","Lentz"],"m_Companies":["Energy Commission"],"m_BiGrams":["fuel cell","refuelling station","hydrogen power"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":297}
