{"m_szDocID":"596273","m_szDocTitle":"Mercedes-Benz GLC Confirmed with Hydrogen Fuel Cell for 2017","m_szYear":"2016","m_szDocSumamry":"Mercedes-Benz GLC Confirmed with Hydrogen Fuel Cell for 2017 ⌖ A- A+ Mercedes-Benz is set to launch a hydrogen fuel cell version of its GLC crossover sometime in 2017. The eco-friendly GLC-Class is expected to have a range of around 300 miles (approx. 500 km) and will be fitted with the latest in fuel cell technology available on the market. The news comes straight from Thomas Weber, the head of Mercedes-Benz's Research&Development department. The future fuel cell version of the GLC will benefit from an advanced set of modular components. The specified technical solution was developed to ensur","m_szDocBody":"mercedesbenz glc confirmed hydrogen fuel cell mercedesbenz set launch hydrogen fuel cell version glc crossover ecofriendly glcclass expected range mile approx fitted latest fuel cell technology market new straight thomas weber head mercedesbenzs research&development department future fuel cell version glc benefit advanced set modular component technical solution developed ensure compatibility part pure electric vehicle fuel cell vehicle upcoming model called glc fcell fuel cell component mounted hood hydrogen tank battery space reserved fuel tank therefore passenger compartment trunk lose space choosing solution bring multiple advantage manufacturer reduce production development cost making technology cheaper future similar solution utilised world internal combustion engine long time manufacturer volkswagen competitor recently turned modular platform costeffective solution bring risk carmaker wrong production development phase shared component vehicle eventually fixed recall main advantage solution bringing affordable electric fuel cell vehicle market risk worth carmaker interview brit autocar weber revealed car middle rollout phase furthermore engineer mercedesbenz accomplished advancement developing german brand mass market production electric vehicle company share electric fuel cell vehicle past year car sale traditional kind way restricted leasing programme ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.autoevolution.com/news/mercedes-benz-glc-confirmed-with-hydrogen-fuel-cell-for-2017-103702.html","m_Places":[],"m_People":["Thomas Weber"],"m_Companies":["Mercedes-benz","Volkswagen Group","Autocar"],"m_BiGrams":["fuel cell","cell vehicle"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":176}
