{"m_szDocID":"596233","m_szDocTitle":"The Zacks Analyst Blog Highlights: Honda Motor, General Motors, Tesla Motors and Ford Motor - NASDAQ.com","m_szYear":"2016","m_szDocSumamry":"The Zacks Analyst Blog Highlights: Honda Motor, General Motors, Tesla Motors and Ford Motor January 13, 2016, 09:30:00 AM EDT By Zacks Equity Research, Zacks.com Shutterstock photo For Immediate Release Chicago, IL - January 13, 2016 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include Honda Motor Co., Ltd. ( HMC ), General Motors Co. ( GM ), Tesla Motors, Inc. ( TSLA ) and Ford Motor Co. ( F ). Today, Zacks i","m_szDocBody":"zack analyst blog highlight honda motor general motor tesla motor ford motor edt zack equity research zackscom shutterstock photo release chicago zackscom announce list stock featured analyst blog day zack equity research analyst discuss latest new event impacting stock financial market stock recently featured blog include honda motor ltd hmc general motor tesla motor inc tsla ford motor today zack promoting buy stock recommendation #stock day pick free highlight tuesday analyst blog attractive launches detroit auto show north american international auto show expected witness vehicle launches latest edition popular annual auto show detroit auto show opened announcement honda motor ltd hmc civic car year volvos suv truck year then stream spectacular vehicle display followed fiat chrysler automobile showcased pacifica general motor displayed chevrolet cruze cruze hatchback discussed latest crash avoidance technology vehicle muchawaited chevrolet bolt featured show automaker elucidated battery power train technology bolt offer kilowatthour battery pack mile range horsepower mph acceleration second expected offer stiff competition tesla motor inc tsla yettobelaunched eagerly awaited model general motor buick brand introduced avista horsepower rear wheel drive coupe concept vehicle featuring litre twinturbo engine buick envision suv imported market china displayed show honda unveiled ridgeline fiveseat fourdoor pickup truck litre sixcylinder engine company announced hoping bring plugin hybrid vehicle north american market company ceo stated honda contemplating development pure electric vehicle addition fuel cell car order meet strict fuel economy requirement ford motor introduced lineup ford fusion vehicle including fusion sport fusion platinum fusion hybrid fusion energi plugin hybrid automaker launched allnew raptor supercrew sold canada fall further ford announced fordpass app member daily mobility need finding paying parking borrowing sharing vehicle scheduling maintenance service appointment latest recommendation zack investment research today download stock day free report zack equity research zack equity research quantitative qualitative analysis investor stock buy sell longterm continuous coverage provided universe publicly traded stock analyst organised industry keen insight development affect company profit stock performance recommendation target price sixmonth time horizon zack profit pros newsletter highlight latest analysis zack equity research free newsletter today happening stock market today zackscom latest recommendation zack investment research today download stock day free report ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-honda-motor-general-motors-tesla-motors-and-ford-motor-cm565182","m_Places":["Chicago, Il","Detroit","Pacifica","Canada"],"m_People":["Honda","Cruze"],"m_Companies":["General Motors","Tesla Motors","Ford Motor","Honda Motor Co","Hmc","Tesla Motors, Inc.","Tsla","Ford Motor Co","International Auto Show","Volvo","Fiat Chrysler Automobiles N.v. Showcased","Pacifica","Avista","Seat","Zacks Investment Research","Target"],"m_BiGrams":["zack equity","equity research","general motor","auto show","analyst blog","honda motor","tesla motor","ford motor"],"m_TriGrams":["zack equity research"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,5,4,4,3,3,3,3],"m_TriCnt":[5],"m_iDocBodyWordCnt":353}
