{"m_szDocID":"596216","m_szDocTitle":"Hydrogen-powered GLC SUV to lead Mercedes electric car range | Auto Express","m_szYear":"2016","m_szDocSumamry":"Hydrogen-powered GLC SUV to lead Mercedes electric car range Search email A new modular platform will be the basis for a whole range of electric and hydrogen Mercedes cars Mercedes new GLC SUV will get hydrogen power next year, leading the way for a whole range of models that will share electric technology from a new modular platform. Prof. Dr. Thomas Weber, Mercedes’ research and development boss, told Auto Express, “Our research is behind us and we are in the middle of the roll-out of the next phase. • Mercedes GLC 220d review “We decided to do a series production of a full-electric fuel cel","m_szDocBody":"hydrogenpowered glc suv lead mercede electric car range modular platform basis range electric hydrogen mercede car mercede glc suv hydrogen power year leading range model share electric technology modular platform prof thomas weber mercede research development boss told auto express research middle rollout phase mercede glc review decided sery production fullelectric fuel cell vehicle market launch year fuel cellpowered vehicle suv based glc newest fuel cell technology integral part electro mobility modular componentry setup meantime help development fullelectric battery power vehicle well range common component battery battery management system modular share component synergy volume side reduce cost push fuel cell topic mercede ceo dieter zetsche confirmed company plan telling relevant volume see today longer range battery electric vehicle imagining year ago charging time diminished significantly electric car sale benefit environment real relative position hydrogenpowered electric car versus battery electric car deteriorated past year doesnt end day continue date technology concerned zetsche mercede launch plugin car fullelectric vehicle time scale sync main competitor audi expected launch tesla rival year wed expect fullyelectric production mercede arrive couple year meanwhile zetsche keeping close eye company apple car maker rival future referred frenemy saying collaborator competitor agile ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.autoexpress.co.uk/mercedes/glc/94020/hydrogen-powered-glc-suv-to-lead-mercedes-electric-car-range","m_Places":["Tesla"],"m_People":["Mercedes","Thomas Weber","Dieter Zetsche","Zetsche","Audi"],"m_Companies":["Apple","Google"],"m_BiGrams":["electric car","fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":193}
