{"m_szDocID":"597927","m_szDocTitle":"UofL lithium-oxygen battery research opening door for long-range electric cars","m_szYear":"2016","m_szDocSumamry":"UofL lithium-oxygen battery research opening door for long-range electric cars Developing renewable energy sources to power vehicles Developing renewable energy sources to power vehicles LOUISVILLE, Ky. (Jan. 21, 2016) — Researchers at the University of Louisville’s Conn Center for Renewable Energy Research are developing science to power cars hundreds—or even thousands—of miles through renewable energy sources that don’t require gasoline. Researchers are undertaking a wide range of renewable energy research challenges, including those aimed at developing new energy storage systems for vehicle","m_szDocBody":"uofl lithiumoxygen battery research opening door longrange electric car developing renewable energy source power vehicle developing renewable energy source power vehicle louisville jan researcher university louisville conn centre renewable energy research developing science power car hundredsor thousandsof mile renewable energy source dont require gasoline researcher undertaking wide range renewable energy research challenge including aimed developing energy storage system vehicle guzzler nonrenewable energy conn centre postdoctoral researcher bijandra kumar work energy storage solar fuel sunlight split water hydrogen production carbon dioxidetoliquified fuel conversion author prestigious magazine nature titled lithiumoxygen battery based lithium superoxide published month manuscript detail work lithiumoxygen liair battery oxygen consumed discharging process released charging process cathode negatively charged battery electrode theoretically liair battery close energy density gasoline breakthrough field liair battery time reversible formation decomposition lithium superoxide lio lithium peroxide lio reported liair battery potential providing time energy density lithium ion battery chemistry featured rechargeable product development efficient renewable energy system promise generation kumar say manufacturing battery produce energy run hundred mile recharging goal scientist world part effort reduce reliance fossil fuel inexpensive catalyst make lithium superoxide pave major breakthrough battery manufacturing conn centre working direction join discussion ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.lanereport.com/59313/2016/01/uofl-lithium-oxygen-battery-research-opening-door-for-long-range-electric-cars/","m_Places":["Louisville, Ky."],"m_People":["Bijandra Kumar"],"m_Companies":["University Of Louisville"],"m_BiGrams":["renewable energy","liair battery","energy source","conn centre","lithium superoxide"],"m_TriGrams":["renewable energy source"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":190}
