{"m_szDocID":"597975","m_szDocTitle":"Hyundai ix35 Fuel Cell: Hydrogen Power For The Masses","m_szYear":"2014","m_szDocSumamry":"Hyundai ix35 Fuel Cell: Hydrogen Power For The Masses posted 5 days ago Hyundai ix35 Fuel Cell: Hydrogen Power For The Masses Here's a simple explanation to how hydrogen vehicles work, particularly the IX35, and why they're the way forward... Why Hydrogen? The Hyundai ix35 Fuel Cell is the hydrogen powered version of the manufacturer's crossover vehicle and represents the future of motoring. But why? In contrast to fossil fuels such as petrol and diesel – the manufacturer explains – the supply of hydrogen is abundant as it makes-up 75% of the universe. Furthermore, its consumption does not pro","m_szDocBody":"hyundai fuel cell hydrogen power masse posted day ago hyundai fuel cell hydrogen power masse simple explanation hydrogen vehicle work forward hydrogen hyundai fuel cell hydrogen powered version manufacturer crossover vehicle represent future motoring why contrast fossil fuel petrol diesel manufacturer explain supply hydrogen abundant makesup universe furthermore consumption produce pollutant carbon monoxide harm environment public health output tailpipe water vapour fact strength suggest car nature popular future work hyundai fuel cell incorporate highpressure tank store fuel hydrogen handful outlet follow unlike electric vehicle pluggedin charged time refuelling crossover class vehicle take minute pressing throttle pump hydrogen fuel cell mixed air chemical reaction produce electricity power electric motor this turn spin wheel road futuristic workhorse feel electric vehicle easy drive special skill required word power range hyundai fuel cell produce mph take second top speed mph maximum range mile unlike electric model comparable motor reliably start temperature low celsius award fuel cell recently won innovation award scottish car year award alisdair suttie scottish motoring writer president explained winner category manufacturer renowned forward thinking hyundai fuel cell normalise hydrogen power bodystyle marque bestseller scotland hyundai deserve credit bringing fuel cell car road promote what increasingly achieve emission limiting driving range robin hayle special vehicle manager hyundai motor added hyundai developing technology arrival massproduction fuel cell vehicle additionally year officially private fleet customer purchase one hyundai fuel cell price start road brochure ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.motoring.co.uk/car-news/hyundai-ix35-fuel-cell-hydrogen-power-for-the-masses_67211","m_Places":["Scotland","Uk"],"m_People":["Robin Hayles"],"m_Companies":["Hyundai","Diesel"],"m_BiGrams":["fuel cell","hyundai fuel","cell hydrogen","hydrogen power"],"m_TriGrams":["hyundai fuel cell","fuel cell hydrogen"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[11,7,3,3],"m_TriCnt":[7,3],"m_iDocBodyWordCnt":230}
