{"m_szDocID":"598026","m_szDocTitle":"Toyota Hawaii brings 2016 Mirai production cars to state - Hawaii News Now - KGMB and KHNL","m_szYear":"2016","m_szDocSumamry":"Toyota Hawaii brings 2016 Mirai production cars to state - Hawaii News Now - KGMB and KHNL Member Center: Toyota Hawaii brings 2016 Mirai production cars to state Posted: Updated: HONOLULU (HawaiiNewsNow) - Toyota Hawaii has brought the first Mirai production vehicles to Oahu. Hawaii is the second state after California to receive the Mirai, Toyota’s first hydrogen-powered fuel cell vehicle (FCV). The Mirai launched in October in California. “FCVs like the Mirai truly represent the future,” said Rick Ching, president of Servco Automotive. “The Mirai is the ultimate clean car – it emits nothing","m_szDocBody":"toyota hawaii bring mirai production car state hawaii new kgmb khnl member centre toyota hawaii bring mirai production car state posted updated honolulu hawaiinewsnow toyota hawaii brought mirai production vehicle oahu hawaii state california receive mirai toyotas hydrogenpowered fuel cell vehicle fcv mirai launched california fcvs mirai represent future rick ching president servco automotive mirai ultimate clean car emit water fuel produced locally renewable energy decreasing dependence foreign oil toyota leading industry developing fcvs servco proud bring technology hawaii camrysized mirai fcv sedan electric motor powered hydrogen stored car tank mixed oxygen air intake grille air enter car fuel stack front grille combine hydrogen storage tank create electricity power car electric motor battery mirais emission water produce cup mile driven driving range mile triple range electric vehicle comparable gasolinepowered sedan refuel minute compared typical electric vehicle charging time hour safety reliability top priority designing mirai toyota developed tested fuel cell technology year research development prototype undergone million mile road track evaluation rigorous inhouse safety testing mile extreme climate testing msrp mirai applicable state federal tax credit mirai limited sale year early information toyota mirai visit ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.hawaiinewsnow.com/story/31003350/toyota-hawaii-brings-2016-mirai-production-cars-to-state","m_Places":["Toyota Hawaii","Hawaii","Honolulu","Oahu","California","Toyota"],"m_People":["Rick Ching","Mirai Fcv"],"m_Companies":[],"m_BiGrams":["toyota hawaii","mirai production"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":185}
