{"m_szDocID":"598055","m_szDocTitle":"Fiat's loss selling EVs in 2015? $84 million","m_szYear":"2016","m_szDocSumamry":"Fiat's loss selling EVs in 2015? $84 million Fiat's loss selling EVs in 2015? $84 million   Automotive News January 25, 2016 - 12:01 am ET Among the 25,084 Fiat 500s sold in the United States in 2015 were at least 6,000 battery-electric 500e cars sold in California and parts of Oregon to meet state environmental mandates. Here's the thing. In 2014, Fiat Chrysler CEO Sergio Marchionne said the company loses about $14,000 on each 500e it sells. If that's right it means Fiat lost about $84 million in 2015 selling the 500e. Fiat doesn't report sales of the 500e separately, but the figure was menti","m_szDocBody":"fiat loss selling evs million fiat loss selling evs million automotive new fiat sold united state batteryelectric car sold california part oregon meet state environmental mandate thing fiat chrysler ceo sergio marchionne company lose sell mean fiat lost million selling fiat report sale separately mentioned tim kuniskis head fiat chrysler passenger car brand state rebate data compiled online newsletter inside evs track monthly sale electric vehicle corroborate sale figure course moneylosing sale accumulate valuable credit automaker adhere tightening fuel economy emission standard california require large automaker derive share vehicle sale state zeroemission vehicle plugin hybrid credit californias standard percent car sold state tailpipe emission definition met allelectric car hydrogen fuel cell vehicle toyota mirai asked month fca lose money sale planned chrysler pacifica plugin hybrid due year marchionne direct answer hell reach larry vellequette ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.autonews.com/article/20160125/OEM05/301259959/fiats-loss-selling-evs-in-2015-84-million","m_Places":["United States","California","Oregon","Toyota"],"m_People":["Sergio Marchionne","Tim Kuniskis","Chrysler","Larry P. Vellequette"],"m_Companies":["Automotive News"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":134}
