{"m_szDocID":"598049","m_szDocTitle":"How hydrogen-powered cars work - Tech Insider","m_szYear":"2016","m_szDocSumamry":"Toyota The Toyota Mirai. The hydrogen-powered car business is set to grow. Honda just announced Thursday that it will begin selling its hydrogen-powered sedan, the Honda Clarity , by the end of 2016. But it's not the only automaker making cars with the hydrogen fuel cell technology — Lexus showed off its hydrogen-powered LF-LC concept car at the Detroit Auto Show earlier in January, and Audi also showed a hydrogen-powered car with a 372-mile range at the same auto show. And then there's Toyota, which has been working on hydrogen-powered cars the longest at 23 years. As of January 14, Toyota ha","m_szDocBody":"toyota toyota mirai hydrogenpowered car business set grow honda announced begin selling hydrogenpowered sedan honda clarity end automaker making car hydrogen fuel cell technology lexus showed hydrogenpowered lflc concept car detroit auto show earlier january audi showed hydrogenpowered car mile range auto show toyota working hydrogenpowered car longest year toyota sold hydrogenpowered car mirai california breakdown car work work hydrogenpowered car electric vehicle capable making electricitycraig scott national advanced technology manager toyota told tech insider plugin hydrogen car electric motor however difference ly motoris powered battery power engine traditional electric car fuel cell stack generate electricity power motor hydrogen car europe stack generate power engine fusing pressurised hydrogen stored tank oxygen air process electricity created released power motor drive car water vapour created released waste product hydrogen powered car battery pack however battery smaller battery pack traditional evs primary propulsion instead battery pack car higher performance demand accelerating battery charged differently hydrogen powered car primary battery pack refuelled byregenerative braking mean battery kinetic energy created car brake recharge ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.techinsider.io/how-hydrogen-powered-cars-work-2016-1","m_Places":["Toyota","Detroit","California","Europe"],"m_People":["Lc","Audi","Craig Scott"],"m_Companies":["Honda","Lf","Youtube"],"m_BiGrams":["hydrogenpowered car","battery pack"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4],"m_TriCnt":[],"m_iDocBodyWordCnt":168}
