{"m_szDocID":"598045","m_szDocTitle":"Tesla Goes to Court, Clarity FCV Priced, GM Launches Maven T.E.N. Future Car News 22 January, 2016 | Transport Evolved","m_szYear":"2016","m_szDocSumamry":"Tesla Goes to Court, Clarity FCV Priced, GM Launches Maven T.E.N. Future Car News 22 January, 2016 Nikki Gordon-Bloomfield Self-confessed geek and mother of two, Nikki has been talking and writing about cars ever since she passed her driving test. Back then, her Internet contributions were all classic car-focused. Now, she’s all about greener, cleaner, safer and smarter cars. Print Tags BMW BMW i3 Chevrolet Bolt Chevrolet Volt Electric Car General Motors honda Hydrogen fuel cell car Maven Nissan Plug-in Car Welcome to T.E.N! Short for Transport Evolved News, T.E.N. is recorded every Friday to ","m_szDocBody":"tesla court clarity fcv priced launches maven ten future car new january nikki gordonbloomfield selfconfessed geek mother two nikki talking writing car passed driving test back then internet contribution classic carfocused now shes greener cleaner safer smarter car print tag bmw bmw chevrolet bolt chevrolet volt electric car general motor honda hydrogen fuel cell car maven nissan plugin car ten short transport evolved new ten recorded weekend flying start making havent missed big future transport new storey week weekly show future car future car technology week new about tesla model court case honda make fuel cell launches maven mobility app bmw integrate ifttt renault patch european noncompliant diesel car nissan confirm production nextgen leaf battery cell honda price clarity fcv dakar electric rally car posting entire show below including link individual storey show weve added clickable link version show youre subscribing podcast version link description inside episode youll version show include embedded subtitle track ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"https://transportevolved.com/2016/01/22/tesla-goes-to-court-clarity-fcv-priced-gm-launches-maven-t-e-n-future-car-news-22-january-2016/","m_Places":["Tesla","Uk","Dakar"],"m_People":["Fcv Priced","Nikki Gordon","Honda"],"m_Companies":["Print","Bmw","I3","General Motors","Renault","Diesel","Youtube"],"m_BiGrams":["future car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":154}
