{"m_szDocID":"599846","m_szDocTitle":"Going electric | Woodstock Sentinel Review","m_szYear":"2016","m_szDocSumamry":"Leading up to the Future Oxford Expo on Jan. 28, the Woodstock Sentinel-Review will be speaking with each of the expo’s speakers to talk about what they will be discussing at the sustainability event. ------- The head of a national transit research group said it's clear that the country's transit needs an overhaul and an injection of innovation. “Most Canadians…know our systems need improvement,” said Josipa Petrunic, executive director of the Canadian Urban Transit Research and Innovation Consortium. “They need to be faster. They need to be more efficient. They need to pollute less. They need","m_szDocBody":"leading future oxford expo jan woodstock sentinelreview speaking expos speaker talk discussing sustainability event head national transit research clear country transit overhaul injection innovation canadiansknow system improvement josipa petrunic executive director canadian urban transit research innovation consortium faster efficient pollute less communicative digitally connected easier people use said petrunic speaking future oxford expo jan sharing innovative movement change face transportation community oxford beyond ill speaking primarily manufacturing job creation opportunity electric vehicle manufacturing ontario petrunic said company tesla nissan nissan leaf tend dominate discussion electric vehicle petrunic manufacturer credit deserve toyota real leading force space canada automotive manufacturer manufacture call electric electrified vehicle ontario said lexus hybrid option recently allelectric rav toyota working innovative option consumer knowledge feeding what future allelectric hydrogen fuel cell electric hybrid probably petrunic said world innovative mass manufacturing car company electric vehicle toyota added car company lot small midsize enterprise supply company manufacture power electronic transmission system lightweight system lot highly relevant electric vehicle make light make efficient said push standard lower emission driving shift canada petrunic said movement daily commuter innovation public transit said electric bus cost million compared diesel bus benefit huge petrunic argued lack pollution electric buse quiet comfortable require maintenance lower operational cost buy diesel create massive saving result lower fare said petrunic recognise municipality money overhaul transportation system organisation calling provincial national strategy oxford perfect region play role reason petrunic impressed county said community heartland innovation heartland manufacturing and political will ethos desire advance nextgeneration technology ","m_szGeo1":"Canada","m_szSourceType":"source_news","m_szSrcUrl":"http://www.woodstocksentinelreview.com/2016/01/26/canadian-urban-transit-research-and-innovation-consortium-executive-director-josipa-petrunic-to-speak-about-electric-vehicle-landscape-at-future-oxford-expo","m_Places":["Oxford","Woodstock","Ontario","Tesla","Toyota","Canada"],"m_People":[],"m_Companies":["Diesel"],"m_BiGrams":["electric vehicle","petrunic said"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":246}
