{"m_szDocID":"599866","m_szDocTitle":"Column: So, what happened to all those electric cars? | Suffolk Times","m_szYear":"2016","m_szDocSumamry":"Column: So, what happened to all those electric cars? Tweet The documentary “Who Killed the Electric Car?” premiered at the Sundance Film Festival in 2006. The film, which received multiple award nominations and was widely watched, explores the demise of General Motors’ EV-1, a vehicle that ran purely on electricity and produced no emissions.  The cars first appeared on California roads in 1996. Twenty years have now passed and a decade since the film premiered. The question remains. Where are electric cars? I bought a brand-new Hyundai Elantra in 2008. At the time, with gas prices soaring, so","m_szDocBody":"column happened electric car tweet documentary killed electric car premiered sundance film festival film received multiple award nomination widely watched explore demise general motor vehicle ran purely electricity produced emission car appeared california road twenty year passed decade film premiered question remain electric car bought brandnew hyundai elantra time gas price soaring conversation buying car centred gas mileage mile gallon get elantra modest entrylevel gaspowered compact fit budget provided kind fuel efficiency needed spectacular good count fillup week imagined time bought car standard fuel efficiency dramatically improved lowerend car electric car presumed future year later market electric car appear minimal afterthought auto maker dealership visit auto company website good luck finding electric vehicle hybrid prominently advertised overwhelming consensus scientist effect climate change appear dangerous path electrician jersey turned seminar riverhead discuss future electric car bob dunigan coowner schwing electrical supply hosted seminar riverhead polish hall dunigan spoke demand expected electrician needed coming year instal charging station accommodate flood electric car hitting local road dunigan live riverhead company store located hoped front trend hasnt played thought would dunigan interview week course what changed price gas gas price declined steadily recent year price gallon regular north fork national average week motor club aaa dunigan reason optimistic year ago all president obama pitched goal million plugin car american road instead york time reported november number electric car road fell grace say dunigan fanfare back skyhigh gas price make america oilindependent popular vehicle truck ford fsery chevrolet silverado accounted million sale online data sale plugin vehicle totaled cited gaselectric hybrid making percent light vehicle sale lightduty truck suvs increase percent sale funny read car company boasting suv sale dunigan said believer cycle gas low point back year electric car resurrected federal fueleconomy standard set increase starting putting pressure auto maker produce car lower emission course electric car altogether time gain mainstream popularity toyota introduced mirai fuel cell vehicle powered hydrogen car feature internal combustion produce carbon emission reportedly range mile full tank average fuel rating mpg starting retail price mirai range people now year watching documentary called killed fuel cell car plenty oil burning driving elantra mile counting hoping hang long can selfdriving car photo caption toyota mirai hydrogenpowered vehicle retail credit toyota joe werkmeister managing editor riverhead newsreview suffolk time reached emailprotected ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://suffolktimes.timesreview.com/2016/01/65386/column-so-what-happened-to-all-those-electric-cars/","m_Places":["California","New Jersey","Riverhead","America","Silverado","Toyota","Suffolk"],"m_People":["Dunigan","Schwing","Obama","Joe Werkmeister"],"m_Companies":["Sundance Film Festival","General Motors","Path","Aaa","New York Times","Grace"],"m_BiGrams":["electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10],"m_TriCnt":[],"m_iDocBodyWordCnt":379}
