{"m_szDocID":"599947","m_szDocTitle":"Comparing Batteries and Fuel Cells as Replacements for Gasoline - 24/7 Wall St.","m_szYear":"2016","m_szDocSumamry":"Comparing Batteries and Fuel Cells as Replacements for Gasoline By Paul Ausick February 1, 2016 8:35 am EST Tweet As a transportation fuel, liquid hydrocarbon fuel (gasoline, diesel, etc.) is hard to beat. It’s relatively stable, relatively easy to transport and, most importantly, benefits from a global infrastructure to find it, develop it, refine it and ship it to consumers. Displacing liquid hydrocarbons will take decades, and there are currently two contenders for job: batteries and fuel cells. Both battery-electric vehicles (BEVs) and fuel-cell vehicles (FCVs) use electricity to push the ","m_szDocBody":"comparing battery fuel cell replacement forgasoline paul ausick est tweet transportation fuel liquid hydrocarbon fuel gasoline diesel etc hard beat stable easy transport and importantly benefit global infrastructure develop refine ship consumer displacing liquid hydrocarbon decade contender job battery fuel cell batteryelectric vehicle bevs fuelcell vehicle fcvs electricity push vehicle road potential replace fossil fuel producing greenhouse gas emission vehicle and renewable source electricity used potential produce emission fuel production research paper brandon schoettle michael sivak university michigan transportation research institute compare fuel reviewing literature conducting interview expert conclusion bevs offer readily fuel source existing electric grid additionally bev model public relative fuelcell vehicle offer fuel economy resulting lowest cost operate per mile bevs tend produce lowest amount greenhouse gase welltowheel mile however driving range vehicle lowest vehicle type requiring longest time refuel recharge fcvs significantly longer driving range lower refuelling time comparable bevs amount petroleum welltowheel mile depending type hydrogen used hand small number vehicle model available recent model year similarly hydrogenrefueling infrastructure practically nonexistent california generally consensus expert expansion hydrogen infrastructure precede mass introduction fcvs order raise consumer confidence availability hydrogen fuel final word infrastructure paper gasoline station united state compared public private charging station battery hybrid electric hydrogen refuelling station total charging hydrogen station include planned addition excluding planned station hydrogen refuelling station united state paul ausick ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://247wallst.com/autos/2016/02/01/comparing-batteries-and-fuel-cells-as-replacements-for-gasoline/","m_Places":["California","United States"],"m_People":["Paul Ausick","Brandon Schoettle","Michael Sivak"],"m_Companies":["Replacements","Diesel","University Of Michigan","Research Institute"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":220}
