{"m_szDocID":"601588","m_szDocTitle":"McPhy Energy and partners announced as only finalists in $1m H2 competition | News | gasworld","m_szYear":"2009","m_szDocSumamry":"McPhy Energy and partners announced as only finalists in $1m H2 competition Save McPhy Energy and its US partners have been selected as the only finalists for the $1m H2 Refuel H-Prize competition launched by the US Department of Energy (DOE). After reviewing six submissions, the SimpleFuelTM consortium, which includes McPhy and its US partners, was deemed to be the only suitable applicant for the final of the competition. The H2 Refuel H-Prize competition, launched in October 2014, asked participants to develop affordable, small-scale hydrogen (H2) refuelling systems which can be used in home","m_szDocBody":"mcphy energy partner announced finalist competition save mcphy energy partner selected finalist refuel hprize competition launched department energy doe reviewing submission simplefueltm consortium include mcphy partner deemed suitable applicant final competition refuel hprize competition launched asked participant develop affordable smallscale hydrogen refuelling system home community centre retail site similar location far simplefuel developed home vehicle refuelling appliance fully integrated generation compression storage dispensing system deliver day pressure bar electrolysis prabhu rao ceo mcphy energy north america stated proud part simplefuel consortium awarded finalist competition recognition industry expert department energy alliance mcphy energy product validate effort providing cost effective distributed onsite hydrogen generation solution mcphy partner ivy energy solution pdc machine deploy system prepare testing qualify prize result competition based technical cost criteria announced october aim contest develop infrastructure encouraging public adoption fuel cell electric vehicle fcevs ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.gasworld.com/mcphy-energy-part-of-only-finalist-in-1m-h2-competition/2009938.article","m_Places":["North America"],"m_People":["Prabhu K. Rao","Pdc Machines"],"m_Companies":["Mcphy Energy And Partners","Us Department Of Energy","Alliance"],"m_BiGrams":["mcphy energy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":136}
