{"m_szDocID":"601641","m_szDocTitle":"John Hoffmire: Electric cars and the hydrogen economy | Deseret News","m_szYear":"2016","m_szDocSumamry":"John Hoffmire: Electric cars and the hydrogen economy Published: Tuesday, Feb. 2 2016 12:10 a.m. MST Updated: Tuesday, Feb. 2 2016 6:18 a.m. MST Recent steps have been taken in many states to build up the infrastructure needed for electric vehicles. Yet governments and companies must do more, for instance, by building the infrastructure needed to refuel hydrogen vehicles. Adobe stock photo Deseret News Summary Recent steps have been taken in many states to build up the infrastructure needed for electric vehicles. Yet governments and companies must do more, for instance, by building the infrast","m_szDocBody":"john hoffmire electric car hydrogen economy published tuesday feb mst updated tuesday feb mst recent step state build infrastructure needed electric vehicle government company more instance building infrastructure needed refuel hydrogen vehicle adobe stock photo deseret new summary recent step state build infrastructure needed electric vehicle government company more instance building infrastructure needed refuel hydrogen vehicle concern polluted air greenhouse emission dependency finite supply resource businesse government worldwide begun cleaner abundant fuel particular live affected pollution regular basis salt lake city ranked seventh polluted american lung association word zeroemission environmental report entering board room political discourse salt lake city pollution high unmanageable main pollution source vehicle this solution encourage low emission vehicle hybrid electric hydrogenpowered allelectric vehicle leaf env sery nissan bmw chevrolet spark ford focus electric choose from model tesla which way affordable market soon compete hybrid toyota prius honda accord hybrid cadillac elr ford fusion energi hyundai sonata hybrid chevy volt yet entry garner media attention praise promoting hydrogen hydrogen long answer environmental challenge burn clean chemically efficient gasoline byproduct produced water proponent hydrogen economy envision world unlimited clean power made extracting hydrogen sea water solar energy abundant resource earth critic electric car point energy power vehicle dependent burning fuel create electricity hydrogen fuel produced solar dependent carbonbased fuel nuclear fuel optimal hydrogen fuel cell compact cell utilise chemical reaction convert fuel hydrogen electricity bank fuel cell power car hundred mile quickly refuelled addition toyota recently unveiled fuel cell concept car mirai automaker including ford daimler alfa romeo bmw chrysler fiat honda nissan announced plan produce fuelcell vehicle year benefit hydrogen electricity step expand test applicability technology london example public buse running hydrogen utah testing electric bus option manufactured proterra california company main pain point focuse infrastructure development electric hydrogenpowered vehicle require refuelling station recent step state build infrastructure needed electric vehicle yet government company more instance installing electric charger car work public parking lot building infrastructure needed refuel hydrogen vehicle all rise electric vehicle aware crowding potential energy alternative hydrogen economy viable aware electricity produced traditional carbonbased source fuel leading sustainable energy future information sustainable vehicle calstart homepage project american hydrogen john hoffmire director impact bond fund sad business school oxford university direct centre business poverty wisconsin school business uwmadison run progress business nonprofit promoting economic development ben young hoffmire colleague progress business research article recommended storey ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.deseretnews.com/article/865646645/Electric-cars-and-the-hydrogen-economy.html?pg=all","m_Places":["Salt Lake City","Tesla","Toyota","London","Utah","California","Wisconsin","Madison"],"m_People":["John Hoffmire","Chrysler","Honda","Ben Young"],"m_Companies":["Adobe","Deseret News","American Lung Association","Salt Lake City","Bmw","I3","Cadillac","Volt","Energy Future","American Hydrogen Association","Bond Fund","Oxford University","School Of Business"],"m_BiGrams":["infrastructure needed","electric vehicle","hydrogen economy","recent step","step state","state build","build infrastructure","needed electric","government company","company more","more instance","building infrastructure","needed refuel","refuel hydrogen","hydrogen vehicle","fuel cell"],"m_TriGrams":["recent step state","step state build","state build infrastructure","build infrastructure needed","infrastructure needed electric","needed electric vehicle","government company more","company more instance","building infrastructure needed","infrastructure needed refuel","needed refuel hydrogen","refuel hydrogen vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3],"m_TriCnt":[3,3,3,3,3,3,3,3,3,3,3,3],"m_iDocBodyWordCnt":390}
