{"m_szDocID":"601702","m_szDocTitle":"2017 Hyundai Ioniq: Dark-Horse Competitor For Prius AND Bolt EV?","m_szYear":"2016","m_szDocSumamry":"2017 Hyundai Ioniq: Dark-Horse Competitor For Prius AND Bolt EV? Email This Page To (separate emails with commas) Message (optional) Your email was sent successfully. Close 4,642 views Feb 4, 2016 Follow John Enlarge Photo The new 2016 Toyota Prius is now arriving at dealers all over the country, and while gas prices--and hence hybrid sales--are down, it's expected to boost sales of the quintessential hybrid, now ranked at 52 or 56 mpg combined. Meanwhile, anticipation is building over the first deliveries of the 2017 Chevrolet Bolt EV, the 200-mile electric car starting at $37,500, which coul","m_szDocBody":"hyundai ioniq darkhorse competitor prius bolt separate email commas message optional successfully close view follow john enlarge photo toyota prius arriving dealer country gas pricesand hybrid salesare down expected boost sale quintessential hybrid ranked mpg combined meanwhile anticipation building delivery chevrolet bolt mile electric car starting hit dealer early december model follow car hot pursuit received attention yet miss hyundai ioniq hybrid electric model sold state hyundai ioniq subcompact hatchback korean maker intend offer hybrid batteryelectric version ioniq dedicated model meaning gasolineonly equivalent ride underpinning adapted hyundai elantra hyundai elantra enlarge photo date maker offered single vehicle fully electric conventional hybrid powertrain honda however offer version upcoming clarity midsize sedan powered hydrogen fuel cell large battery only plugin hybrid drivetrain respectively see hyundai elantra limited drive video schedule ioniq make debut york auto show late month hyundai elantra drive event week hold media drive ioniq hybrid ioniq fourth quarter year hyundai ioniq enlarge photo customarily car arrive dealer quarter ioniq arriving california state national distribution maker promised alway hyundai ambitious plan expect sell ioniq hybrid globally car year market spec ioniq model including fuel economy battery range week unclear york debut include version ioniq hybrid hyundai accomplish goal selling green car maker toyota move fast ioniq hybrid ioniq join hybrid plugin hybrid version hyundai sonata midsize sedan sale ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.greencarreports.com/news/1102205_2017-hyundai-ioniq-dark-horse-competitor-for-prius-and-bolt-ev","m_Places":["New York","California","Toyota"],"m_People":["Honda"],"m_Companies":["Hyundai"],"m_BiGrams":["ioniq hybrid","hyundai ioniq","hyundai elantra","enlarge photo"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":218}
