{"m_szDocID":"603552","m_szDocTitle":"Number of eco-friendly cars in S. Korea spikes 29 pct in 2015","m_szYear":"2016","m_szDocSumamry":"Print SEOUL, Feb. 14 (Yonhap) -- The number of eco-friendly cars in South Korea shot up almost 29 percent in 2015 from a year earlier amid the government's push to put more green automobiles on the road, data showed Sunday. The country had 180,361 registered eco-friendly vehicles as of the end of last year, up 28.6 percent from a year earlier, according to the data from the Korea Automobile Manufacturers Association (KAMA) and the transportation ministry. Hybrids were the lion's share of the representation with 174,620 units, a 27 percent jump from the previous year. The remainder were electri","m_szDocBody":"print seoul feb yonhap number ecofriendly car south korea shot percent year earlier amid government push put green automobile road data showed sunday country registered ecofriendly vehicle end year percent year earlier data korea automobile manufacturer kama transportation ministry hybrid lion share representation unit percent jump previous year remainder electric vehicle hydrogen fuel cell car onyear jump ecofriendly car accounted mere percent registered vehicle south korea slightly percent year earlier industry watcher proportion ecofriendly car grow considerably year backed recent launch electric car leading carmaker hyundai motor government policy boosting spread green car midjanuary hyundai started selling ioniq hybrid dedicated green car model aim selling unit year ioniq green car developed platform opposed vehicle design production based existing gasoline diesel model hyundai motor plan expand lineup electric vehicle plugin electric vehicle version government committed encouraging people drive ecofriendly vehicle part effort cut greenhouse gas emission generate growth momentum auto industry ministry trade industry energy work million ecofriendly car road backing automaker research development extending subsidy buyer end ","m_szGeo1":"South Korea","m_szSourceType":"source_news","m_szSrcUrl":"http://english.yonhapnews.co.kr/national/2016/02/14/69/0302000000AEN20160214001300320F.html","m_Places":["Seoul","South Korea","Korea"],"m_People":["Million Eco-friendly"],"m_Companies":["Yonhap","Manufacturers Association","Kama","Hyundai Motor Co","Hyundai","Diesel","Ministry Of Trade, Industry And Energy"],"m_BiGrams":["ecofriendly car","percent year","year earlier","electric vehicle","green car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":167}
