{"m_szDocID":"603557","m_szDocTitle":"Honda Motor to Make Hybrid Cars in China This Year | Bidness | Automobiles | By Muhammad Saad Khan","m_szYear":"2016","m_szDocSumamry":"Honda Motor to Make Hybrid Cars in China This Year Honda Motor to Make Hybrid Cars in China This Year The Japanese automaker renews its hybrid potential, as China bets on green cars to control worsening air pollution Feb 13, 2016 at 8:48 am EST By Muhammad Saad Khan on Feb 13, 2016 at 8:48 am EST Honda Motor Co. Ltd (ADR) ( NYSE:HMC ) plans to start manufacturing hybrid cars in China this year. These green cars will be gasoline-electric hybrids, the right fit in the face of stringent Chinese regulations for car-makers, as the country struggles with worsening air pollution. According to a Reute","m_szDocBody":"honda motor make hybrid car china year honda motor make hybrid car china year japanese automaker renew hybrid potential china bet green car control worsening air pollution est muhammad saad khan est honda motor adr nysehmc plan start manufacturing hybrid car china year green car gasolineelectric hybrid fit face stringent chinese regulation carmaker country struggle worsening air pollution reuter report honda spokesperson company make hybrid model acura compact sport utility vehicle suv accord sedan currently automaker market model hybrid car china vehicle impressive sale green car shipped japan sold hefty price import duty added price tag honda prefer producing green car china avoid transportation cost import taxe honda fit hybrid cost yuan usd country double price gasoline version china auto order start local production foreign carmaker tie knot local chinese manufacturer honda chinese joint venture guangzhou automobile ltd dongfeng motor ltd company make promote accord hybrid guangzhou hand gasolinefueled spirior produced marketed dongfeng japanese business newspaper nikkei average fuel economy car expected litre petrol honda expected produce hybrid version honda acura suv accord sedan year company intend introduce plugin version well honda motor doubling cleanfuel technology chinese government tighten grip auto emission industry expert auto emission regulation expected stringent year country plan put million electric vehicle road december honda chief technology strategy officer keiji ohtsu told ward auto company stop producing internal combustion engine car china bid shift green car permanently executive car hybrid including plugin variant effort china honda prefer shift global auto delivery hybrid end decade company betting electric car remedy lower emission plan promote hydrogenpowered fuel cell vehicle fcvs mass market company intend making fcvs mainstream past year china struggling cut auto emission promoting green car year banned half vehicle beijing attempt cut back carbon emission city odd number plate car rule vehicle restricted coming road once year honda motor stock dropped s&p indexs loss period company american depositary receipt closed friday editing maria shamim graphic waqas khan ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://www.bidnessetc.com/63446-honda-motor-to-make-hybrid-cars-in-china-this-year/","m_Places":["China","Est","Guangzhou","Beijing"],"m_People":["Muhammad Saad Khan","Keiji Ohtsu","Maria Shamim"],"m_Companies":["Honda","Honda Motor Co","Hmc","Reuters","Guangzhou Automobile Group Co Ltd.","Dongfeng Motor Group Co Ltd.","Nikkei","Chinese Government"],"m_BiGrams":["car china","green car","honda motor","hybrid car","make hybrid","china year","auto emission"],"m_TriGrams":["hybrid car china","car china year"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,6,5,4,3,3,3],"m_TriCnt":[4,3],"m_iDocBodyWordCnt":321}
