{"m_szDocID":"605456","m_szDocTitle":"Why General Motors is Waiting to Launch a Hydrogen Fuel Cell Car -- The Motley Fool","m_szYear":"2016","m_szDocSumamry":"Login Why General Motors is Waiting to Launch a Hydrogen Fuel Cell Car GM has great fuel-cell technology. But there are two big reasons why it hasn't yet brought a fuel-cell vehicle to market, and why it probably won't for another few years. John Rosevear ( TMFMarlowe ) Feb 18, 2016 at 6:20PM GM's fleet of Chevy Equinox SUVs powered by fuel cells has been running since 2007, and has covered more than 3 million miles. But GM says the time isn't yet right to bring the technology to market. Image source: General Motors What's holding back fuel cell vehicles? To hear General Motors ( NYSE:GM ) tel","m_szDocBody":"general motor waiting launch hydrogen fuel cell car great fuelcell technology big reason brought fuelcell vehicle market year john rosevear tmfmarlowe gms fleet chevy equinox suvs powered fuel cell running covered million mile time bring technology market image source general motor holding back fuel cell vehicle hear general motor nysegm combination thing obvious hydrogen refuelling station make ownership feasible southern california obvious surprising think fuelcell technology advancing quickly gms research advancing faster bring product market long considered leader developing fuelcell technology car fuel cell device chemically convert energy hydrogen electricity vehicle powered fuel cell electric car big battery pack make electricity onboard hydrogen tank exhaust water vapour tinkering fuel cell decade invested billion fuelcell technology year commercially viable system ready brought fuelcell car market yet report trade ward auto held part bring outofdate system market technology advancing quickly system produce outdated time fuelcell car dealer lot work done car exist repeatedly see role fuel cell futureproduct portfolio alongside batteryelectric vehicle gms fuel cell battery larger heavier vehicle vehicle duty extended period charge think fire truck instance working honda nysehmc massmarket fuelcell system vehicle expected market gms concern outdated technology held back japanese development partner honda offering fuelcellpowered vehicle albeit tiny number research effort expected seek wider market latest version fcv sedan unveiled tokyo fall car compete directly toyotas nysetm mirai sale japan mirai lighting sale chart january toyota sold big sale number point toyotas engineer sceptical batteryelectric vehicle adopted big number mainstream consumer large part long recharging time required company executive describe mirais fuel cell better battery recharged refuelled hydrogen gas minute industry waiting gas station course finding gas station fuelcell car challenge hyundai offering fuelcell version tucson suv tiny number southern california set refuelling station dealership work rest effort part country build hydrogenrefueling station and probably gms hydrogen car year off billiondollar isecret world biggest tech company forgot show recent event wall street analyst fool miss beat small company powering brandnew gadget coming revolution technology stock price unlimited room run early intheknow investor them john rosevear own share general motor motley fool recommend general motor foolish newsletter service free day fool hold opinion diverse range insight make investor motley fool disclosure policy ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fool.com/investing/general/2016/02/18/why-general-motors-is-waiting-to-launch-a-hydrogen.aspx?source=eptfxblnk0000004","m_Places":["United States","California","Tokyo","Toyota","Japan","Tucson","Wall Street"],"m_People":["John Rosevear","3 Million Miles"],"m_Companies":["General Motors","Honda","Hmc","U.s. Hyundai","Revolution","Motley Fool"],"m_BiGrams":["fuel cell","general motor","fuelcell technology","fuelcell car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,5,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":363}
