{"m_szDocID":"605797","m_szDocTitle":"Hydrogen Car Test Driven — Will It Clean The Environment, Or Just Your Wallet?","m_szYear":"2016","m_szDocSumamry":"You are at: Home » Technology »Hydrogen Car Test Driven — Will It Clean The Environment, Or Just Your Wallet? Hydrogen Car Test Driven — Will It Clean The Environment, Or Just Your Wallet? Technology In today’s green-conscious world, the hydrogen car could be a breakthrough in automotive technology. The problem with this may lie in what it will cost you, instead of how harmful it is to the environment. The biggest problem with the mainstream automotive industry is the fact that carbon emissions from regular fuels are slowly destroying the environment. There are laws in place to cut the problem","m_szDocBody":"home technology hydrogen car test driven clean environment wallet hydrogen car test driven clean environment wallet technology today greenconscious world hydrogen car breakthrough automotive technology problem lie cost you harmful environment biggest problem mainstream automotive industry fact carbon emission regular fuel slowly destroying environment law place cut problem minimum requirement emission testing order vehicle registered year however gase damage depleting ozone layer perpetuating problem global warming slowing away alternative fuel vehicle solution problem cost leap technology lower budget staying oilbased fuel moment price automotive advancement leave upperincome level hydrogen car different scientist eliminate emission problem emitting water vapour hot air technically emission average coffee maker lowemission vehicle depend heavily electricity give vehicle power problem require power run driving space heater high energy faster regular car thinking isnt engine give clean gase lubricate engine add oil pollutant engine lubrication engine breakdown temperature contend with unknown publicly costly repair break down also hydrogen cell lubrication summer heat dangerous combination worry repair cost hydrogen car planned sold subscription internet technically make rental car unknown price subscription car expected public larger scale rasa prototype hydrogen car riversimple called theoretical perpetual motion technology take energy created car running convert power power stored supercapacitor reused trickle ignite hydrogen motion wheel set axle car motor reverse motion braking lack friction theoretically save wear tear brake pad fluid built chassis car designed hydrogen cell expected public test phase end mass production sky new darren moss autocar revealed challenge hydrogen car face public quickly thing lack infrastructure government pledged build fuelingstation petrol station fraction what needed electric car decade point commercially road hydrogen technology similar time stage hydrogen car big breakthrough save environment drain wallet ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.themarshalltown.com/2016/02/18/hydrogen-car-test-driven-will-it-clean-the-environment-or-just-your-wallet/","m_Places":["Uk"],"m_People":["Darren Moss"],"m_Companies":["New Scientist","Sky News","Autocar"],"m_BiGrams":["hydrogen car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8],"m_TriCnt":[],"m_iDocBodyWordCnt":276}
