{"m_szDocID":"607274","m_szDocTitle":"Zeppelin of the road | The Gisborne Herald","m_szYear":"2016","m_szDocSumamry":"Zeppelin of the road From today a hydrogen-powered city car has started driving the streets in Britain. From today a hydrogen-powered city car has started driving the streets in Britain. The British-built Rasa runs on electricity generated by a hydrogen fuel cell. The two-seater will travel 482km on one 1.5kg fill-up of the lighter than air gas. Picture supplied ﻿FINALLY, a sleek, affordable British-built hydrogen-powered electric city car has arrived. The electric car will reduce emissions, with just water coming from its exhaust. It even has gull wing doors. Called Rasa, the green vehicle ","m_szDocBody":"zeppelin road today hydrogenpowered city car started driving street britain today hydrogenpowered city car started driving street britain britishbuilt rasa run electricity generated hydrogen fuel cell twoseater travel fillup lighter air gas picture supplied finally sleek affordable britishbuilt hydrogenpowered electric city car arrived electric car reduce emission water coming exhaust gull wing door called rasa green vehicle run electricity generated hydrogen fuel cell equivalent mile gallon backer twoseater travel mile fillup lighterthanair gas provide lift zeppelin hindenburg disaster car gear button forward neutral reverse accelerator pedal brake accelerate mph kmh city car top speed second engineer entrepreneur riversimple movement based llandrindod well wale developed futuristiclooking rasa scratch year named latin cleanslate initial plan thousand vehicle customer service contract month selling outright cost roughly leasing running diesel volkswagen golf fuel insurance running cost factored say company cover repair maintenance insurance fuel expense however shortage hydrogen filling station britain set open mean mile range eaten gas station rasa hitech fuel cell generate electricity hydrogen gas stored pressure tank boot electricity generated drive motor wheel finally sleek affordable britishbuilt hydrogenpowered electric city car arrived electric car reduce emission water coming exhaust gull wing door called rasa green vehicle run electricity generated hydrogen fuel cell equivalent mile gallon backer twoseater travel mile fillup lighterthanair gas provide lift zeppelin hindenburg disaster car gear button forward neutral reverse accelerator pedal brake accelerate mph kmh city car top speed second engineer entrepreneur riversimple movement based llandrindod well wale developed futuristiclooking rasa scratch year named latin cleanslate initial plan thousand vehicle customer service contract month selling outright cost roughly leasing running diesel volkswagen golf fuel insurance running cost factored say company cover repair maintenance insurance fuel expense however shortage hydrogen filling station britain set open mean mile range eaten gas station rasa hitech fuel cell generate electricity hydrogen gas stored pressure tank boot electricity generated drive motor wheel post comment comment published gisborne herald address published comment display approved staff member comment edited clarity latest new voting wait vote cast reloading page support council plan transfer commercial operation councilowned gisborne holding ltd ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://gisborneherald.co.nz/autowatch/2197445-135/zeppelin-of-the-road","m_Places":["Britain","Wales"],"m_People":[],"m_Companies":["Diesel","Gisborne Holdings Ltd"],"m_BiGrams":["city car","electricity generated","fuel cell","run electricity","generated hydrogen","hydrogen fuel","twoseater travel"],"m_TriGrams":["run electricity generated","electricity generated hydrogen","generated hydrogen fuel","hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,5,5,3,3,3,3],"m_TriCnt":[3,3,3,3],"m_iDocBodyWordCnt":344}
