{"m_szDocID":"607249","m_szDocTitle":"Toyota shows off hydrogen fuel cell car in India | Hydrogen Fuel News","m_szYear":"2016","m_szDocSumamry":"Categorized | Featured News , Hydrogen Fuel Cell , Transportation Toyota shows off hydrogen fuel cell car in India Share on Tumblr Toyota’s Mirai may be coming to India in the near future Toyota has shown off its new fuel cell vehicle , called the Mirai, at the 2016 Indian Auto Expo. The automaker has been working to promote the vehicle for some time, believing it to be the first step in a long clean transportation journey. The Mirai is equipped with a hydrogen fuel cell, which generates electrical power without also producing harmful emissions. The Mirai has been available in Japan since Dece","m_szDocBody":"categorised featured new hydrogen fuel cell transportation toyota show hydrogen fuel cell car india share tumblr toyotas mirai coming india future toyota shown fuel cell vehicle called mirai indian auto expo automaker working promote vehicle time believing step long clean transportation journey mirai equipped hydrogen fuel cell generate electrical power producing harmful emission mirai japan expected make market future agency reward mirai fuel efficiency rating environmental protection agency granted mirai fuel efficiency rating federal agency report vehicle travel recordbreaking mile single tank hydrogen fuel make mirai efficient vehicle modern history expected achieve efficiency rating automaker developing fuel cell vehicle more efficient mirai released india promising clean transportation market india attractive clean transportation market indian government focusing effort supporting renewable energy effort reduce harmful emission transportation sector responsible significant portion emission however government ensure clean vehicle road future supporting fuel cell vehicle ideal reduce harmful emission conventional electric vehicle attractive consumer due lower cost infrastructure support tata motor showcase fuel cell vehicle india toyota company show fuel cell vehicle indian motor show course indias leading automaker tata motor showcasing fuel cell vehicle called tata magic iris ziva small passenger vehicle feature aircooled fuel cell stack produce continuous kilowatt electrical power small size vehicle make affordable larger counterpart attractive consumer related post ","m_szGeo1":"India","m_szSourceType":"source_news","m_szSrcUrl":"http://www.hydrogenfuelnews.com/toyota-shows-off-hydrogen-fuel-cell-car-india/8527619/","m_Places":["Toyota","India","Japan","United States"],"m_People":["Iris Ziva"],"m_Companies":["U.s. Environmental Protection Agency","Indian Government"],"m_BiGrams":["fuel cell","cell vehicle","hydrogen fuel","clean transportation","harmful emission","efficiency rating"],"m_TriGrams":["fuel cell vehicle","hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,6,4,3,3,3],"m_TriCnt":[6,3],"m_iDocBodyWordCnt":210}
