{"m_szDocID":"607372","m_szDocTitle":"The Toyota Mirai is the car you can buy – today – that only emits water | City A.M.","m_szYear":"2016","m_szDocSumamry":"The Toyota Mirai is the car you can buy – today – that only emits water 23 February 2016 10:23pm Share: The Toyota Mirai At a modernist house in North London – designed, built and rented out by one of the partners at Norman Foster’s firm – Toyota showed me the future of the car. It’s a long, funny-looking four-door contraption called the Mirai, with exaggerated rear wheel arches and a fittingly modernist front end. Other car companies talk about this stuff, occasionally showing off concepts. Toyota gets on with building them. Make what you will of the looks, it’s still a momentous release: the","m_szDocBody":"toyota mirai car buy today emit water share toyota mirai modernist house north london designed built rented partner norman foster firm toyota showed future car long funnylooking fourdoor contraption called mirai exaggerated rear wheel arches fittingly modernist front end car company talk stuff occasionally showing concept toyota building them make look momentous release world mainstream purposebuilt production hydrogen fuel cell car doesnt low emission emission isnt exhaust doesnt one biggest worry londoner drop water pipe rear freeze drink water toyota spokesman assure you ask nod seemingly worse taste nothing pure water mineral anything theyll selling mirai water health food shop futuristic pretty simple technology toyota weve fuel cell ready year shrug spokesman difficult bit making cheap build toyota lose money mirai world biggest profitable car company worried lost money prius made first sold million world increasingly agree hybrid shortterm answer green motoring longterm pure electric drive enter magic fuel cell similar electric vehicle battery provide power electric motor engine mirai unlike dont plug fuel cell generate electricity board mixing hydrogen onboard tank air fillup minute hour range mile barely hundred awkward bit lack place refuel thousand petrol station handful hydrogen pump londoner visit heathrow trading estate wembley fill mirai ideal chicken egg situation toyota make move step fancy house mirai plush modern techcentric japanese look clean commanding comfortable touchsensitive surface highre display lovely place save world from seat four mind blastproof carbon fibreclad hydrogen tank lot space bit ive waiting watching tomorrow world driving productionready hydrogenpowered car what car future like electric motor pushes along strongly responsively here range anxiety comfortable smooth serene car tech halfcentury feel incredibly normal contentedly crunch back drive fancy house car solve london pollution problem here theyre lovely dont expect local toyota dealer allin fuel deal taking sting list price even hydrogen included production fewthousand couple year britain dozen year prius started green early adopter mirai day car this fact decent car gwiz lunacy here icing cake ill raise glass eau mirai that price ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cityam.com/235260/the-toyota-mirai-is-the-car-you-can-buy-today-that-only-emits-water","m_Places":["Toyota","North London","Enter","Uk","Well","London","Britain"],"m_People":["Norman Foster"],"m_Companies":["Ups","Wembley"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":329}
