{"m_szDocID":"607441","m_szDocTitle":"Why Are Renewables Buoyant Even As Oil Sinks? | Observer","m_szYear":"2016","m_szDocSumamry":"Why Are Renewables Buoyant Even as Oil Sinks? By Andrew Eil • 02/25/16 11:36am Electricity pylons and wind turbines stand beside the RWE Niederaussem coal-fired power plant while Steam rises from cooling towers near Bergheim, Germany. Oil prices are plummeting. Gas is cheap; heating–whether from oil or natural gas – is too. So is clean energy in trouble as its older, dirtier cousin becomes more economically attractive? Not as much as you might think. First, a few facts. The price of oil has plummeted from over $100 per barrel in the summer of 2014, and is hovering around $30, the lowest level ","m_szDocBody":"renewable buoyant oil sink andrew eil electricity pylon wind turbine stand rwe niederaussem coalfired power plant steam rise cooling tower bergheim germany oil price plummeting gas cheap heatingwhether oil natural gas too clean energy trouble older dirtier cousin economically attractive think first fact price oil plummeted barrel summer hovering lowest level oil gas sector lost percent market capitalization month natural gas wholesale price fallen half year meanwhile deployment renewable energy led solar wind taking off gigawatt solar wind commissioned percent previous year top half newlybuilt global power generating capacity seized renewable year biggest renewable energy investment billion globally what happening here explanation rockbottom oil price lower incentive upgrade highefficiency appliance highperformance boiler geothermal heat system smart thermostat first oil transportation heating renewable energy generate electricity lighting computer appliance fact percent power globally produced oil percent mean that part renewable oil compete market second price renewable declining fast oil steady technological process innovation wind solar economy scale investor producer double renewable result speak themselve solar created job percent growth rate areas subsidy recentlyextended production investment tax credit incentive statelevel renewable portfolio standard motivated climate change energy independence helped investment sector buoyant complicating factor though power generation renewable compete directly natural gas cheap reason related oil produced superabundant fracking big factor global oil price decline natural gas renewable time being duelled draw eroded market forcoal wrinkle cheap oil depressing incentive energy efficiency technology substitute oil gasoline good electric car which mandate california stunningly highperforming sexy car tesla model advanced fast hoped cheap gas undercut economic compact electric car short term unsurprisingly gasoline gallon suv sale spiked meanwhile rockbottom oil price lower incentive upgrade highefficiency appliance highperformance boiler geothermal heat system smart thermostat oldschool home insulation window lower priority electricity heating oil fossil fuel like propane home businesse cheap newfangled energy technology directly compete oil counting higher electricity cost future threatened advanced biofuel offshore floating wind turbine wave tidal energy technology concern though tempered fact electricity price seldom decline fossil fuel price largely utility business model changing power grid operator selling electricity selling service balancing supply demand power providing grid consumer producer word grid gas station turning pump switchboard matching power source such local gas turbine you turning washing machine dryer existing gas infrastructure make easy inexpensive stick gas accelerate transition zerocarbon energy leave big question renewablesoil relationship market sentiment classic animal spirit identified famous economist john maynard keyne word oil market investor determine price gyrate wildly price make sense big impact consumer energy choice patrick pouyanne ceo total energy argue cheap oil discourage investor renewable competitiveness future argument cheap fossil energy energy price volatility general undermine confidence longterm competitiveness renewable energy readily dismissed hand additionally question increasing spillover renewable transport heating electric vehicle nascent renewable heat technology start compete fossilbased incumbent climate goal percent emission reduction advanced country require renewable energy make inroad areas sooner later long incumbent cheap renewable entry market face steeper climb lastly natural gas question loom large long coal oil downslope dirty highcarbon fuel want natural gas balance load grid providing reliable fairly cheap electricity low natural gas price persist existing gas infrastructure make easy inexpensive stick gas accelerate transition zerocarbon energy current oil price decline long sery yoyo movement market beginning longterm decline accompanying frackingfueled overabundance oil obsolescence both impact clean energy longer run fossil fuel price impact rate renewable energy deployed margin change core trend all renewable energy deployment steadily increased turn century weathering low oil price trend continue accelerate stay tuned andrew eil managed climate change foreign assistance programme state department independent consultant york city ","m_szGeo1":"Germany","m_szSourceType":"source_news","m_szSrcUrl":"http://observer.com/2016/02/why-are-renewables-buoyant-even-as-oil-sinks/","m_Places":["Germany","United States","California","New York City"],"m_People":["Andrew Eil","John Maynard Keynes"],"m_Companies":["U.s. State Department"],"m_BiGrams":["natural gas","renewable energy","oil price","fossil fuel"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,7,6,3],"m_TriCnt":[],"m_iDocBodyWordCnt":590}
