{"m_szDocID":"608979","m_szDocTitle":"ITM Power reports growing order book  | LON:ITM","m_szYear":"2016","m_szDocSumamry":"ITM Power reports growing order book Share A first London re-fuelling site will open in May with second schedule for July Five stations will be open in UK by end 2016 ITM Power ’s ( LON:ITM ) project pipeline has risen to £18.7mln with growing interest in its rapid response electrolysers. The hydrogen storage and fuel systems group has £9.7mln of projects contracted and a further £9mln in the final stages of negotiation. That compares with £17.7mln in total at the end of January, which itself was 55% higher than a year earlier. Enquiries are growing for larger scale platforms in the range of 0","m_szDocBody":"itm power report growing order book share london refuelling open schedule station open end itm power lonitm project pipeline risen mln growing interest rapid response electrolyser hydrogen storage fuel system mln project contracted mln final stage negotiation compare mlnin total end january higher year earlier enquiry growing larger scale platform range said past year itm opened number refuelling site hydrogen fuel cell powered electric vehicle including due upgrade shortly london site national physical laboratory teddington open second centre engineering manufacturing excellence east london open july forecourt refuelling station open end make five site negotiation government backing multigroup plan hydrogen refuelling station operational storage hydrogen electrolyser compression system european marine energy centre orkney readying shipment itm negotiating contract mwsystem andy allen chief financial officer added recent mln funding financial strength deliver existing pipeline boosting client confidence key strategic goal cash flow positive shortest time possible share ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.proactiveinvestors.co.uk/companies/news/123238/itm-power-reports-growing-order-book-123238.html","m_Places":["London","Uk","East London"],"m_People":["Andy Allen"],"m_Companies":["European Marine Energy Centre"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":145}
