{"m_szDocID":"608978","m_szDocTitle":"Govt notifies infra cess of up to 2.5% on cars - The Economic Times","m_szYear":"2016","m_szDocSumamry":"Govt notifies infra cess of up to 2.5% on cars By PTI | Mar 01, 2016, 09.25 PM IST ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! NEW DELHI: Government today notified the imposition of infrastructure cess of up to 2.5 per cent on passenger vehicles, which was announced in Budget 2016-17 but was silent on 4 per cent levy on big diesel SUVs and cars. Vehicles using petrol, LPG or CNG fuels with engine capacity not exceeding 1,200cc and length less than 4,000 mm will attract cess of 1 per cent, Central Board of Excise and Customs said in notification. It further sa","m_szDocBody":"govt notify infra cess car pti ist special love visual aspect new enjoy exclusive slideshow treat delhi government today notified imposition infrastructure cess cent passenger vehicle announced budget silent cent levy big diesel suvs car vehicle petrol lpg cng fuel engine capacity exceeding length attract cess cent central board excise custom notification cent cess imposed diesel vehicle engine capacity exceeding length exceeding notification was however silent cent infrastructure cess other higher engine capacity suvs bigger sedan announced finance minister arun jaitley budget the pollution traffic situation indian city matter concern propose levy infrastructure cess cent small petrol lpg cng car cent diesel car capacity cent higher engine capacity vehicle suvs finance minister yesterday today notification ambulance taxis electric vehicle including threewheeler hybrid vehicle car physically handicapped person hydrogen vehicle based fuel cell technology exempted levy case car physically handicapped person avail exemption buyer give affidavit dispose car period year purchase stay top business new economic time app download now ","m_szGeo1":"India","m_szSourceType":"source_news","m_szSrcUrl":"http://economictimes.indiatimes.com/news/economy/policy/govt-notifies-infra-cess-of-up-to-2-5-on-cars/articleshow/51213572.cms","m_Places":["New Delhi","Central"],"m_People":["Arun Jaitley"],"m_Companies":["Diesel","Economic Times"],"m_BiGrams":["engine capacity","infrastructure cess","cess cent"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":159}
