{"m_szDocID":"608989","m_szDocTitle":"Audi A7 h-tron review","m_szYear":"2016","m_szDocSumamry":"Audi A7 h-tron review X large Print Hydrogen power technology, and its green motoring prospects, have fallen by the wayside of late in the wake of lithium ion’s growing ‘alt-power’ prominence. But fuel-cell tech is far from dead. A case in point is the A7 h-tron, Audi’s fourth generation of hydrogen-tech development. Audi’s latest zero emissions powertrain approach has turned away from more traditional liquid hydrogen methodology and towards compressed hydrogen. And it’s no mere pipedream. During a recent trip to Ingolstadt, Audi flung us the key to one of its A7 h-tron prototypes – road-regis","m_szDocBody":"audi htron review large print hydrogen power technology green motoring prospect fallen wayside late wake lithium ion growing altpower prominence fuelcell tech dead case point htron audis fourth generation hydrogentech development audis latest emission powertrain approach turned traditional liquid hydrogen methodology compressed hydrogen mere pipedream recent trip ingolstadt audi flung key htron prototype roadregistered homeland surprisingly brisk punt deutsch countryside completely bespoke drivetrain design rearmounted compressed hydrogen storage tank fuelcell system mounted conventional combustion engine located power electric motor front axle rear downside add battery pack additional tdi quattro making htron upside though nominal better transmission fixed singlegear mechanism motor wheel eliminating parasitic powertrain losse still motor overboost burst creating power peak wheel more kerb mass crucial delivered instant electric motor start spinning performance twisty back road ample herb foot sort energy associate healthy turbodiesel rattle start engine thrum move sonically sportback silent electric car low speed compressor easily mistaken whoosh small turbocharger top speed too handy outright performance though isnt point test emissionsfree electric motoring fast refill time viability demonstrate fuelcell motoring experience feel petrolhead well normal normal drive put way guess powertrain driving prior knowledge youd guess turbo petrol magical instant torque boost perhap quiet diesel fuelcell car motoring scribe attuned dissecting difference powertrain feel guess average motorist difference that really biggest win prototype emit bar water vapour twin tailpipe critical then range refuelling fourthgen prototype form luxurious spacious compromisefree htron offer range hydrogen only added full electric mode refill tank minute therell broader infrastructure future support commercialised fuelcell motoring though biggest question mark star spec engine electric motor power overboost torque sec claimed price free weekly report world fast car motor newsletter share ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://www.motormag.com.au/reviews/1603/audi-a7-h-tron-review/","m_Places":["Ingolstadt"],"m_People":[],"m_Companies":["Audi A7","Audi","Guess","Torque","Diesel"],"m_BiGrams":["electric motor"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":276}
