{"m_szDocID":"608969","m_szDocTitle":"Norway May Pull Back On Some EV Incentives - Gas 2","m_szYear":"2016","m_szDocSumamry":"Norway May Pull Back On Some EV Incentives February 29th, 2016 by Steve Hanley     Updated March 1. Our contact in Norway advises that the following changes are part of a package of proposals that are under discussion. Our story yesterday indicated the changes had already been put into effect. The story has been amended in light of this new information.  Norway probably leads the world when it comes to EV incentives. That may be why sales of electric and plug-in hybrid cars have surged in the country recently. For one thing, cars with plugs are exempt from sales tax and VAT assessments. Norway","m_szDocBody":"norway pull back incentive steve hanley updated contact norway advise part package proposal discussion storey yesterday put effect storey amended light information norway lead world incentive sale electric plugin hybrid car surged country recently thing car plug exempt sale tax vat assessment norway highest sale taxe car country europe exemption long making electric car price competitive conventional vehicle addition driver benefit broad array soft incentive pay toll norwegian highway ferry bridge unlimited bus commuter lane allowed park free city provided preferential parking space location charge free part norway abundance hydroelectric power week norwegian government announced advantage away country rebalance incentive package evs numerous city room left buse bus lane moving forward evs subject local fee taxe previously exempt from bus commuter lane restricted avoid congestion free parking charging eliminated areas other preferential parking reserved car emission mean plugin hybrid excluded privilege driver paying full toll nation major highway ferriesorreduced toll bridge ring road surround major city good new sale tax vat exemption electric car remain full force effect end norway decide time renew exemption modify light policy consideration economic factor exemption cost national treasury lot money yeargovernment policy subject change light experience moment norway feel time tap brake incentive norwegian website side norway introduce newpolicy requireall car buse light commercial vehicle emission category fulfil requirement battery electric hydrogen fuel cell vehicle policy state emission vehicle over petrol diesel car sold rechargeable hybrid and possible biofuel note translation google norwegian colleague leif hansen alerting storey chartvia norwegian electric car experience study conducted petter haugneland han hvard kvisle norwegian electric vehicle association share ","m_szGeo1":"Norway","m_szSourceType":"source_news","m_szSrcUrl":"http://gas2.org/2016/02/29/norway-may-pull-back-on-some-ev-incentives/","m_Places":["Norway","Europe"],"m_People":["Ev Drivers","Steve Hanley","Leif Hansen","Hans Håvard Kvisle"],"m_Companies":["Norwegian Government","Diesel","Google","Vehicles Association"],"m_BiGrams":["electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":261}
