{"m_szDocID":"609012","m_szDocTitle":"Create Tomorrowland XPrize Challenge - Consumer Reports","m_szYear":"2016","m_szDocSumamry":"Yes, send me a copy of this email. Send We respect your privacy . ALL email addresses you provide will be used just for sending this story. Thanks for sharing. Oops, we messed up. Try again later A car that runs off plants and sun. Another that’s powered by solar panels. How about an electric fuel-cell scooter—that can fly! These are some of the future modes of transportation dreamed up by kids imagining a world of more fuel-efficient vehicles. Here at Consumer Reports, that’s also a world we like to dream about and feel is important for drivers and the automotive industry. In our video above,","m_szDocBody":"yes send copy email send respect privacy addresse provide sending storey sharing oop messed car run plant sun powered solar panel electric fuelcell scooterthat fly future mode transportation dreamed kid imagining world fuelefficient vehicle consumer report world dream feel important driver automotive industry video above talked young dreamer entered fuelefficient car ideas create tomorrowland xprize challenge contest run partnership disney xprize nonprofit itsboundarypushing competition adult scientist consumer report director auto testing jake fisher mit mechanical engineeringprofessor amos winter teamed playfully weigh concept video photosyntheticfueled car katrina year katrinas idea harnessing power sun plant create fuel car future idea work primarily tested military commercial truck form blend algae fuel carbonneutral fuel source remove carbon dioxide atmosphere commercially viable process producing algaebased fuel readily time katrina learn drive air compression car jaden year jaden progressive idea car roof harness sun solar panel power turbine motor far carmounted solar panel solely production car lowwattage feature infotainment system size solar panel needed capture energy recharge car big futuristic and failed car company aptera xprize competitor plan solar assistance highefficiency threewheel car automaker including fisker ford mazda toyota toyed solar assistance flying car lila year flying car fantasy form transportation long jetson aerocar company moller international year planning gaspowered spaceshiplooking recreational vehicle combination boat hovercraft atv snowmobile hasnt ground massachusettsbased terrafugia believe future personal air transportation near company developing terrafugia tfx semiautonomous fourseat hybrid electric flying car development terrafugia taking reservation buyer lila electric fuelcell scooter jason year hydrogenpowered electric fuelcell vehicle road decade now albeit small number company diverse general motor honda hyundai mercedesbenz toyota offering special lease car fuelcell vehicle electric vehicle produce power onboard chemical reaction hydrogen oxygen hydrogen plentiful resource storage transportation solution remain challenge jason idea water create hydrogen electrolysis power engine forwardlooking creating renewable energy flying part though build buy car buying service cost hassle saving ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.consumerreports.org/fuel-economy/disney-create-tomorrowland-xprize-challenge/","m_Places":["Toyota","Jetson","Massachusetts"],"m_People":["Jake Fisher","Professor Amos"],"m_Companies":["Consumer Reports","Disney","Boundary","Diesel","Progressive","Mazda","Seat","General Motors","Honda","Hyundai","Mercedes-benz"],"m_BiGrams":["solar panel","electric fuelcell","flying car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":307}
