{"m_szDocID":"609057","m_szDocTitle":"Can Hydrogen and Electric vehicles both be the answer?","m_szYear":"2016","m_szDocSumamry":"Home / Interesting / Can Hydrogen and Electric vehicles both be the… Can Hydrogen and Electric vehicles both be the answer? Tweet We’ve heard quite a lot about both electric vehicles and hydrogen vehicles within the past year. Tesla has been announcing new electric cars and technologies, … We’ve heard quite a lot about both electric vehicles and hydrogen vehicles within the past year. Tesla has been announcing new electric cars and technologies, BMW is working on both electric car and hydrogen car technology and even companies like Toyota and GM are exploring both. And there seems to be quite ","m_szDocBody":"home interesting hydrogen electric vehicle hydrogen electric vehicle answer tweet weve heard lot electric vehicle hydrogen vehicle past year tesla announcing electric car technology weve heard lot electric vehicle hydrogen vehicle past year tesla announcing electric car technology bmw working electric car hydrogen car technology company toyota exploring both divide people hydrogen fuel people pure battery electric vehicle people between both technology developed fullest extent tesla fan side pure battery electric vehicle bevsand feel hydrogen fuel waste time money elon musk teslas founder calling hydrogen fool idea creating hydrogen fuel emit lot carbon dioxide moment spending time money developing technology fueling station development electric car make sense bevs longterm future however moment electric car dont range long time recharge hydrogenpowered car range electric car refuel minute internal combustionpowered car hydrogen fuel cellpowered car power electric motor propulsion emission making equally environmentally friendly pros con form alternative fuel balance out develop both expensive government automaker develop technology andset infrastructure both worth electric car longterm future giving longer range making charge faster long time hydrogen car good alternative people long commute frequently long trip evs prefect people live city short commute hydrogen helpful people not exist company tesla feel hydrogen waste time lot company disagree working technology company bmw general motor mercedesbenz toyota latter good reason alternative fuel technology fully developed fully develop hydrogen batterytechnology ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.bmwblog.com/2016/03/02/can-hydrogen-electric-vehicles-answer/","m_Places":["Tesla","Toyota"],"m_People":["Elon Musk"],"m_Companies":["Bmw","General Motors","Mercedes-benz"],"m_BiGrams":["electric car","electric vehicle","hydrogen fuel","vehicle hydrogen","car technology"],"m_TriGrams":["electric vehicle hydrogen"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,6,4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":223}
