{"m_szDocID":"610739","m_szDocTitle":"Tesla Motors To Stop Supplying Mercedes-Benz With Battery Pack, Drivetrain As German Automaker Develops Its Own","m_szYear":"2016","m_szDocSumamry":"Tesla Motors To Stop Supplying Mercedes-Benz With Battery Pack, Drivetrain As German Automaker Develops Its Own By Angelo Young @angeloyoung_ On 03/07/16 AT 5:08 PM The next generation Mercedes-Benz B-Class Electric Drive will forgo the battery pack and drivetrain that has underpinned Merc’s first fully electric vehicle. Pictured is a 2015 model. Photo: Mercedes-Benz After seven years, Mercedes-Benz and Tesla Motors are parting ways. The German automaker will go at it alone in developing the next generation B-Class Electric Drive, its fully electric $42,000 compact five-door hatchback. “We hav","m_szDocBody":"tesla motor stop supplying mercedesbenz battery pack drivetrain german automaker develop angelo young generation mercedesbenz bclass electric drive forgo battery pack drivetrain underpinned merc fully electric vehicle pictured model photo mercedesbenz year mercedesbenz tesla motor parting way german automaker developing nextgeneration bclass electric drive itsfully electric compact fivedoor hatchback excellent project tesla worked them harald kroeger head electricdrive development mercedesbenz parent daimler agtold german magazine wirtshaft woche published weekend company invested million euros million battery drivetrain plant supply component kroeger added current bclass eke mile fully charged battery electric car priced generation bclass electric drive boast range putting comfortably area wave electric car coming including teslas model sedan priced federal greencar incentive incentive price fall decision end supply arrangement year daimler invested million tesla percent stake startup crucial makeorbreak moment palo alto electric car maker daimler sold half share similar daimler toyota early investor tesla putting million selling fremont californiafactory tesla toyota teslas battery pack drivetrain failed fully electric version rav crossover electric vehicle toyota parted way tesla committed developing hydrogen fuel cell technology tesla ceo elon musk fuel cell impractical passenger car correction earlier version storey misstated price tesla model federal greencar incentive related storey ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.ibtimes.com/tesla-motors-stop-supplying-mercedes-benz-battery-pack-drivetrain-german-automaker-2331898","m_Places":["Tesla","United States","Palo Alto","Toyota","Fremont, California"],"m_People":["Angelo Young","Harald Kroeger","Elon Musk"],"m_Companies":["Tesla Motors","Mercedes-benz","Daimler Ag"],"m_BiGrams":["battery pack","pack drivetrain","bclass electric","electric drive","electric car"],"m_TriGrams":["battery pack drivetrain","bclass electric drive"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":196}
