{"m_szDocID":"610813","m_szDocTitle":"Co-wheels and Aberdeen City Council add hydrogen vehicles to car sharing scheme","m_szYear":"2016","m_szDocSumamry":"Co-wheels and Aberdeen City Council add hydrogen vehicles to car sharing scheme Was this article useful? Click the thumbs up > Aberdeen City Council and Co-wheels has added two hydrogen fuel cell Hyundai ix35 SUVs to its car sharing programme. Operated by Co-wheels, and already featuring electric vehicles, the new cars will be available for the public and businesses to hire for short term use. Lead member for hydrogen Councillor Barney Crockett said: \"Today marks another important milestone for Aberdeen and its future-focused Hydrogen Strategy. \"Once again we are demonstrating that by taking t","m_szDocBody":"cowheel aberdeen city council add hydrogen vehicle car sharing scheme useful thumb aberdeen city council cowheel added hydrogen fuel cell hyundai suvs car sharing programme operated cowheel featuring electric vehicle car public businesse hire short term use lead member hydrogen councillor barney crockett said today mark important milestone aberdeen futurefocused hydrogen strategy once demonstrating taking lead developing innovative technology offer environmentally friendly alternative traditional method transport rely fossil fuel crockett chair european hydrogen hyer added aberdeen developing reputation cando hydrogen city aberdeen hydrogen bus project attracted million investment city deployment europe largest hydrogen bus fleet street aberdeen renowned energy city keen drive forward energy technology work country world secure future energy leader with car taking level moving closer worldleading renewable city securing hydrogen economy aberdeen presenting tangible opportunity energy industry managing director cowheel richard falconer said cowheel pioneered cleaner greener travel option hydrogen powered car step improving air quality reducing emission city delighted working aberdeen city council enable resident council staff local businesse cuttingedge green driving technology car put pace initial phase testing cowheel make business public use hyundai boast similar level convenience performance conventional internal combustion car full operation hyundais fuelled locallyproduced hydrogen city operate fleet hydrogenpowered buse related tag ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fleetnews.co.uk/news/environment/2016/03/14/co-wheels-and-aberdeen-city-council-add-hydrogen-vehicles-to-car-sharing-scheme","m_Places":["Aberdeen","Bus","Europe"],"m_People":["Barney Crockett","Richard Falconer"],"m_Companies":["Aberdeen City Council","Aberdeen City Council And Co","Hyundai","Association Hyer"],"m_BiGrams":["aberdeen city","city council"],"m_TriGrams":["aberdeen city council"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":201}
