{"m_szDocID":"610815","m_szDocTitle":"Zero-emission supercar for 300 customers","m_szYear":"2016","m_szDocSumamry":"Zero-emission supercar for 300 customers Access F&I Upcoming Webinars Zero-emission supercar for 300 customers The H2 Speed Concept previews what could be the world's fastest zero-emission sports car.   Automotive News March 14, 2016 - 12:01 am ET Pininfarina turned heads in Geneva this month when it showed what could become the world's fastest zero-emission sports car -- the H2 Speed Concept. And the Italian company figures it has identified a market for such a vehicle. The H2 Speed previews a track-only, hydrogen-powered car that mates exotic performance (more than 180-mph top speed and acce","m_szDocBody":"zeroemission supercar customer f&i upcoming webinar zeroemission supercar customer speed concept preview world fastest zeroemission sport car automotive new pininfarina turned head geneva month showed world fastest zeroemission sport car speed concept italian company figure identified market vehicle speed preview trackonly hydrogenpowered car mate exotic performance more mph top speed acceleration mph second emission consisting steam fuel cell vehicle turinbased coachbuilder design engineering firm estimate people world prepared pay sevenfigure sum exclusive sport car speed project feasible building unit pininfarina ceo silvio angori production pininfarina speed aimed exclusively track enthusiast participate programme ferraris price paid trackonly supercar event organised managed ferrari angori said there number wealthy people work silicon valley drive tesla electric car daily commute attracted true zeroemission supercar speed weekend ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.autonews.com/article/20160314/OEM03/303149955/zero-emission-supercar-for-300-customers","m_Places":["Geneva","Silicon Valley","Tesla"],"m_People":["Said Pininfarina","Silvio Angori"],"m_Companies":["Automotive News","Pininfarina"],"m_BiGrams":["zeroemission supercar","sport car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":122}
