{"m_szDocID":"610849","m_szDocTitle":"Honda’s Clarity Fuel Cell hydrogen car has a 750km range | News | Geek.com","m_szYear":"2016","m_szDocSumamry":"Honda’s Clarity Fuel Cell hydrogen car has a 750km range By Matthew Humphries Mar. 14, 2016 9:30 am Subscribing to a newsletter indicates your consent to our Terms of Use and Privacy Policy . More Geek Scientists discover bacteria that will happily eat old plastic The race is on to replace gasoline as the fuel of choice for our vehicles. Electric cars seem to be the future, but Japanese car manufacturers are pushing hydrogen as another green alternative. Toyota was the first to market with its Mirai , but now Honda is joining them with a sedan that boasts a 750km (466 miles) range. Honda has m","m_szDocBody":"hondas clarity fuel cell hydrogen car range matthew humphry mar subscribing newsletter consent term privacy policy geek scientist discover bacteria happily eat plastic race replace gasoline fuel choice vehicle electric car future japanese car manufacturer pushing hydrogen green alternative toyota market mirai honda joining sedan boast mile range honda managed create sedantype car refer clarity fuel cell vehicle seat people positioning power train front car vehicle capable driving range fuel tank capacity litre positioned rear car cutaway image below car doesnt room baggage hydrogen car work progress honda realise this mind clarity fuel cell vehicle initially leased honda time period test car realworld situation feedback driver resolve issue commercial release general public honda designed hydrogen system adapt vehicle type straight hydrogen car create hybrid electric vehicle hybrid setup model include lithiumion battery thought cost honda sell one reference toyota mirai range future success hydrogen car rely heavily availability hydrogen fuel source produced environmentallyfriendly way common fuel type gas station driving future wont electric vehicle mix hydrogen electric tag ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.geek.com/news/hondas-clarity-fuel-cell-hydrogen-car-has-a-750km-range-1649678/","m_Places":["Toyota"],"m_People":["Matthew Humphries"],"m_Companies":["Honda","Seat"],"m_BiGrams":["hydrogen car","clarity fuel","fuel cell"],"m_TriGrams":["clarity fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":168}
