{"m_szDocID":"610811","m_szDocTitle":"Chevy vs. Toyota: Which Will Win the World Green Car Award?","m_szYear":"2016","m_szDocSumamry":"Chevy vs. Toyota: Which Will Win the World Green Car Award? Reddit Source: General Motors The redesigned Chevy Volt has already garnered rave reviews and won 2016 Green Car of the Year  in Los Angeles. Now the next battle is set for the New York Auto Show, where the Volt joins the Toyota Mirai fuel cell vehicle and new Prius as the three finalists for 2016 World Green Car , an award decided by industry journalists. Each model makes a strong case for most environmentally friendly vehicle of the 2016 model year. In the case of the 2016 Chevy Volt, the new model’s improvements over the outgoing e","m_szDocBody":"chevy toyota win world green car award reddit source general motor redesignedchevy volt garnered rave review won green car year los angele battle set york auto show volt join thetoyota mirai fuel cell vehicle prius finalist world green car award decided industry journalist model make strong case environmentally friendly vehicle model year case chevy volt model improvement outgoing edition storey electric range jumped mile mile economy reached mile gallon from mile gallon electric mode gained mile gallon gasoline mode model power price lower original driver wont fuel car offer mile range make strong case source toyota toyota mirai hydrogen fuel cell vehicle widespread sale way car ahead time car famously emit water tailpipe however due lack open hydrogen station california region available sale limited guessed thousand waiting list toyota sold model month availability nonetheless mirai future japanese represent bold move toyota pushing potential alternative fuel cover mile full hydrogen tank electric vehicle market mile gallon compared tesla model american council energyefficient economy put mirai tick highprofile confirming green car bona fide source toyota toyota prius finalist engineering marvel gasoline fuel economy concerned efficient eco model prius epaestimate mile gallon city driving record measure low cost gas model people smallest fuel budget deserve great deal credit electric vehicle adoption remain challenging city prius serve alternative evs remain greenest model driver plug due garage limitation practical concernsit emit water emission whatsoever solarpowered electric car important car nonetheless boldness mirai impossible efficiency prius chevy volt considered frontrunner world green car driver cover trip electric power worry range volt package rebate entry market model year judge decide york cheque autos cheat sheet follow eric ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cheatsheet.com/automobiles/chevy-vs-toyota-which-will-win-the-world-green-car-award.html/?a=viewall","m_Places":["Toyota","Los Angeles","New York","United States","California"],"m_People":["Chevy Volt"],"m_Companies":["Reddit","General Motors","Volt","American Council For An Energy-efficient Economy","Epa","Facebook","Twitter"],"m_BiGrams":["green car","mile gallon","world green"],"m_TriGrams":["world green car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,5,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":270}
