{"m_szDocID":"610820","m_szDocTitle":"Toyota partners in making wind-power hydrogen for fuel cells - WBRC FOX6 News - Birmingham, AL - WBRC.com","m_szYear":"2016","m_szDocSumamry":"Toyota partners in making wind-power hydrogen for fuel cells - WBRC FOX6 News - Birmingham, AL - WBRC.com Member Center: Toyota partners in making wind-power hydrogen for fuel cells 2016-03-14T07:31:09Z By YURI KAGEYAMA AP Business Writer YOKOHAMA, Japan (AP) - Toyota Motor Corp. is responding to the main criticism of fuel cell cars, that making the hydrogen for the fuel is not clean, with plans to help make the hydrogen using wind power. Fuel cells are zero-emission, running on the power created when hydrogen combines with oxygen in the air to make water. But to have a totally clean supply ch","m_szDocBody":"toyota partner making windpower hydrogen fuel cell wbrc fox new birmingham wbrccom member centre toyota partner making windpower hydrogen fuel cell yuri kageyama business writer yokohama japan toyota motor corp responding main criticism fuel cell car making hydrogen fuel clean plan make hydrogen wind power fuel cell zeroemission running power created hydrogen combine oxygen air make water totally clean supply chain hydrogen cleanly made now hydrogen produced fossil fuel project announced monday hydrogen windpower plant hama wing yokohama southwest tokyo compressed transported truck power fuelcell forklift site area factory vegetableandfruit market warehouse project partnership toyota city yokohama nearby kawasaki prefectural kanagawa government japanese electronic energy company toshiba corp energy supplier iwatani corp involved electricity produced wind power electric vehicle bother making hydrogen defending project toyota senior managing officer shigeki tomoyama stressed easier store hydrogen electricity clean hydrogen fix global warming energy security said stable supply cofree hydrogen needed told reporter yokohama hotel toyota make prius gaselectric hybrid electric vehicle limited cruise range windpowered hydrogen expected reduce carbondioxide emission percent compared gas grid electricity company hydrogen truck newly developed serve hydrogen fueling station forklift japan hope leader hydrogen power plan showcase prowess tokyo olympic cost ensuring adequate hydrogen supply obvious challenge toyotas japanese rival honda motor rolled latest model clarity fuel cell vehicle week toyotas fuel cell vehicle called mirai vehicle expensive regular consumer leased ministry company ","m_szGeo1":"Japan","m_szSourceType":"source_news","m_szSrcUrl":"http://www.wbrc.com/story/31460063/toyota-partner-in-making-wind-power-hydrogen-for-fuel-cells","m_Places":["Yokohama","Japan","Hama","Tokyo","Toyota","Kawasaki"],"m_People":["Yuri Kageyama","Shigeki Tomoyama"],"m_Companies":["Toyota Partners","Ap","Toyota Motor Corp","Kanagawa Government","Toshiba Corp","Iwatani Corp.","Honda Motor Co"],"m_BiGrams":["fuel cell","hydrogen fuel"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,3],"m_TriCnt":[],"m_iDocBodyWordCnt":226}
