{"m_szDocID":"610835","m_szDocTitle":"Honda debuts Clarity, its first mass production hydrogen car | The Japan Times","m_szYear":"2016","m_szDocSumamry":"Honda debuts Clarity, its first mass production hydrogen car Honda Motor Co. debuted a fuel cell vehicle Thursday that it hopes will secure wide take-up amid a national push for zero-emissions hydrogen technology. The Clarity is a five-seater model, the first hydrogen-powered vehicle of that size. Over the first year, Honda is targeting the lease of 200 units to firms, government agencies and local municipalities. During this period the company will gauge users’ reactions. After 18 months, the car will become available to the public. The vehicle is priced at ¥7.66 million, but the government i","m_szDocBody":"honda debut clarity mass production hydrogen car honda motor debuted fuel cell vehicle hope secure wide takeup amid national push zeroemission hydrogen technology clarity fiveseater model hydrogenpowered vehicle size year honda targeting unit firm government agency local municipality period company gauge user reaction month car public vehicle priced million government offering purchaser vehicle million subsidy clarity unit equipped fuel cell stack hydrogen tank hydrogen oxygen generate electricity power motor engine byproduct water manufacture hydrogen fuel produce greenhouse gase honda president takahiro hachigo automaker produce electric vehicle focus fuel cell vehicle fcvs fuel cell hydrogen technology applied variety car hachigo honda began developing fuel cell technology back leased type fcvs date leading fcv company added honda launch clarity europe year gave date world commercial fuel cell vehicle toyota motor corp mirai launched fourseater sedan run kilometre full tank honda fiveseater clarity government pushing dub hydrogen promoting fuel cell vehicle environmentally friendly car spread expert number hydrogen fueling station increase currently station country including construction ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.japantimes.co.jp/news/2016/03/10/business/honda-debuts-clarity-first-mass-production-hydrogen-car/","m_Places":["United States","Europe"],"m_People":["Takahiro Hachigo"],"m_Companies":["Honda","Honda Motor Co","Toyota Motor Corp"],"m_BiGrams":["fuel cell","cell vehicle"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,4],"m_TriCnt":[4],"m_iDocBodyWordCnt":163}
