{"m_szDocID":"612435","m_szDocTitle":"Jeremy Clarkson thinks hydrogen fuel cells are the future of cars. Is he right?  | Alphr","m_szYear":"2016","m_szDocSumamry":"Jeremy Clarkson thinks hydrogen fuel cells are the future of cars. Is he right? email Electric vehicles are getting increasingly common, but in the last year or so  Toyota , Hyundai,  and BMW have announced hydrogen powered cars. But Jeremy Clarkson thinks we should be seeing fuel cell cars from many, many more carmakers. In  his column in The Sunday Times  earlier this month, the former BBC Top Gear presenter asked why more carmakers aren’t embracing hydrogen as a sustainable fuel. \"I'm baffled by the car industry's apparent reluctance to think more seriously about hydrogen as a replacement f","m_szDocBody":"jeremy clarkson think hydrogen fuel cell future car right electric vehicle increasingly common year toyota hyundai bmw announced hydrogen powered car jeremy clarkson think fuel cell car many carmaker column time earlier month bbc top gear presenter asked carmaker arent embracing hydrogen sustainable fuel baffled car industry apparent reluctance hydrogen replacement petrol diesel clarkson wrotehydrogen abundant element universe run billion year clean too car powered hydrogen fuel cell produce tailpipe water related hybrid car phevs market driver clarkson mention riversimple rasa hydrogen car wrote afew week ago but praise welshbuilt hydrogen car clarkson write wont win many claiming normal person think you stick ford fiesta clarkson add motor industry stop fiddling pointless battery hybriddrive system road future personal mobility hydrogen road jeremy clarkson right clarkson waste product hydrogen car factor doesnt account hydrogen abundant resource universe specific type hydrogen needed electric car making kind fuel cell car run easy also sheer lack hydrogen car mean infrastructure lag compared electric car electric charger evergrowing urban areas hydrogen station handful moment sure possibility manufacturer copying tesla building refuelling station cost involved higher clarkson understandably single riversimple car divide opinion car lsuch toyota mirai prove bespoke hydrogen car drive traditional counterpart fact drive london loved musk disagree person agree clarkson tesla ceo elon musk main pioneer electric car musk quiet opponent hydrogenpowered car video below make rare comment call dumb technology video &quot&quot elon musk &quothydrogen fuel cell extremely silly hydrogen incredibly dumb pick&quot relationship hydrogen pure electric car fascinating topic interesting covering larger indepth feature soon ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.alphr.com/cars/1002996/jeremy-clarkson-thinks-hydrogen-fuel-cells-are-the-future-of-cars-is-he-right","m_Places":["Toyota","Clarkson","Best","Uk","Tesla","London"],"m_People":["Jeremy Clarkson","Riversimple Rasa","Elon Musk"],"m_Companies":["Hyundai","Bmw","Sunday Times","Bbc","Diesel"],"m_BiGrams":["fuel cell","hydrogen car","electric car","jeremy clarkson"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,5,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":254}
