{"m_szDocID":"614240","m_szDocTitle":"Hydrogen Cars Are the Key to Your Next 6,000 Mile Eco Friendly Road Trip - Mic","m_szYear":"2016","m_szDocSumamry":"Hydrogen Cars Are the Key to Your Next 6,000 Mile Eco Friendly Road Trip POST The Hyundai ix35 fuel cell electric vehicle just broke a world record — and a pretty awesome one at that. It just completed a dizzying, continuous six-day journey for 6,096 miles on a motorway that encircles London. The  London Hydrogen Network Expansion , which seeks to expand the number of hydrogen fueling stations across the United Kingdom, spearheaded the experiment.  The car was only allowed to stop  for refueling (which, incidentally, only takes three to five minutes ). The demonstration broke another record, t","m_szDocBody":"hydrogen car key mile eco friendly road trip post thehyundai fuel cell electric vehicle broke world record pretty awesome that completed dizzying continuous sixday journey mile motorway encircle london london hydrogen network expansion seek expand number hydrogen fueling station united kingdom spearheaded experiment car allowed stop refuelling which incidentally take fiveminute demonstration broke record too car travelled mile tank hydrogen fuel cell electric vehicle driver shift swapped refuelling total hyundai approximately lap mile motorway recordbreaking journey began uks hydrogen week doubt excellent publicity lhnewhich aim deliver publiclyaccessible network bar hydrogen fueling station london south east website major attraction fuel cell electric vehicle emission however hydrogen fuel reputation dangerous easily combustible computer world call theory misconception perception hydrogen extremely flammable dangerous compared comfortable day age gasolinejana hartline toyota spokeswoman told computer world gasoline extremely flammable fuel escape hydrogen sound good you excited hydrogen station united state and cost developing infrastructure power car low demand them long attempting hydrogenpowered world record facebook ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://mic.com/articles/138774/hydrogen-cars-are-the-key-to-your-next-6-000-mile-eco-friendly-road-trip","m_Places":["London","United Kingdom","U.k.","Toyota","United States"],"m_People":["6,000 Mile Eco Friendly","Jana Hartline"],"m_Companies":["Hyundai","Facebook"],"m_BiGrams":["fuel cell","cell electric","electric vehicle"],"m_TriGrams":["fuel cell electric","cell electric vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":160}
