{"m_szDocID":"614249","m_szDocTitle":"Fuel cell cars could become clean power plants, researchers say","m_szYear":"2016","m_szDocSumamry":"Fuel cell cars could become clean power plants, researchers say in Green , News In an experiment meant to promote fuel cell technology, researchers transformed Hyundai’s hydrogen SUV into a power plant. Researchers at Delft University of Technology in the Netherlands converted a zero-emission fuel cell electric vehicle into a power plant on wheels, as they successfully engineered and installed a socket on a Hyundai ix35 Fuel Cell that serves as an electrical outlet. The experiment is meant to promote hydrogen-powered vehicles as a cleaner source of energy. The idea behind this also links into ","m_szDocBody":"fuel cell car clean power plant researcher green new experiment meant promote fuel cell technology researcher transformed hyundais hydrogen suv power plant researcher delft university technology netherland converted zeroemission fuel cell electric vehicle power plant wheel successfully engineered installed socket hyundai fuel cell serve electrical outlet experiment meant promote hydrogenpowered vehicle cleaner source energy idea link car owner possibility vehicle transportation percent time researcher say unlike fossil fuel powered car fuel cell vehicle produce electricity hydrogen parked cleaner efficiently current electricity system waste product heat fresh water alternatively home school office converted hyundai fuel cell capacity kilowatt sufficient power average home socket place scientist managed modify car distribute electricity grid directly house instance complement wind solar power hyundai push fuelcell tech forward long time fourth generation automaker fcev santa fcev tucson fcev fcev fuel cell vehicle european road country hyundai ","m_szGeo1":"Netherlands","m_szSourceType":"source_news","m_szSrcUrl":"http://www.inautonews.com/fuel-cell-cars-could-become-clean-power-plants-researchers-say","m_Places":["Santa Fe","Tucson"],"m_People":[],"m_Companies":["Hyundai","Delft University Of Technology"],"m_BiGrams":["fuel cell","power plant"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3],"m_TriCnt":[],"m_iDocBodyWordCnt":140}
