{"m_szDocID":"614320","m_szDocTitle":"Green Car Shopping: Electric Vs. Fuel Cell Vehicles - Quoted","m_szYear":"2016","m_szDocSumamry":"Green Car Shopping: Electric Vs. Fuel Cell Vehicles March 22, 2016 Advice Already considering “going green” for your next car? Fist bump to you, friend. Now comes the part where you have to choose the alternative energy-powered vehicle that’s right for you. It can be daunting, but as environmental issues garner broader attention and more new “green car” models are released, resources are produced to help you understand and evaluate your options and to navigate a culture of sustainable driving . Battery-Powered Electric Vehicles (BEVs) and Hydrogen Fuel Cell Vehicles (FCVs) are the two most pro","m_szDocBody":"green car shopping electric fuel cell vehicle advice green car fist bump you friend part choose alternative energypowered vehicle you daunting environmental issue garner broaderattention newgreen car model arereleased resource producedto understand evaluate option navigate culture sustainable driving batterypowered electric vehicle bevs hydrogen fuel cell vehicle fcvs produced type completely gasolinefree energy theyre definitively environment fossil fuelpowered vehicle important carefully difference two recent study brandon schoettle michael sivak university michigan examined difference offered insight guideline green car shopping experience below batterypowered electric vehicle bevs model year unique electric car model charge home regular volt outlet upgrade volt faster charging minimal setup cost bevs produce tailpipe emission total emission depend type power grid charge from though con depending vehicle volt capacity outlet charging hour bevs market travel mile recharge and eye out manufacturer promise upward mile soon smart car electric coupe charging station hydrogen fuel cell vehicle fcvs pros charge minute total efficiency bevs translate longer driving range con limited refuelling infrastructure exist dont live california specifically los angele san francisco bay areas youll hard time refuelling charged home powered natural gas clean bevs toyota mirai fuel cell car hydrogen station refuelling regional existence fueling station gas pump fossilfuel powered vehicle important consideration potential owner green car congress report university michigan comparison gasoline station bev charging station fcv charging station gasoline gas station exist state washington station cost million build bevs recharging station and public charging outlet exist cost homebased charger installation build public station fcvs refuelling station exist california cost million build statebystate guide refuelling recharging station alternativeenergy powered vehicle found gasolinepowered using average mpg gallon out rethinking transportation researcher university michigan note bevs driving range overall including teslas average fcvs gaspowered vehicle bevs longer charge fcvs several hour compared minute real average american driver offer green car shopper complete picture what need instance percent american driver travel fewer mile day percent driver fewer mile day mean overnight charge bev provide energy vast majority american daily business charging port bevs easily set residential garage shopping everyday need youre driving short distance charge home overnight con bevs drawback all however youre onevehicle family occasionally travel long distance youll range option dont live close fcv refuelling station youll type vehicle now ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.thezebra.com/insurance-news/2766/green-car-shopping-electric-vs-fuel-cell-vehicles/","m_Places":["Most","California","Los Angeles","Toyota","Washington D.c.","United States","Tesla"],"m_People":["Brandon Schoettle","Michael Sivak"],"m_Companies":["University Of Michigan","Volt","Congress"],"m_BiGrams":["green car","fuel cell","cell vehicle","vehicle bevs","university michigan","charging station"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":369}
