{"m_szDocID":"614315","m_szDocTitle":"Do green vehicles make sense for the average consumer? | CTV Vancouver News","m_szYear":"2016","m_szDocSumamry":"Do green vehicles make sense for the average consumer? Ross McLaughlin and Lisa Green, CTV Vancouver Published Thursday, March 24, 2016 5:41PM PDT Last Updated Thursday, March 24, 2016 7:05PM PDT If you’re thinking of a green vehicle, there’s no better time than now. Incentives are up as B.C. pushes hard to get more electric, hybrid and fuel cell vehicles on the road and there are more choices on the market than ever. Electric vehicles use one-third as much energy as gas powered and have zero emissions. B.C. currently has 3,300 registered battery electric and plug-in hybrid electric vehicles w","m_szDocBody":"green vehicle make sense average consumer ross mclaughlin lisa green ctv vancouver published thursday pdt updated thursday pdt youre thinking green vehicle time now incentive pushes hard electric hybrid fuel cell vehicle road choice market ever electric vehicle onethird energy gas powered emission registered battery electric plugin hybrid electric vehicle make cent sale province double year year province pumped money incentive programme announced encourage individual businesse buy green vehicle announced fund supposed year ran topped qualify eligible pretax sticker price qualifying battery electric fuel cell electric plug hybrid electric vehicle hydrogen fuel cell vehicle offer vehicle cost tesla start out electric vehicle owner trade vehicle scrap eligible part provincial scrap programme upgraded public charging station coming electric vehicle charge vehicle minute station province evs allowed occupancy vehicle lane highway now required people vehicle youre gonna hov lane matter people car premier christy clark incentive target strata council slow embrace construction electric vehicle charging station underground parking lot partly cost naomi yamamoto minister energy mine announced multiunit building instal charging station you bought electric vehicle fighting neighbour plug money put blair qualey car dealer electric vehicle market today top seller pricey tesla modest nissan leaf sporty bmwi start evs added time hybrid plugin toyota prius prime announced york auto show sale canada fall dont forget hybrid gas powered partially electric vehicle reduced emission fuel economy province offer incentive purchase them what next really future hydrogen fuel dave nichol toyota national manager external affair told ctv new toyota launched mirai year hydrogen fuel cell vehicle produce electricity board electrochemical process emission water vapour consumer cheque latest green technology visit vancouver international auto show vancouver convention centre sunday every day surrounded amazing technology qualey photos ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://bc.ctvnews.ca/do-green-vehicles-make-sense-for-the-average-consumer-1.2831958","m_Places":["Vancouver","Tesla","New York","Canada","Toyota"],"m_People":["Ross Mclaughlin","B.c. Premier","Christy Clark","Naomi Yamamoto","Blair Qualey","Dave Nichols"],"m_Companies":["Ctv","Minister Of Energy And Mines","Dealers Association Of Bc","Vancouver International Auto Show"],"m_BiGrams":["electric vehicle","fuel cell","green vehicle","cell vehicle","hydrogen fuel","charging station"],"m_TriGrams":["fuel cell vehicle"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,4,3,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":282}
