{"m_szDocID":"617592","m_szDocTitle":"Midwest Renewable Energy Association Announces Energy Fair Speaker - Door County Pulse","m_szYear":"2006","m_szDocSumamry":"Door County Pulse Reddit Email Sandrine Mubenga, keynote speaker at the 27th annual Energy Fair, is a Professional Engineer (PE), Master Electrical Engineer (MSEE), CEO of SMIN Power Group, and if that isn’t enough, she developed a fuel cell system for an electric vehicle and a solar-powered hydrogen generating station. Through SMIN Power Group she implements renewable energy solutions in Africa, particularly solar. Hear Sandrine’s inspiring story and how she is making access to electricity a reality for people with renewable energy power at her keynote, June 18 at 6 pm. Sandrine Mubenga “Sand","m_szDocBody":"door county pulse reddit sandrine mubenga keynote speaker annual energy fair professional engineer master electrical engineer msee ceo smin power group isnt enough developed fuel cell system electric vehicle solarpowered hydrogen generating station smin power implement renewable energy solution africa solar hear sandrine inspiring storey making electricity reality people renewable energy power keynote sandrine mubenga sandrine storey contribution advancement renewable energy inspiring shes heart brain determination make renewable energy solution reality kaitlyn kohl communication coordinator mrea mubenga founded smin power specialise providing affordable electricity community renewable energy effort aid energy crisis home africa smin power expanded presence africa office located democratic republic congo additionally mubenga work electrical engineering manager university toledo manage building automation team assisting management yearly million utility budget energy fair powered midwest renewable energy mrea energy fair place custer wis learn more call visit theenergyfairorg midwestreneworg ","m_szGeo1":"Congo","m_szSourceType":"source_news","m_szSrcUrl":"https://doorcountypulse.com/midwest-renewable-energy-association-announces-energy-fair-speaker/","m_Places":["Africa","Democratic Republic Of Congo"],"m_People":["Sandrine Mubenga","Said Kaitlyn Kohl"],"m_Companies":["Door County","Pulse","Reddit","Power Group","Mrea","University Of Toledo","Energy Association"],"m_BiGrams":["renewable energy","smin power","energy fair"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":139}
