{"m_szDocID":"617522","m_szDocTitle":"Will Tesla (TSLA) Stock Decline on Model X Recall? - TheStreet","m_szYear":"2016","m_szDocSumamry":"TheStreet Will Tesla (TSLA) Stock Decline on Model X Recall? By Amanda Gomez | 04/11/16 - 01:28 PM EDT Reprint NEW YORK ( TheStreet ) -- Tesla Motors ( TSLA - Get Report )  today announced a voluntary recall of its SUV, the Model X, because of issues with the electric vehicle's seating. The Palo Alto, CA-based company is recalling 2,700 Model X cars produced before March 26 to replace the back of the third row seat, which could fall forward in certain accidents, CNBC.com reports. \"It's actually with the leverage of weight in the seat pulling it forward,\" Jon McNeill, Tesla's sales and service ","m_szDocBody":"thestreet tesla tsla stock decline model recall amanda gomez edt reprint york thestreet tesla motor tsla report today announced voluntary recall suv model issue electric vehicle seating palo alto cabased company recalling model car produced replace back row seat fall forward accident cnbccom report its leverage weight seat pulling forward jon mcneill teslas sale service president said tocnbccom front crash weight passenger seat belted seat latch fail recall model began shipping late year production delay share tesla increasing afternoon trading monday separately tesla motor sell rating letter grade thestreet rating company deteriorating net income generally debt management risk disappointing return equity poor profit margin feeble earning share growth full analysis report here tsla thestreet rating objectively rated stock riskadjusted total return prospect month investment horizon based new day rating differ jim cramer article author cheque service investor ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.thestreet.com/story/13525948/1/will-tesla-tsla-stock-decline-on-model-x-recall.html","m_Places":["New York","Palo Alto, Ca","Tesla","Best"],"m_People":["Will Tesla","Amanda Gomez","Jon Mcneill","Jim Cramer"],"m_Companies":["Tesla Motors","Seat","Cnbc.com"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":137}
