{"m_szDocID":"617620","m_szDocTitle":"Hyundai vehicles to operate BeeZero hydrogen car sharing service","m_szYear":"2016","m_szDocSumamry":"Hyundai vehicles to operate BeeZero hydrogen car sharing service Was this article useful? Click the thumbs up > A number of Hyundai ix35 Fuel Cell vehicles have been provided to German car sharing service BeeZero, to be launched in Munich this summer. BeeZero, run by gas specialist The Linde Group, will operate 50 Hyundai ix35 Fuel Cell electric vehicles for public use. “The new BeeZero car sharing offer is pioneering sustainable mobility,” said Thomas A. Schmid, chief operating officer at Hyundai Motor Europe. “Featuring the Hyundai ix35 Fuel Cell, BeeZero will not only be the first car shari","m_szDocBody":"hyundai vehicle operate beezero hydrogen car sharing service useful thumb number hyundai fuel cell vehicle provided german car sharing service beezero launched munich summer beezero run gas specialist linde group operate hyundai fuel cell electric vehicle public use beezero car sharing offer pioneering sustainable mobility thomas schmid chief operating officer hyundai motor europe featuring hyundai fuel cell beezero car sharing service hydrogenpowered zeroemission car offer comfortable reliable transportation public everyday need expect gain valuable information daytoday fleet operation develop hydrogen technology expand hydrogen infrastructure christian bruch member executive board linde beezero synergise mobility trend gaining lot ground moment car sharing emission bring benefit fuel cell technology wider potential user beezero car sharing service run zonebased model fleet munich city centre areas schwabing haidhausen glockenbachviertel conventional car sharing service car easily booked online smartphone app hyundai fuel cell travel kilometre single tank making ideal longer journeysand short trip city hydrogen fuel beezero sourced sustainable production processe making completely carbon neutral fuel cell electric vehicle hybrid plugin hybrid model sold world hyundai motor pioneered electric powertrain added schmid now launch ioniq lead car brand hybrid plugin hybrid electric fuel cell vehicle production making low zeroemission car accessible everyone related tag ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"http://www.fleetnews.co.uk/news/fleet-industry-news/2016/04/08/hyundai-vehicles-to-operate-beezero-hydrogen-car-sharing-service","m_Places":["Munich","Europe"],"m_People":["Thomas A. Schmid","Dr Christian Bruch"],"m_Companies":["Hyundai","Linde Group","Linde Ag"],"m_BiGrams":["car sharing","fuel cell","sharing service","hyundai fuel","beezero car"],"m_TriGrams":["car sharing service","hyundai fuel cell","beezero car sharing"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,7,5,4,3],"m_TriCnt":[5,4,3],"m_iDocBodyWordCnt":198}
