{"m_szDocID":"617641","m_szDocTitle":"Hyundai and Linde Bringing Fuel Cell Carsharing to Germany","m_szYear":"2016","m_szDocSumamry":"Hyundai and Linde Bringing Fuel Cell Carsharing to Germany Hyundai has partnered with hydrogen fueling supplier Linde Group to bring the BeeZero carsharing program to Germany. BeeZero will roll out 50 Hyundai ix35 Fuel Cell vehicles this summer in Munich. The campaign hopes to bring support for hydrogen fuel cell vehicles as a zero emission vehicle; and, it’s the first carsharing program that includes fuel cell vehicles, according to Hyundai. Consumers will have opportunities to try out carsharing and to test drive a fuel cell vehicle before choosing whether to buy or lease one. Pricing for th","m_szDocBody":"hyundai linde bringing fuel cell carsharing germany hyundai partnered hydrogen fueling supplier linde bring beezero carsharing programme germany beezero roll hyundai fuel cell vehicle summer munich campaign hope bring support hydrogen fuel cell vehicle emission vehicle and carsharing programme include fuel cell vehicle hyundai consumer opportunity carsharing test drive fuel cell vehicle choosing buy one pricing carsharing programme announced partner company beezero synergise mobility trend gaining lot ground moment car sharing emission bring benefit fuel cell technology wider potential user christian bruch member executive board linde beezero carsharing service run zonebased model munich carsharing service car easily booked online smartphone app also hyundai working nextgeneration fuel cell vehicle hyundai fuel cell travel kilometre mile single tank hyundai fuel cell suvs road european country hyundai fuel cell badged tucson fuel cell world massproduced commercially hydrogen fuel cell electric vehicle launched automaker plan roll fuel cell car future dedicated platform competitive mass market fuel cell car toyota honda hyundais hydrogenpowered fuel cell vehicle part larger emission campaign include ambitious plan launching electrified hyundai kia electrified model ","m_szGeo1":"Germany","m_szSourceType":"source_news","m_szSrcUrl":"http://www.hybridcars.com/hyundai-and-linde-bringing-fuel-cell-carsharing-to-germany/","m_Places":["Linde","Germany","Munich","Tucson","United States","Toyota"],"m_People":["Dr. Christian Bruch"],"m_Companies":["Hyundai","Linde Group","Linde Ag","Honda"],"m_BiGrams":["fuel cell","cell vehicle","hyundai fuel","carsharing programme"],"m_TriGrams":["fuel cell vehicle","hyundai fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[15,6,4,3],"m_TriCnt":[6,4],"m_iDocBodyWordCnt":174}
