{"m_szDocID":"617609","m_szDocTitle":"Air Liquide's Hartford hydrogen depot looms | HartfordBusiness.com","m_szYear":"2016","m_szDocSumamry":"Air Liquide's Hartford hydrogen depot looms HBJ photo | gregory seay Steelworkers erect the second of two pump-island canopies for Pride Convenience Inc.'s Hartford Travel Center, off Jennings and Leibert roads, in the North Meadows. Related Content Gregory Seay French industrial-gas supplier Air Liquide formally announced Thursday that Hartford is one of four Northeast cities that initially will house its network of hydrogen-refueling stations. It plans to eventually have 12 in the region. As previously reported , Massachusetts retailer Pride Convenience Stores Inc. disclosed in February that","m_szDocBody":"air liquide hartford hydrogen depot loom hbj photo gregory seay steelworker erect pumpisland canopy pride convenience inc hartford travel centre jenning leibert road north meadow related gregory seay french industrialgas supplier air liquide formally announced hartford northeast city initially house network hydrogenrefueling station plan eventually region previously reported massachusett retailer pride convenience store inc disclosed air liquide planned operate refuelling depot ground pride planned truck stop leibert road northbound side hartford north meadow work underway pride pump gasolinediesel refuelingrest stop food court tentatively set open july air liquide signed longterm agreement instal hydrogen station braintree mansfield mass bronx set serve driver zeroemission hydrogen fuel cell electric vehicle fcevs beginning company said air liquide teaming global auto giant toyota erect network hydrogen station east coast state station existence aid toyota marketing fcev sedan mirai gas supplier station configured equipped refuel fcev minute typical fcevs driving range mile air liquide station spaced range mind official said far air liquide designed built hydrogen station worldwide ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.hartfordbusiness.com/article/20160407/NEWS01/160409923/1002","m_Places":["Hartford","North Meadows","Massachusetts","Braintree","Mansfield, Mass.","Bronx, N.y.","Toyota","East Coast"],"m_People":["Gregory Seay"],"m_Companies":["Air Liquide","Pride Convenience Inc.","Pride Convenience Stores Inc.","Diesel"],"m_BiGrams":["air liquide","hydrogen station"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,3],"m_TriCnt":[],"m_iDocBodyWordCnt":162}
