{"m_szDocID":"617617","m_szDocTitle":"Hyundai ix35 used for world’s first fuel cell-powered car-sharing service","m_szYear":"2016","m_szDocSumamry":"Hyundai ix35 used for world’s first fuel cell-powered car-sharing service 2 pictures BeeZero has launched in Munich, Germany, using 50 of the ix35 FCEVs, which can be booked online or via a mobile app                                                      (Credit: Hyundai). View gallery (2 images) Hyundai has followed news of its IONIQ line of electrified vehicles and roadmap for connected car development with an announcement that its cars will power the \"world's first\" fuel cell-powered zero-emission car-sharing service. BeeZero has launched exclusively using Hyundai ix35 vehicles. Hyundai desc","m_szDocBody":"hyundai world fuel cellpowered carsharing service picture beezero launched munich germany fcevs booked online mobile app credit hyundai gallery image hyundai new ioniq line electrified vehicle roadmap connected car development announcement car power world first fuel cellpowered zeroemission carsharing service beezero launched exclusively hyundai vehicle hyundai describe massproduced commerciallyavailable fuel cell electric vehicle fcev carmaker road europe claim fcevs manufacturer combined travel full tank beezero operating munich fcevs vehicle booked online mobile app service run zonebased model user pick car munich city centre areas schwabing haidhausen glockenbachviertel expect gain valuable information daytoday fleet operation develop hydrogen technology expanding infrastructure christian bruch member executive board linde group beezero subsidiary beezero synergise mobility trend gaining lot ground moment car sharing emission bring benefit fuelcell technology wider potential user addition vehicle producing emission linde source hydrogen fuel sustainable production processe making completely carbonneutral beezero launched munich yesterday ","m_szGeo1":"Australia","m_szSourceType":"source_news","m_szSrcUrl":"http://www.gizmag.com/beezero-car-sharing-hyundai-ix35/42716/","m_Places":["Munich","Germany","Europe"],"m_People":["Christian Bruch"],"m_Companies":["Hyundai","Linde Group"],"m_BiGrams":["beezero launched"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":144}
