{"m_szDocID":"617616","m_szDocTitle":"Air Liquide announces locations for four hydrogen fueling stations in the Northeastern US | News | gasworld","m_szYear":"2010","m_szDocSumamry":"Air Liquide announces locations for four hydrogen fueling stations in the Northeastern US Save Air Liquide has announced locations for its first four publicly-open hydrogen fueling stations in the Northeastern US. Stations are expected open early in 2017. The company has a total of 12 hydrogen stations planned in the region, in collaboration with Toyota. Stations will span 300 miles across five states and will support the introduction of hydrogen fuel cell electric vehicles (FCEVs) on the East Coast. “Air Liquide firmly believes in the potential of hydrogen as a clean and reliable source of en","m_szDocBody":"air liquide announce location hydrogen fueling station northeastern save air liquide announced location publiclyopen hydrogen fueling station northeastern station expected open early company total hydrogen station planned region collaboration toyota station span mile state support introduction hydrogen fuel cell electric vehicle fcevs east coast air liquide firmly believe potential hydrogen clean reliable source energy transportation sector united state worldwide excited announce location public hydrogen fueling station northeast united state collaboration toyota ole hoefelmann ceo air liquide advanced technology llc vice president air liquide advanced business technology ab&t americas air liquide firmly believe potential hydrogen clean reliable source energy transportation sector united state worldwide deeply committed enabling widespread deployment hydrogen fuel cell technology required infrastructure station located hartford connecticut ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.gasworld.com/air-liquide-announces-northeast-us-hydrogen-stations/2010242.article","m_Places":["Northeastern United States","Toyota","East Coast","United States","Northeast United States","Americas","Hartford, Connecticut"],"m_People":["Ole Hoefelmann"],"m_Companies":["Air Liquide","Air Liquide Advanced Technologies Us Llc"],"m_BiGrams":["air liquide","hydrogen fueling","fueling station","united state"],"m_TriGrams":["hydrogen fueling station"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,3,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":118}
