{"m_szDocID":"617730","m_szDocTitle":"Hyundai-Kia Group Plans Blitz Attack into Electrified Vehicles | CleanTechnica","m_szYear":"2016","m_szDocSumamry":"Ok, it’s got collision avoidance with automatic braking. Now, we need the specs for rear seat headroom and legroom. Kyle Field Spend a lot of time in the back seat Mike? I don’t think this is the right car class if you do. A used Model S would be a good start…or another full size sedan. Prius/Ioniq/Insight are all on the small side. JamesWimberley It looks a weird and chaotic strategy to try everything with a huge number of new models and hope something will stick. Success usually comes from focus and choice. Jamset True. Hyundai and Toyota both going for fuel cell cars? Destined to fail. Fran","m_szDocBody":"collision avoidance automatic braking now spec rear seat headroom legroom kyle field spend lot time back seat mike dont car class model good startor full size sedan small side jameswimberley weird chaotic strategy huge number model hope stick success focus choice jamset true hyundai toyota fuel cell car destined fail frank fuel cell car perfect reality show hunting big foot ghost imagine extra drama add working hydrogen fueling station kyle field folk prowl big foot wait detour received tip elusive mile coming hydrogen fueling station cameras folk good kyle field hyundai electric planned toyota completely dropped ball bwollsch honda too eveee honda toyota exec thinking hydrogen order lol battery short range kyle field hoping taking seriously hydrogen doesnt good option level compared battery electric car eveee concerned volume long distance battery source competing company not waiting battery company catch freddy toyota honda half top selling model north america big pickup case decade toyota honda degree confidence continue fad german automaker huge achtung moment big segment expect theyre wide awake now expect interesting thing detroit continue churning big pickup fast make taking money bank real competitive electric pickup theyll dabble market hyundai wild card imho announcement compliance greenwashing alternatively running market test manufacturing pilot experience year aggressive optimised strategy freddy agreed taking existing model designed ground ice throwing drive train electrification them big question are phev priced comparable ice model not sale small today compliance car predict range evs move current ish mile range soul ish mile range price compliance car bit market research price sell volume sell lot phevs promote electric driving tony reye dont fact pure platform discussed frunk trunk performance low cog range supercharging etchow electric ioniq price tag compete model jamset normal face normal dashboard payasyougo chademo charging jim smith comparing production low spec tiny battery horrible performing production long range performance kind absurd supercharger crappy low power existent chademo network thought read thinking changing ccs standard kyle field level charging standard irrelevant early lesson moving leaf tesla level supercharging worksextremely well level fast charging painful board minute max mile functional barely stop gap solution hey let start building car people excited evsthen market demand level chargingaftermarket solution pop fact automaker arent building level charging car capable speak fact leadership dont drive evs tesla brilliant foresight early kyle field read august great stuff curious market evolve drove western kansas colorado wasnt there spent year year lol eveee yes formula hour driving half hour charging somewhere mean mile half hour charge bare minimum mile fit normal stop required real loss time kyle field completely agree tesla solution functional admittedly extremely long trip faster absolutely necessary eveee wonderful share recharge faster human brian great automaker produce electric car bring price mass production clean air city stop offshore oil drilling hottest year record effect global warming intensify shameful explosion horizon oil rig killed people ecological disaster followed leave dirty fossil fuel ground faster electrify car buse quicker this kyle field global warming climate change now fluctuation down agree thoughoilpoison board poison air poison water poison car poison economiesnot mention war fight let rid oil focus what important spend time fighting religion joking secularanimist global warming climate change thing global warming refer temperature increase earth system caused anthropogenic increase atmospheric simple physic climate change refer effect warming earth climate complex bobwallace term long argument changed suggest term global warming previously norm widespread term climate change now however simply untrue example seminal climate science work gilbert plass study carbon dioxide theory climatic change ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://cleantechnica.com/2016/04/08/hyundai-kia-group-plans-blitz-attack-electrified-vehicles/","m_Places":["Toyota","North America","Detroit","Tesla"],"m_People":["Tony Reyes","Jim Smith","Gilbert Plass"],"m_Companies":["Seat","Hyundai","Ball","Honda","Achtung!","Ices","Chademo Network","Gap","Poison","Theory","Climatic Change"],"m_BiGrams":["kyle field","global warming","climate change"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,5,4],"m_TriCnt":[],"m_iDocBodyWordCnt":581}
