{"m_szDocID":"617708","m_szDocTitle":"2019 Ford 'Model E' hybrid, electric car coming from Mexico plant?","m_szYear":"2016","m_szDocSumamry":"2019 Ford 'Model E' hybrid, electric car coming from Mexico plant? Email This Page To (separate emails with commas) Message (optional) Your email was sent successfully. Close 5,307 views Apr 7, 2016 Follow John Enlarge Photo Two years ago, Ford successfully fought efforts by Tesla Motors to register the name \"Model E\" for what we now know as the Tesla Model 3, unveiled last week to great fanfare. Now it appears that the Detroit automaker may plan to use that name itself on a dedicated vehicle coming in 2019 that will be offered as a hybrid, a battery-electric car, and a plug-in hybrid. If that","m_szDocBody":"ford model hybrid electric car coming mexico plant separate email commas message optional successfully close view follow john enlarge photo year ago ford successfully fought effort tesla motor model tesla model unveiled week great fanfare appear detroit automaker plan dedicated vehicle coming offered hybrid batteryelectric car plugin hybrid lineup sound slightly familiar should suite version offered hyundai ioniq miss ford hyundai dedicated hybrid target toyota prius aug adding batteryelectric version dedicated green vehicle trend fact dedicated electric plugin hybrid vehcle spun upcoming honda clarity hydrogen fuelcell sedan report year week industry trade automotive new noted ford join party vehicle launched ford focus enlarge photo built brandnew factory mexico start producing car ford announced week invest billion plant allnew north american assembly plant year company refused model built there widely assumed nextgeneration focus compact sedan hatchback slated move mexico current home wayne michiganwhich converted production crossover suvs truck see nextgeneration tesla electric car model may article research firm autoresearch solution suggested ford build prius competitor called model plant starting sam fiorani firm vice president global forecasting ford model include conventional hybrid batteryelectric car plugin hybrid plant total production volume car year suggested model account vehicle ford focus electric presentation ford electrification plan enlarge photo ford model derived compact architecture focus dedicated body gasolineonly version collectively replace current cmax hybrid cmax energi plugin hybrid lowvolume focus electric which range boost roughly mile cheque out hyundai ioniq darkhorse competitor prius bolt cmax tall hatchback introduced model year originally eparated mpg combined putting toyota prius model year rating cut twicefirst mpg combined mpg after widespread owner complaint epa investigation ford cmax eurospec paris auto show enlarge photo sale suffered reduction general market shift larger car crossover utility vehicle smaller car sedan hatchback cmax sale overtaken hybrid energi version ford fusion midsize sedan identical powertrain ","m_szGeo1":"Mexico","m_szSourceType":"source_news","m_szSrcUrl":"http://www.greencarreports.com/news/1103293_2019-ford-model-e-hybrid-electric-car-coming-from-mexico-plant","m_Places":["Tesla","Detroit","Mexico","Wayne, Michigan","Paris"],"m_People":["Sam Fiorani"],"m_Companies":["Tesla Motors","Hyundai","Honda","Automotive News","Autoresearch Solutions","Epa"],"m_BiGrams":["enlarge photo","plugin hybrid","ford model"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":300}
