{"m_szDocID":"617740","m_szDocTitle":"Industrial gas giant Air Liquide to build 12 hydrogen fuel stations in northeast U.S. - Canadian Manufacturing","m_szYear":"2016","m_szDocSumamry":"Industrial gas giant Air Liquide to build 12 hydrogen fuel stations in northeast U.S. In partnership with Toyota, the fuel stations aim to support the widespread roll-out of fuel cell vehicles April 8, 2016 April 8, 2016 by Cleantech Canada Staff The infrastructure is designed to support the introduction of mass-market FCVs, such as the Toyota Mirai, seen here on the production line at the fuel cell stack installation stage. PHOTO: Toyota HOUSTON—French industrial gas company Air Liquide is looking to get into the U.S. hydrogen economy on the ground floor. The multinational firm’s American arm","m_szDocBody":"industrial gas giant air liquide build hydrogen fuel station northeast partnership toyota fuel station aim support widespread rollout fuel cell vehicle cleantech canada staff infrastructure designed support introduction massmarket fcvs toyota mirai production line fuel cell stack installation stage photo toyota houstonfrench industrial gas company air liquide hydrogen economy ground floor multinational firm american arm announced location planned hydrogen fuel station northeast detailed plan build total cleanburning fuel stop region air liquide firmly believe potential hydrogen clean reliable source energy transportation sector united state worldwide ole hoefelmann ceo company advanced technology division said deeply committed enabling widespread deployment hydrogen fuel cell technology required infrastructure connecticut york host initial station hartford bronx respectively massachusett play host two braintree mansfield initial fuel pump public hydrogen station northeast dept energy public hydrogen station england nationally battery electric vehicle adoption california lead state hydrogen infrastructure development housing fuel stop partnering toyota motor corp project air liquide network support rollout hydrogen fuel cell vehicle including japanese automaker mirai station network eventually stretch state spanning mile add company tally hydrogen station installed worldwide slated open public early station fuel vehicle approximately minute share post ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.canadianmanufacturing.com/sustainability/industrial-gas-giant-air-liquide-to-build-12-hydrogen-fuel-stations-in-northeast-u-s-165484/","m_Places":["United States","Toyota","Houston — French","Connecticut","New York","Hartford","Massachusetts","Braintree","Mansfield","California"],"m_People":["Ole Hoefelmann"],"m_Companies":["Air Liquide","Cleantech Canada Staff","Advanced Technologies","Dept. Of Energy","Toyota Motor Corp"],"m_BiGrams":["air liquide","hydrogen fuel","fuel cell","fuel station","station northeast","hydrogen station"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4,4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":188}
