{"m_szDocID":"617731","m_szDocTitle":"Will Elon Musk's Tesla Model 3 Recharge the U.S. Electric Vehicle Market?","m_szYear":"2016","m_szDocSumamry":"Don’t miss out. Stay Informed. Get EcoWatch’s Top News of the Day. Email Few product launches in recent memory have captured as much attention as last week’s unveiling of the Tesla Model 3 electric vehicle (EV), Tesla’s first vehicle pitched at the mass market. Orders were flooding in even before Tesla CEO Elon Musk revealed the car to a giddy audience last Thursday evening, with prospective buyers queuing at Tesla stores throughout the day to place a deposit on a vehicle they might not even receive for two years or more. Tesla Model 3: cheaper than its predecessors, but is $35,000 really with","m_szDocBody":"dont miss out stay informed ecowatch top new day product launches recent memory captured attention week unveiling tesla model electric vehicle teslas vehicle pitched mass market order flooding tesla ceo elon musk revealed car giddy audience evening prospective buyer queuing tesla store day place deposit vehicle receive year more tesla model cheaper predecessor reach mainstream buyer photo credit tesla motor musk made case evs important future world combating rising greenhouse gas emission air pollution model important future tesla future evs promise sale growth automotive wunderkind tesla survive renew interest technology significant realworld impact introduction teslas flashy sedan piece place market mainstream battery price dropping chevrolet volt plugin hybrid nissan leaf batteryelectric vehicle hit showroom price gasoline rising expectation future evs shortly after president obama articulated goal million evs road committed billion investment manufacturing capacity recharging infrastructure deployment vehicle purchase incentive year later reality different market hybrid electric vehicle stagnating see below plugin hybrid batteryelectric vehicle sold date achieving percent vehicle sale conventional hybrid vehicle fared better price gasoline past year gas cheap sale suvs pickup booming evidence suggest mainstream car buyer simply green vehicle currently rising period gas price sale hybrid electric car started plateau fall photo credit hybridcarscom energy information administration prospect evs forward answer ly rapid reduction lithiumion battery price achieved falling percent kwh battery improvement potential significantly affect performance compared gasolinepowered car wave electric vehicle led tesla model chevrolet bolt promise mile electric range advocate hope sweet spot consumer midsize car affordable massmarket consumer suggested optimistic least however continued development secondgeneration evs challenge again regime dominated global automotive market past year techy treehugger massmarket transition evs occur remain uncertain falling battery price recent report bloomberg energy finance received widespread attention suggesting evs costcompetitive gasoline vehicle significant advance battery needed occur building market evs ecologically economically sustainable require cheap battery evs mainstream everyday car buyer understand technology wide range make model body style choose ubiquitous network fast charging station long trip tesla offer significant charging infrastructure coverage today growing network proprietary supercharger station tesla face challenge internally learn manufacture vehicle scale quality greatest impact model then benefit entire industry convincing consumer evs longer treehugger techy launching presale advance production tesla empowered people and counting car electric long model hit road struggling field electric car real vote confidence ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://ecowatch.com/2016/04/06/musk-tesla-model-3-evs/","m_Places":["Tesla","United States"],"m_People":["Elon Musk","Barack Obama"],"m_Companies":["Tesla Motors","U.s. Energy Information Administration"],"m_BiGrams":["tesla model","electric vehicle","battery price"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":379}
