{"m_szDocID":"623728","m_szDocTitle":"Sooner than you think? A prediction that electric cars will cause the next oil crisis : TreeHugger","m_szYear":"2016","m_szDocSumamry":"Sooner than you think? A prediction that electric cars will cause the next oil crisis via Paleofuture/ Arthur Radebaugh In the fifties and early sixties there was a wonderful newspaper series, Closer Than We Think, drawn by Arthur Radebaugh. In 1958 he predicted that we would soon be driving solar powered electric cars. Now Bloomberg Business is starting a video series called Sooner Than You Think that well might be more accurate. In their first episode, they look at the impact of the electric car and how it will cause the next oil crisis. For years everyone including TreeHugger worried about ","m_szDocBody":"sooner think prediction electric car oil crisis arthur radebaugh fifty early sixty wonderful newspaper sery closer think drawn arthur radebaugh predicted driving solar powered electric car bloomberg business starting video sery called sooner accurate episode impact electric car oil crisis year including treehugger worried peak oil assumed cost oil production afford anymore fracking oil sand deep water drilling brought supply stream oil price crash instead video bloomberg writer tom randall predict electric car oil crisis dont entire market tip supply demand fracking did good technology time buying alternative longer make sense smartphone past decade colour tvs gasoline car early century predicting timing shift difficult happen world change decade electric car bloomberg predict electric car suvs faster safer cheaper convenient gasoline counterpart extrapolating year growth rate and teslas forecast calculate electric car displace million barrel oil day production onstream caused oil crisis continue glut world cheap oil including oil company predict slower takeup electric car delay crisis inevitable point benefit electric car reduce cost battery storage store intermittent sun wind power move cleaner grid electric vehicle renewable power create mutually beneficial circle demand right lot country placing sketchy bet pipeline oil infrastructure related treehuggercom ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.treehugger.com/cars/sooner-you-think-prediction-electric-cars-will-cause-next-oil-crisis.html","m_Places":["Tesla"],"m_People":["Arthur Radebaugh","Tom Randall"],"m_Companies":["2020s"],"m_BiGrams":["electric car","oil crisis","car oil"],"m_TriGrams":["electric car oil","car oil crisis"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,4,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":193}
