{"m_szDocID":"640319","m_szDocTitle":"Mitsubishi scandal probe blames unrealistic goals for data falsification | PlasticsToday","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Mitsubishi scandal probe blames unrealistic goals for data falsification Cheating has been going on for 25 years, according to panel Image courtesy Jomphong/ freedigitalphotos.net. Here we are again: Another week, another automotive scandal related to mileage falsification data. Does anyone see a pattern here? First it was Volkswagen’s diesel cars that couldn’t really pass emissions tests because of test-cheating software installed in the vehicles. This week, it’s Mitsubishi Motors Corp. A group of lawyers asked by Mitsubishi to investigate mileage cheating at ","m_szDocBody":"mitsubishi scandal probe blame unrealistic goal data falsification cheating year panel image courtesy freedigitalphotosnet again week automotive scandal related mileage falsification data pattern here volkswagen diesel car couldnt pass emission test testcheating software installed vehicle week mitsubishi motor corp lawyer asked mitsubishi investigate mileage cheating japanese automaker found divided company set unrealistic goal employee simply couldnt say report tokyobased automaker acknowledged systematically falsified mileage data waggon space minicar produced nissan motor investigative panel data falsifying year wrongdoing systematic extensive escalated time probe included interview people found company lacked system checking team assigned improve mileage company employee compelled respect law fix wrongdoing department concerned performance utterly consciousness company work make sell car panel page report said government earlier found mitsubishi overstated mileage vehicle mitsubishi motor make outlander sportutility vehicle imiev electric car struggled year win back consumer trust scandal early coverup problem dating back included failing brake faulty clutches fuel tank prone falling off panel member speaking new conference company tokyo headquarter acknowledged recommendation followed past scandal shortly problem made public nissan announced taking stake mitsubishi turnaround scandal surfaced nissan sold mitsubishi minicar brand test pointed inconsistency data mitsubishi didnt lie mileage model sold overseas company offering cash rebate customer japan bought vehicle reported inflated mileage make extra gas mitsubishi chairman osamu masuko helped engineer nissan deal reiterated apology promised company penalise manager found responsible cheating hope mark beginning manufacturer told reporter panel finding released recent plante moran partner daron gifford marketwatch noted that supplier might put dieselgate scandal rearview mirror recently announced billion settlement federal regulator wont supply chain turn corner gifford noted still enormous uncertainty surrounding ultimate cost scandal huge ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.plasticstoday.com/automotive-and-mobility/mitsubishi-scandal-probe-blames-unrealistic-goals-data-falsification/75351313225000","m_Places":["Tokyo","Japan","United States"],"m_People":["Osamu Masuko","Daron Gifford"],"m_Companies":["Volkswagen","Diesel","Mitsubishi Motors Corp","Ap","Nissan Motor Co","Mitsubishi Motors","Nissan","Marketwatch"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":271}
