{"m_szDocID":"646308","m_szDocTitle":"More Jobs but US Unemployment Rate Stays at 6.7% - ABC News","m_szYear":"2014","m_szDocSumamry":"ABC News More Jobs but US Unemployment Rate Stays at 6.7% April 4, 2014 Morning Money Memo: The jobs market was slightly stronger than expected during the first three months of this year. Employers added 192,000 jobs last month, and the numbers for January and February were revised higher by 37,000, the U.S. Labor Department said today. The official unemployment rate was unchanged at 6.7 percent. But a half-million Americans started looking for work last month, and most of them found jobs. The increase in job-seekers is a sign that they are more optimistic about their prospects. \"Nearly every ","m_szDocBody":"abc new job unemployment rate stay morning money memo job market slightly stronger expected month year employer added job month number revised higher labour department today official unemployment rate unchanged percent halfmillion american started work month found job increase jobseeker optimistic prospect nearly industry adding payroll mark zandi chief economist moody analytic job growth business size classe big company small company holding back businesse confidence future say theyve nervous taking risk field dream moment jump leap faith add report showed increase overtime average hour worked employee government announced largestever settlement contaminated waste site anadarko petroleum pay billion cleanup thousand contaminated site nationwide billion site arizona country largest american indian reservation decade uranium ore mined lukachukai mountain providing navajos muchneeded employment leaving legacy death disease reservation uranium waste thrown mountainside carried rain remote scenic land hiker angler medicine men navajo shepherd mine site eventually abandoned cleaning contaminated waste federal judge texas hear argument general motor owner million recalled vehicle park repair made faulty ignition attorney owner car asked district court judge nelva gonzale ramos grant emergency order today corpus christi owner recalled car lose power moment expose occupant injury death urged judge intervene recall overseen national highway traffic safety administration proceed faulty switches linked death tesla eliminate sideview mirror car electric car company argue change make car aerodynamic boost fuel efficiency tesla joined auto industry trade seeking government approval change announcement day ruling national highway traffic safety administration requiring rearview cameras car weighing pound googleowned nest lab stopped selling smart smoke carbon monoxide detector now letter posted nest website ceo tony fadell nest protect sold safety problem fixed were enormously inconvenience caused issue statement said richard davy business correspondent abc new radio abcnewscom twitter daviesnow ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://abcnews.go.com/blogs/business/2014/04/more-jobs-but-us-unemployment-rate-stays-at-6-7/","m_Places":["United States","Arizona","Lukachukai Mountains","Texas","United States District","Corpus Christi","Tesla"],"m_People":["Mark Zandi","Nelva Gonzales","Tony Fadell","Richard Davies"],"m_Companies":["Abc News","U.s. Labor Department","Moody's","U.s. Government","Anadarko Petroleum","Nationwide","General Motors","National Highway Traffic Safety Administration","Google","Nest Labs","Twitter"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":284}
