{"m_szDocID":"646953","m_szDocTitle":"Tesla Model S & Model X Get 100 kWh Battery & Greater Range With P100D Option | CleanTechnica","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Tesla Model S & Model X Get 100 kWh Battery & Greater Range With P100D Option August 23rd, 2016 by Chris Boylan   They say nothing in life is certain but death and taxes. But you can add to that list: a bigger Tesla battery pack. Today Tesla officially announced a 100 kWh battery pack option for its Model S sedan and Model X SUV. When equipped with the “Ludicrous Speed” performance option (currently a requirement for the 100 kWh pack), a Tesla Model S P100D can now get from 0 to 60 MPH in just 2.5 seconds. That’s 0.3 seconds quicker than the previous model P90D","m_szDocBody":"tesla model model kwh battery greater range option chris boylan life death taxe add lista bigger tesla battery pack today tesla officially announced kwh battery pack option model sedan model suv equipped ludicrous speed performance option currently requirement kwh pack tesla model mph second second quicker previous model ludicrous speed larger pack increase eparated range charge estimated mile model kwh battery pack expected bring time low second down range increase mile estimated mile single charge people speculating announced march hacker found reference option buried tesla source code week rumour mill started kwh option wasleaked europe today official united state pricing tesla buyer standing order ludicrous speed upgrade added cost owner delivery ludicrous speed bring car upgraded fixed cost accommodate recycling current pack order premium comparably equipped require include ludicrous speed option itself option which include ludicrous speed expensive which include ludicrous speed bring thestartingprice model incentive starting priceof model fully loaded model option ring whopping plus destination fee time kwh battery offered topoftheline performance version withludicrous speed option ludicrous speed option longer lowercapacity kwh battery pack fully loaded tesla model equipped kwh battery ludicrous speed ring youll mile charge second nice teslas blog post announcing new model ludicrous speed quickest accelerating production car built seating people room seven long fairly small thelaferrari porsche spyder limitedrun milliondollar vehicle longer purchased new pop costco family load supply quickly cost factor give allelectric beast closer look drive electric car complete short survey electric car report date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2016/08/23/tesla-model-s-model-x-get-100-kwh-battery-greater-range-p100d-option/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IM-cleantechnica+%28CleanTechnica%29","m_Places":["Tesla","Europe","United States"],"m_People":["Chris Boylan"],"m_Companies":["Mph","Epa","Mill","Costco"],"m_BiGrams":["ludicrous speed","kwh battery","battery pack","tesla model","include ludicrous","speed option"],"m_TriGrams":["kwh battery pack","include ludicrous speed"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,6,4,3,3,3],"m_TriCnt":[3,3],"m_iDocBodyWordCnt":264}
