{"m_szDocID":"653709","m_szDocTitle":"Japan stocks fall, led by car makers - MarketWatch","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Japan stocks fall, led by car makers Published: Sept 24, 2015 5:50 a.m. ET Share Shares in China, Australia, South Korea stabilize Reuters Volkswagen’s crisis ripples across the global pond. By ChaoDeng Shares in Japan fell Thursday, tracking regional losses earlier this week, as the fallout from Volkswagen AG’s diesel-emissions scandal hit Japan’s auto-related sectors. The Nikkei Stock Average NIK, +0.29%  ended down 2.8%, as trading resumed after a three-day holiday. Volkswagen’s VOW3, +0.02%  alleged cheating on U.S. exhaust-emissions tests has raised the po","m_szDocBody":"japan stock fall led car maker published sept share share china australia south korea stabilise reuter volkswagen crisis ripple global pond chaodeng share japan fell thursday tracking regional losse earlier week fallout volkswagen ags dieselemission scandal hit japan autorelated sector nikkei stock average nik ended trading resumed threeday holiday volkswagen vow alleged cheating exhaustemission test raised possibility auto industry shift diesel engine cleaner technology share japanese autopart maker closely linked manufacture diesel engine german car maker fallen thursday ngk insulator ltd make diesel particulate philtre autopart maker aisin seiki fell share mazda motor corp mitsubishi motor corp lost industry shift diesel engine gasoline engine hybrid electric vehicle mitsushige akino chief fund manager ichiyoshi investment management losse follow resignation volkswagen chief executive martin winterkorn wednesday calamitous day europe largest auto maker environmental protection agency disclosed company software audi dieselpowered car manipulate result routine emission test read volkswagen accused software fool environmental regulator volkswagen direct rival japan toyota motor corp outperformed broader market toyota competing car marker global market investor sold volkswagen share putting money toyota hideyuki ishiguro senior strategist okasan security toyota pioneer hybrid technology price platinum usplv raw material diesel engine fell worry emission scandal push buyer gasoline electric car price rebounded ounce sank sevenyear low day earlier read volkswagen scandal whacking platinum price lifting palladium platinum price falling steadily roughly halved alltime mid analyst blame oversupply major producer south africa patchy autosale growth slowing consumption jewellery china broad losse japan follow dismal chinese manufacturing data wednesday fell year low stoking worry ripple effect slowing economy elsewhere share uneven australias s&p asx xjo hitting twoyear low previous session shanghai composite index shcomp gained south koreas kospi seu hong kong hang seng index hsi fell market indonesia malaysia singapore closed holiday late asia day taiwan central bank cut benchmark interest rate time sixandahalf year basispoint reduction rate lift price financial stability decision disappointing data showing slowdown island exportreliant economy prompted economist expect rate cut central bank lowered benchmark discount rate taiwan dollar usdtwd marked fresh sixyear low dollar losse coming minute central bank announcement currency dollar taiwan taiex closed bank announcement globe investor coming speech federal reserve chairwoman janet yellen university massachusettsamherst clue probability rise interest rate year speech week bank decided interest rate unchanged read dont expect yellen offer clue ratehike timing morgan stanley note speeches earlier year recent yellen stated economy improved expected increase policy rate point year key phrase missing thursday lower expectation liftoff uncertainty timing fed rate increase added worry chinas slowdown causing volatility stock currency region earlier week strengthening dollar pressured asian currency continued fall poor chinese economic reading share ended slightly lower overnight economic new europe helped offset weak chinese data marketwatch sept ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.marketwatch.com/story/japan-shares-fall-led-by-car-makers-2015-09-24","m_Places":["Japan","China","Australia","South Korea","United States","Europe","Toyota","South Africa","Shanghai","Hong Kong","Indonesia","Malaysia","Singapore","Asia","Taiwan","Amherst"],"m_People":["Mitsushige Akino","Martin Winterkorn","Hideyuki Ishiguro","Janet Yellen"],"m_Companies":["Reuters","Volkswagen","Volkswagen Ag","Diesel","Nikkei Stock Average","Ngk Insulators Ltd.","Aisin Seiki Co.","Mazda Motor Corp","Mitsubishi Motors Corp","U.s. Environmental Protection Agency","Audi","Toyota Motor Corp","Central Bank","The Central Bank","Federal Reserve","University Of Massachusetts","Morgan Stanley","Marketwatch"],"m_BiGrams":["diesel engine","motor corp","central bank","interest rate"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":448}
