{"m_szDocID":"661030","m_szDocTitle":"Beijing Company Unveils 'World's First Graphene Battery' That Charges Under 15 Minutes","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- HOME > TECH > Beijing Company Unveils 'World's First Graphene Battery' That Charges Under 15 Minutes Beijing Company Unveils 'World's First Graphene Battery' That Charges Under 15 Minutes C. J. | Jul 12, 2016 10:53 PM EDT The G-King battery pack is said to recharge between 13 and 15 minutes, making it faster than the commonly used Li-ion batteries. (Photo : YouTube) A Beijing-based company launched the “world’s first graphene battery” that can recharge within only 15 minutes, reports said. Released by Dongxu Optoelectronics, the G-King battery packs 4,800mAh an","m_szDocBody":"home tech beijing company unveil world graphene battery charge minute beijing company unveil world graphene battery charge minute edt gking battery pack recharge minute making faster commonly liion battery photo youtube beijingbased company launched world graphene battery recharge minute report said released dongxu optoelectronic gking battery pack mah refill lost charge minute make time faster liion battery commonly adopted mobile device advertisement dongxu yearold manufacturer listed shanghai stock exchange made announcement friday beijing tech asia graphene type carbon time stronger time lighter steel study show change technology surrounding battery today paving flexible superlightweight power source making future mobile device slimmer lighter addition graphene provide power drone electric car device discharge energy faster existing technology dongxus presentation delivered chairman zhaoting showed graphene battery charging cycle tech asia however noted realising application technology long off dongxu leave clue plan putting product consumer level meanwhile prototype demonstrated graphene mobile world congress february company called flexenable showed curved display wrap wrist watch maker zap&go showcased sandwich thin aluminium foil layer coated graphene ink digital trend layer result huge surface area enable power quickly technology graphene technology blended virtual reality mwc company invented pair glove made graphene determine temperature read gesture still remain adoption graphene consumer product people hoped advertisement edt","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://en.yibada.com/articles/140605/20160712/graphene-battery-worlds-first-graphene-battery-graphene-technology.htm","m_Places":["Beijing","Mobile","United States","Asia"],"m_People":["Li Zhaoting"],"m_Companies":["Beijing Company","Youtube","Facebook","Shanghai Stock Exchange","Congress","Zap","Graphene Technology"],"m_BiGrams":["graphene battery","world graphene","charge minute"],"m_TriGrams":["world graphene battery"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":205}
