{"m_szDocID":"663619","m_szDocTitle":"Intel and news for the Rare Earths & Technology Metals sector | InvestorIntel","m_szYear":"2016","m_szDocSumamry":"dateText -------------------- August 27, 2016  August 26, 2016  August 26, 2016  textArticle -------------------- Intel and news for the Rare Earths & Technology Metals sector  InvestorIntel is the most trusted online sources of independent investor information on the technology metals market  InvestorIntel  One of the most trusted sources of independent investor information  HOME  TECHNOLOGY  METALS  GOLD, SILVER &  BASE METALS  TECHNOLOGY  AGRIBUSINESS  & MMJ  URANIUM  & ENERGY  BIOTECH  CLEANTECH  OIL & GAS  MARKET  ANALYSIS  Intel  Stocks  Videos  News  Contact  Post navigation  ←  Older p","m_szDocBody":"intel new rare earth technology metal sector investorintel trusted online source independent investor information technology metal market investorintel trusted source independent investor information home technology metal gold silver base metal technology agribusiness mmj uranium energy biotech cleantech oil gas market analysis intel stock videos new contact post navigation older post japan daido steel rare earth magnet plant plan recently china proposed long experienced rare earth trader export separated magnet specific rare earth metal usa china young trader laughed suggestion older simply material quality price competitive sharp eyed reader investorintel yesterday editor jack lifton comment mark smith strategic importance government niocorp niobium scandium mark smith president ceo executive chairman niocorp development ltd tsx otcqx niobf interview investorintel editor fred cowan discuss strategic importance niobium scandium specifically mark explain substitute niobium oil gas industry make steel lighter stronger temperature corrosion resistance niobium editor investorintel scandium international advance nyngan scandium project scandium international mining corp tsx scy reported progress nyngan scandium project world advanced premining scandiumalone mining undertaking positive metallurgical result confirmed previously recommended programme listed filing nyngan located south wale australia completion project expected centrepiece expansion scandiumaluminum alsc industry current supply scandium editor luc duchesne nevada zinc ceo staying ahead curve lone mountain bruce durham president ceo director nevada zinc corp tsxv nzn interview investorintel editor fred cowan discuss percent rise share price competitive stage process acquiring project discuss drill result nevada zinc owned lone mountain project nevada leachable editor tracy weslosky russia launches production highpurity scandium ural aluminium plant russias largest aluminium producer part rusal plan start massive production scandium oxide purity year company plan company initial stage volume production reach scandium oxide year possibility significant increase editor eugene gerden comment almonty industry lewis black metal tungsten lewis black chairman president ceo almonty industry inc tsxv aii interview investorintel editor fred cowan discuss the metal about touches everybody live everyday discussion lewis explain almonty management team expertise ly generation tungsten knowledge existing portfolio global tungsten project andalmonty plan editor investorintel alkane ink worldwide zirconium deal minchem ltd australian listed gold producer alkane resource ltdasx alk otcqx anlkyrevealed signed marketing sale agreement dubbo zirconia project dzp ceramic manufacturer minchem ltd zirconium material produced dzp minchem ltd formed management buyout mineral chemical division palabora europe ltd wholly owned subsidiary palabora mining ltd editor lara smith talga rubber hit road noted past key word sum vittangi cheap cheap cheap music investor ear day project favour capex spoil show mantra tyre saying production production production market picked truism editor christopher ecclestone understanding graphene part polymer nanocomposite graphene polymer nanocomposite sound bit mouthful doesnt term basically mean adding lot piece graphene plastic create material interested read composite new glass fibre reinforced plastic grp make boat pipe container carbon fibre technology formula car aerospace application editor adrian nixon comment lifton perspective passing paradigm paradigm generally accepted model make sense understand logical continuity another set data guess related copernican world view example replaced held ancient simplest explanation universe revolved editor jack lifton comment lithiumion battery key solving future energy need introduction technology metal holdpromise key player inmeeting society pressing longterm goal providing reliable mean reducing dependence fossil fuel future energy need focuse key component rechargeable lithiumion battery lib electric vehicle employing lib prime candidate future reduction fossil fuel editor reed izatt phd comment alkane resource zirconium beginning word word zirconium back mist time intriguingly named dzp alkane resource asx alk otcqx anlky commonly dubbo zirconium project rare earth and metal hafnium project mere acronym company morphed name project time editor christopher ecclestone comment northern graphite greg bowe bullish graphite price northern graphite corp tsxv ngc otcqx ngphfown interest bissett creek largeflake graphite deposit located eastern ontario transcanada highway hour road port montreal investorintel senior editor christopher ecclestone northern graphite noisemaker doer editor robin bromby comment marchese texas mineral resource extremely lucrative return extract scandium coal texas mineral resource corp otcqx tmrcis explorationstage mining company flagship property round top mountain sierra blanca hudspeth county texas texas bureau economic geology recognised unique geology round top mountain year ago existed rare earth element found mountain time changed oneexample editor robin bromby comment tesla unhitching waggon company mining subsector wondering edit corporate presentation order tesla onetime motor pardon pun stock price stumble start mere manufacturer ford long warned hitching waggon single horse brought risk editor christopher ecclestone comment china rare earth development influence rare metal world didnt reasonable profit qinhua wang vicechairman china nonferrous metal industry association speaking quote included wakeup call paper written couple month ago londonbased royal chemistry david abraham director technology rare electronic material centre editor robin bromby comment post navigation older post comment louis pearson japan daido steel rare earth magnet plant plan jack lifton japan daido steel rare earth magnet plant plan louis pearson japan daido steel rare earth magnet plant plan moore japan daido steel rare earth magnet plant plan jack lifton japan daido steel rare earth magnet plant plan john ormerod japan daido steel rare earth magnet plant plan jeff thompson japan daido steel rare earth magnet plant plan jack japan daido steel rare earth magnet plant plan bill japan daido steel rare earth magnet plant plan tim ainsworth lifton perspective passing paradigm tim ainsworth lifton perspective passing paradigm tim ainsworth lifton perspective passing paradigm jack lifton lifton perspective passing paradigm hackenzac lifton perspective passing paradigm new release nevada energy metal lithium exploration programme underway black rock desert nevada source nevada energy metal inc the company tsxv bff otcqb ssmlf frankfurt aafbv pleased announce surface sampling programme designed test lithium value playa evaporate initiated company owned black rock desert project geochemical sample point arranged grid pattern line spaced arafura project update talga complete sale gold project pilbara alkane resource limited full year financial result year ended alkane resource limited full year statutory account alix acquire cross lake lithium property manitoba source alix resource corp tsxv aix fse alix company pleased announce acquisition interest cross lake lithium property cross lake property located north winnipeg manitoba cross lake property comprise mineral exploration licence mel encompassing hectare located nevada energy metal pay full annual blm fee nevada lithium project source nevada energy metal inc the company tsxv bff otcqb ssmlf frankfurt aafbv pleased announce paid full annual bureau land management blm maintenance fee company lithium project located nevada annual maintenance fee totaling usd cad paid sept elcora release anode test result source troy grant president ceo elcora advanced material corp tsxv era otcqb ecorf frankfurt elm the company elcora pleased successful initial test result elcoras proprietary graphite processe lithium ion battery anode purpose test validate elcoras processe grade size analysis bet surface area lithium australia advise quotation litce lithium australia cinovec project lmax licence agreement update alset channel sample return grade graphitic carbon champion property source alset energy corp tsxvion alset the company pleased announce result surface channel sampling programme completed %owned champion graphite property located kenora ontario total trenches completed intermittently distance approximately ranged long wide lithium australia removal official quotation litcd galaxy resource sal vida revised dfs confirm robust operation galaxy resource announce board director lithium australia expand support ligeneration galaxy resource limited updated top range report lithium australia update pilot plant progress hinterland close tranche private placement source hinterland metal inc tsx venturehmi hinterland company announce closing nonbrokered private placement offering the offering unit the unit price unit gross proceed unit consist common share common share purchase warrant warrant entitle holder almonty announce closing million brokered private placement financing source distribution newswire service dissemination united state almonty industry inc almonty tsxv aii announce closed previously announced private placement common share price common share gross proceed almonty the offering offering made canadian metal biweekly update status mcto source canadian metal inc the corporation csecme announce application management cease trade order mcto granted corporation required provide biweekly status report accordance national policy time corporation file amended technical report the amended report elcora reveal lithium ion battery anode strategy source troy grant president ceo elcora advanced material corp tsxv era otcqb ecorf fse elm the company elcora pleased announce company developed proprietary technology order reduce eliminate stage lithium ion battery anode manufacturing process technology potential eliminate cancana retain national equicom manage investor relation programme source cancana resource corp tsx venturecny the company cancana pleased announce engaged national equicom national provide strategic investor relation financial communication service national manage communication stakeholder interested party bringing experience resource build comprehensive picture bmc project alix commence work corne abitibi quebec source alix resource corp alix company aixtsxv nfrankfurt pleased announce initiation phase exploration programme corne west canada lithium property located adjacent strike chinesebased jilin jien nickel industry jilin quebec lithium mine property programme consist lithium australia appointment proposed ipo graphite australia galaxy resource limited gmm completion compulsory acquisition pacific north west capital acquire interest eagle pegmatite manitoba part lithium project source pacific north west capital corp pfn company tsxv pfn fse otcqb pawef announce acquired interest eagle pegmatite manitoba mustang mineral corp pegmatite part lithium project held pfn owned subsidiary lithium canada development inc eagle nevada energy retain investor relation consultant source nevada energy metal inc company tsxv bff otcqb ssmlf frankfurt aafbv announce company retained albert rick timcke consultant provide investor relation service company timcke provide investor relation service company including limited communication existing shareholder future investor assistance nemaska lithium prep whabouchi mine bulk sample modular mill installation source nemaska lithium inc nemaska lithium corporation tsxnmxotcqxnmkef pleased provide update bulk sample modular mill installation whabouchi mine located eeyou istchee jame bay region quebec canada nemaska lithium applied certificate authorization instal operate selfcontained dense media separation government grant support lithium australias sileach lithium processing technology talga deliver valueadded graphene product alkane resource limited zirconium marketing sale agreement signed dzp green swan capital corp announce continued success sudbury source green swan capital corp tsxv gsw green swan announce latest strong result ongoing work programme %owned sudbury cobalt asset copper prince significant cobalt value exceeding cobalt tested areas areas elevated gold see chart below green swan ceo peter ucore produce dysprosium superligone pilot plant source ucore rare metal inc tsx ventureucuotcqxuuraf ucore company pleased update continuing performance superligone rare earth element ree separation pilot plant the plant superligone pilot plant dysprosium produced pregnant leach solution pls derived company bokandotson ridge project alaska receive free daily investorintel update investorintel member copyright investorintel corp right reserved investorintel corp proedge text photos graphic logos commercial purpose reproduced published broadcast rewritten broadcast redistributed directly indirectly medium investorintel corp held liable delay inaccuracy error omission investorintel corp original content action consequence investorintel corp material stored part computer personal noncommercial use newswire service investorintel corp obtain release subject individual group entity contained photograph graphic quoted text further clearance obtained owner trademark copyrighted material mark material included investorintel corp photos content solely responsible obtaining release individual entity investorintel corp material agree indemnify investorintel corp losse damage expense including reasonable attorney fee incur result based material violation term disclaimer investorintel corp owner operator investorintel affiliated site established rule ensure appearance impropriety part proedge editorial writer proedge editorial article opinion writer reliance article sole risk writer registered investment advisor make kind investment decision relation article stock discussed obtaining advice registered investment advisor fact relied writer generally provided subject company gathered writer public private source fact error opinion writer materially different time proedge writer utilise advertorial company source video interview video content opinion guest interviewee necessarily reflect opinion investorintel represent leading company sector covered site advertiser publicly disclosed time listed alphabetical order column affiliated section question concern contact directly proedge own investorintelcom ree leader index bloomberg ticker reel week month month month month year technology metal gold silver technology agbusiness mmj uranium energy biotech cleantech oil gas market analysis sitemap home contact disclaimer investorintel corp right reserved ","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://investorintel.com/technology-metals/","m_Places":["Japan","United States","China","Mark","New South Wales","Australia","Nevada","Lone Mountain","Russian Federation","Ural","Dubbo","Zirconia","Ontario","Canada","Texas","Round Top Mountain","Blanca","Hudspeth County, Texas","Tesla","London","Frankfurt","Sale","Pilbara","Alix","Manitoba","'alix'","Winnipeg, Manitoba","Quebec","West Canada","Sudbury","Alaska"],"m_People":["Daido Steel","Jack Lifton","Mark Smith","Fred Cowans","Luc Duchesne","Bruce Durham","Tracy Weslosky","Eugene Gerden","Lara Smith","Christopher Ecclestone","Adrian Nixon","Lithium Ion","Reed M. Izatt","Greg Bowes","Robin Bromby","Qinhua Wang","David Abraham","Louis Pearson","Ed Moore","John Ormerod","Jeff Thompson","Tim Ainsworth","Cross Lake","Sal De Vida","Timcke","Green Swan"],"m_Companies":["Intel","Cleantech","U.s. Government","Niocorp Developments Ltd.","Scandium International Mining Corp.","Nevada Zinc Corp.","Almonty Industries","Almonty Industries Inc.","Minchem Ltd.","Alkane Resources Ltd.","Palabora Europe Ltd.","Palabora Mining Co. Ltd.","Capex","Paradigm","Guess","Northern Graphite Corp.","Texas Mineral Resources Corp.","Texas Bureau Of Economic Geology","Industry Association","Royal Society Of Chemistry","Metals Inc.","Alkane Resources Limited","Alix Resources Corp.","Blm","Bureau Of Land Management","Elcora Advanced Materials Corp.","Alset Energy Corp.","Galaxy Resources Limited","Venture","U.s. Newswire","The United States Almonty Industries Inc.","“almonty”","Canadian Metals Inc.","Cme","Cancana Resources Corp.","Bmc","Jilin Jien Nickel Industry Co.","'jilin'","Pacific North West Capital Corp.","Mustang Minerals Corp.","Lithium Canada Development Inc.","Mill","Nemaska Lithium Inc.","Green Swan Capital Corp.","Investorintel Corp."],"m_BiGrams":["rare earth","investorintel corp","japan daido","daido steel","steel rare","earth magnet","magnet plant","plant plan","pleased announce","corp tsxv","alkane resource","perspective passing","passing paradigm","nevada energy","metal inc","the company","lithium australia","technology metal","jack lifton","president ceo","lifton perspective","energy metal","resource limited","investor relation","editor christopher","christopher ecclestone","resource corp","company tsxv","cross lake","lithium project","galaxy resource","pilot plant","private placement","common share","nemaska lithium","green swan","oil gas","interview investorintel","investorintel editor","editor fred","fred cowan","cowan discuss","nevada zinc","almonty industry","minchem ltd","northern graphite","editor robin","robin bromby","bromby comment","plan jack","tim ainsworth","ainsworth lifton","source nevada","inc the","tsxv bff","bff otcqb","otcqb ssmlf","ssmlf frankfurt","frankfurt aafbv","lithium property","company pleased","property located","lithium ion","ion battery","battery anode","capital corp"],"m_TriGrams":["japan daido steel","daido steel rare","steel rare earth","rare earth magnet","earth magnet plant","magnet plant plan","perspective passing paradigm","lifton perspective passing","editor christopher ecclestone","nevada energy metal","interview investorintel editor","investorintel editor fred","editor fred cowan","fred cowan discuss","editor robin bromby","robin bromby comment","plant plan jack","tim ainsworth lifton","ainsworth lifton perspective","energy metal inc","metal inc the","company tsxv bff","tsxv bff otcqb","bff otcqb ssmlf","otcqb ssmlf frankfurt","ssmlf frankfurt aafbv","alkane resource limited","lithium ion battery","ion battery anode"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[17,11,10,10,10,10,10,10,7,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3],"m_TriCnt":[10,10,10,10,10,10,6,5,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3],"m_iDocBodyWordCnt":1943}
