{"m_szDocID":"667518","m_szDocTitle":"Xcel proposes low-cost, off-peak rates for plug-in cars - StarTribune.com","m_szYear":"2016","m_szDocSumamry":"Xcel proposes low-cost, off-peak rates for plug-in cars Owners would charge them overnight and could pick wind power.  By David Shaffer Star Tribune January 30, 2015 — 8:58pm Brian Davies • The Register-Guard Electric cars, like this one in Eugene, Ore., are commonly charged in the garage. Xcel Energy proposed offering a low-cost and off-peak rate to customers. Purchase: Order Reprint Plugging in an electric vehicle soon will get significantly cheaper for Minnesota customers of Xcel Energy Inc., the state's largest power company. The utility asked state regulators Friday to approve a rate for ","m_szDocBody":"xcel propose lowcost offpeak rate plugin car owner charge overnight pick wind power david shaffer star tribune brian davy registerguard electric car eugene ore commonly charged garage xcel energy proposed offering lowcost offpeak rate customer purchase order reprint plugging electric vehicle significantly cheaper minnesota customer xcel energy inc state largest power company utility asked state regulator approve rate overnight home charging electric car percent discount residential service rate approved proposed roll month xcel said provide option customer chris clark president xcel minnesota regional operation interview friday this future customer tailor energy service are clark electric vehicle owner save month proposed rate cent kilowatthour offered weekday hour weekend holiday standard fuel charge added rate cent kwh monthly basic charge cover cost separate electric metre navigant research cleantech consulting research firm boulder colo electric plugin car nationwide minnesota source offer lower estimate xcel utility offer plugin rate firm said kevin schwain xcel manager emerging customer programme estimated electric car xcel minnesota territory million customer schwain offpeak rate equate centspergallon gasoline cheaper night xcel energy inc proposed lowercost option refuelling electric vehicle home offpeak hour rate cent kilowatt hour cent rate cent fuel adjustment discount home rate peak hour weekday day weekend holiday basic charge monthly cover separate metre status proposal pending minnesota public utility commission proposal when move fossil fuel evs save lot cut half jukka kukkonen principal pluginconnect minnesota electric vehicle market technology consulting firm own nissan leaf driving mile cost xcel programme said metroarea power cooperative pioneered offpeak electric vehicle rate state dakota electric association starting connexus energy wrighthennepin cooperative electric association utility including xcel offer offpeak rate purpose state law investorowned utility offer plugin rate minnesota power duluth otter tail power fergus fall offer programme time day count expert plugin car draw electricity typical household utility electric car refuelling daytime early evening power demand wholesale price highest connexus customer rapidly charge car retail power rate highdemand period lose year cfo mike bash dakota electric spokesman joe miller customer electric vehicle signed offpeak rate charging load peakdemand time said plugging electric car part evening routine sam megan villella blaine tesla chevrolet volt every night oclock garage plug car kid bed sam villella connexus customer villella pay month charge car driven mile full advantage programme car owner special charger villella unit garage volt easily charge car overnight timer set charge offpeak only xcel nation windpowerreliant utility propose give plugin vehicle owner option purchase windpower electric car windsource option cost month xcel offpeak power carbon free anyway nighttime power nuclear power plant run steadily wind farm breeze night xcel lowercost electric car rate time diving gasoline price navigant analyst scott shepard trend disrupt electric vehicle sale shown strong growth year rather dealer compensating lower price gas selling lower price move vehicle making good time buy email ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.startribune.com/xcel-proposes-low-cost-off-peak-rates-for-plug-in-cars/290353581/","m_Places":["Eugene, Ore.","Minnesota","Boulder, Colo.","United States","Hennepin","Falls"],"m_People":["David Shaffer","Brian Davies","Chris Clark","Kevin Schwain","Jukka Kukkonen","Sam","Megan Villella","Scott Shepard"],"m_Companies":["Star Tribune","Xcel Energy","Xcel Energy Inc.","Nationwide","All Day","Minnesota Public Utilities Commission","Otter Tail Power Co.","Volts"],"m_BiGrams":["electric car","electric vehicle","offpeak rate","rate cent","plugin car","xcel energy","charge car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,7,5,4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":464}
