{"m_szDocID":"673385","m_szDocTitle":"The Australian Patent Office Confers \"Graphite Ore-to-Graphene Production Process\" Patent Rights","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- August 25, 2016 09:47 ET The Australian Patent Office Confers \"Graphite Ore-to-Graphene Production Process\" Patent Rights OTTAWA, ONTARIO--(Marketwired - Aug. 25, 2016) - Grafoid Inc., a world leading graphene research, application development and investment company, is pleased to announce the Australian patent office, IP Australia, has ruled on the validity of a process that converts raw graphite ore to graphene. This is the second time a national government has ruled on the validity of the patent application. The first was the U.S. government. It granted Pate","m_szDocBody":"australian patent office confer graphite oretographene production process patent right ottawa ontariomarketwired aug grafoid inc world leading graphene research application development investment company pleased announce australian patent office australia ruled validity process convert raw graphite ore graphene time national government ruled validity patent application government granted patent inventor inventor process are gordon chiu founding partner president chief operating officer grafoid inc and drs loh kian ping junzhong national university singapore nus national university singapore assignee patent granted exclusive licence graphite pte ltd singaporebased company worldwide production right graphene product derivative produced mesograf trademark name grafoid inc hold majority ownership graphite pte ltd turn graphite negotiated grafoid global marketing sale agency right grafoid act exclusive agent mesografbased product graphite produce mesograf production facility singapore grafoid global technology centre ggtc kingston ontario canada mesograf product derived onestep patented process forming expanded hexagonal layered mineral derivative electrochemical charging process produce application friendly minimaldefect highenergy density layer graphene utilising safe nondestructive extraction process leaving lowest ecological footprint unique patented process result regarded global standard economically scalable highpurity graphene product tailored industrial commercial application raw graphite oretographene process resulting derivative graphene product form backbone world patentrecognized process drive affordable mass commercialization graphene application grafoid joint venture partner world incorporating mesograf product variety application including generation energy creation storage coating composite ruling negate claim challenge australian graphite mining company inventor world industrialscale graphene production directly raw graphite ore electrochemical charging australias final decision process inventor provided irrefutable evidence intellectual property creation the ruling stand precedentsetting victory invention protected jurisdiction chiu the grant patent clear indication claim close discovery commenting patent grant gary economo ceo grafoid graphite zero said move forward global corporate development plan intend vigorously defend market position patent application filed process inventor australia patent final ruling grafoid inc grafoid complete solution graphene company company expertise product processe transformative industrialscale graphene application partnership leading corporation institution world privately held canadian corporation grafoid invest graphene application economically scalable production processe graphene graphene derivative raw unprocessed graphite ore focus graphite inc hold significant interest grafoid inc incorporated grafoid global enterprise platform include subsidiary company engaged development mesograf material product development service include limited mesograf lithium battery electric vehicle consumer electronic industrial energy storage additive manufacturing material including metal alloy graphene polymer powder printing polymer plastic rubber elastomer composite material fibre science including aluminium alloy coating lubricant fire retardant material thermal management solution shielding solar solution analytical testing laboratory service grafoid research supported industrial research assistance programme irap national research council canada and grafoid received million investment tech fund sustainable development technology canada sdtc develop technology automate mesograf graphene production endproduct development sdtc mandated government canada support clean technology company move technology market information grafoid visit contact information ","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://www.marketwired.com/press-release/australian-patent-office-confers-graphite-ore-graphene-production-process-patent-rights-2153408.htm","m_Places":["Ottawa, Ontario","Australia","Singapore","Kingston, Ontario","Canada"],"m_People":["Gordon Chiu","Kian Ping","Junzhong Wang","Dr. Chiu","Gary Economo"],"m_Companies":["Australian Patent Office","Marketwired","Grafoid Inc.","U.s. Government","National University Of Singapore","Nus","About Grafoid Inc.","Focus Graphite Inc.","National Research Council Of Canada"],"m_BiGrams":["grafoid inc","raw graphite","graphite ore","graphene product","grafoid global","graphene application"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":450}
