{"m_szDocID":"675930","m_szDocTitle":"Birinyi Sees S&P 500 at 1,900 by July as Shorts Miss 6 Drop","m_szYear":"2014","m_szDocSumamry":"     A   A    U.S. stocks have too much momentum to make betting against the Standard & Poor’s 500 Index a winning strategy and the gauge will probably reach 1,900 next quarter, according to money manager Laszlo Birinyi. Birinyi, the founder of Birinyi Associates Inc. and one of the first analysts to advise clients to buy when stocks were bottoming after the 2008 financial crisis, said in a phone interview Feb. 7 that the benchmark gauge for U.S. equities will increase almost 6 percent by July. It fell 5.8 percent in the three weeks staring Jan. 15, losses he said signal healthy skepticism tha","m_szDocBody":"stock momentum make betting standard poor index winning strategy gauge reach quarter money manager laszlo birinyi birinyi founder birinyi associate inc analyst advise client buy stock bottoming financial crisis phone interview feb benchmark gauge equity increase percent july fell percent week staring jan losse signal healthy scepticism set stage gain dont market shrug off birinyi westport connecticut stop deep breath market sort negative reaction problem turkey argentina didnt make uncomfortable weakening currency argentina turkey cut federal reserve stimulus slower economic growth china s&p worst performance start year trillion erased share price globally retreat failed stir bearish speculator left bet s&p company lowest level record data compiled bloomberg starting show gauge future slid percent london lesson learned short seller learned lesson year company benchmark index climbed birinyi said time bargain real youre bull said situation daytoday basis give opportunity advantage short sale trader borrow stock sell hoping profit replacing decline share rose week report suggested economy weather fed stimulus reduction s&p added percent snapping longest weekly losing streak gauge rallied percent day oct push priceearning ratio fiveyear average data compiled bloomberg yearold investor defied market pessimist fiveyear bull market s&p percent writing stock bottom company earning dragged lower greece debt crisis index percent then year later gauge comparison prior bull market suggested reach month five short retreat share borrowed sold short total percent s&p outstanding stock percent data compiled bloomberg londonbased markit ltd fewer investor positioned advantage selloff week s&p percent rally year burned short seller oliver pursche suffern yorkbased money manager gary goldberg financial service short market fed active earning coming strong economic environment continue strengthen fairly positive pursche feb phone interview broadly longterm short expensive point cycle lot short market tesla zillow goldman sach inc index mostshorted company gained percent year company tesla motor inc zillow inc rallied tesla billionaire elon musk electric vehicle company began percent share sold short stock rallied percent feb bearish bet tumbled percent zillow operate real estate website rallied percent start short interest fell percent free float percent hedge fund trimmed short position isi llc isi index hedge fund long versus short bet rose feb week ending oct data yorkbased research firm show isis index increase manager growing bullish equity measure dropped percent past month wary people short market feeling wary joseph quinlan chief market strategist trust bank america private wealth management oversee billion phone interview york dont bet economy growing percent year short interest big bet worse better stock tumbled past decline short interest bearish bet s&p stock slid percent percent share data compiled markit bloomberg benchmark fell percent aug s&p stripped aaa credit rating europe debt crisis deepened short interest climbed percent s&p share year gauge rose percent low index rose percent fair nobody betting market big way predictive power brad mcmillan chief investment officer waltham massachusettsbased commonwealth financial network feb phone interview firm billion management expect happen happen s&p percent decline jan feb doesnt suggest advance over birinyi mean calm blanketed market year lifting chicago board option volatility index measure investor concern averaged percent year lowest biggest jump record s&p gained lost average percent day compared percent fourth quarter data compiled bloomberg weve bit detour road isnt smooth been rally intact birinyi said s&p fallen percent time previously start rally recovering losse month average data compiled bloomberg bespoke investment show birinyi latest retreat different investor shift strategy succeed market year steady consistent market lot volatility said tremendous stock market volatility market volatility market alert trade copyright bloomberg new right reserved comment close ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.newsmax.com/finance/InvestingAnalysis/laszlo-birinyi-S-P-500-stocks-rally/2014/02/10/id/551854/","m_Places":["United States","Westport, Connecticut","Turkey","Argentina","China","London","Greece","Suffern, New York","Tesla","New York","Europe","Waltham, Massachusetts","Chicago"],"m_People":["Laszlo Birinyi","02/06/2000 00:00:00","Oliver Pursche","Gary Goldberg","Elon Musk","Joseph Quinlan","Brad Mcmillan"],"m_Companies":["Standard & Poor","Associates Inc.","Signal","Federal Reserve","Bull","Markit Ltd.","Goldman Sachs Group Inc","Tesla Motors Inc.","Zillow Inc.","Isi Group Llc.","U.s. Trust","Bank Of America","Aaa","Commonwealth Financial Network","Intact","Bespoke","Investment Group"],"m_BiGrams":["data compiled","compiled bloomberg","phone interview","short interest","fell percent","rallied percent","s&p percent","short market","percent year"],"m_TriGrams":["data compiled bloomberg"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,5,4,4,3,3,3,3,3],"m_TriCnt":[5],"m_iDocBodyWordCnt":581}
