{"m_szDocID":"679157","m_szDocTitle":"If you like Tesla and Ford, thank your government - MarketWatch","m_szYear":"2014","m_szDocSumamry":"Tesla Tesla Model S f you want congressmen to bore you, ask about the track record of President Barack Obama’s $36 billion-and-counting green-energy loan-guarantee program. Then get ready for an ideology-a-palooza of people talking past each other. But not for long. You say Solyndra, I say SolarCity. You say Fisker Automotive, I say Ford F-150 and Tesla. Before going too far into a parody of George and Ira Gershwin, let’s lay out the newly disclosed facts. Then, maybe, we can call the whole argument off. Boomers vs. millennials: Buy music or stream it? (2:08) Millennials stream music through s","m_szDocBody":"tesla tesla model congressmen bore you track record president barack obamas billionandcounting greenenergy loanguarantee programme ready ideologyapalooza people talking past other long solyndra solarcity fisker automotive ford tesla parody george ira gershwin let lay newly disclosed fact then maybe call argument off boomer millennial buy music stream millennial stream music site spotify pandora boomer remember time people bought vinyl record listen music government report department energy net billion muchcriticized loan programme greenenergy technology loan helped fund tesla ford other failure energy dept earn billion interest payment loan funded amid stimulus doe report week hooha blown million loan solarpanel maker solyndra writeoff totaled million leaving washington wind billion good put pespective loss ratio loan guarantee allowance loan losse jpmorgan chase allowance reached moreover unlike private institution doe stepped cleantech credit moving market seized tough doe game town single venture fund written committed capital venture capitalist steve westly firm backed tesla motor tsla former secretary steven chu ran stimulus fund business ran businesse still interest payment bottom line programme established bill thenpresident george bush signed expanded stimulus set extend credit nurture technology save energy create job protect environment private investor made too better combining stimulus hitech act pay doctor adopt electronic medical record legislation here highlight decade worth government intervention nascent market wittiest result standpoint ridiculing political rhetoric real american benefit competent government howling success ford ecoboost line engine built plant retrofitted billion doebacked loan ecoboost account %plus pickup sold ford escape suvs dodge promoting diesel ram pickup save gas ecoboost giant corporation duelling green cowboy yeehaw nissan smyrna tenn factory largest car plant world part billion loan guarantee convinced nissan move production leaf electric car japan good new apparently doesnt travel far tennessee rep marsha blackburn republican doe critic told bloomberg new company bankrupt longer existence taxpayer left holding bag really rep blackburn economist shes scientist talk climate phd understand job good congressional district your count two number borrower solyndra fisker account writeoff programme biggest single loan financed largest nuclearplant expansion decade doe dragged feet billion cleancoal plant mississippi borrower elsewhere lucky taxpayer plant slated cost billion now tesla world hottest manufacturer built model car assembly line doe financing success tesla privately fund job gigafactory battery plant doe set fund alternative credit market healed winning technology matured finance themselve teslas example best market understand washington cant stimulusbacked stock handily beat market early recovery tesla share worth doe financing billion market capitalization light million loss direct rival fisker policymaker spread prudent risk big reward billion rooftop solarsystem installer solarcity scty dwarf solyndras loss too better technology programme financed promise cleaner cheaper future green dream evermore electric car replacing gasoline juice produced lowcarbon nocarbon plant solar wind nuclear natural gas technology gas closer public credit private market spat bit marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/if-you-like-tesla-and-ford-thank-your-government-2014-11-19","m_Places":["Tesla","Boomers","Most","Washington","United States","Japan","Tennessee","Mississippi"],"m_People":["Barack Obama","Steve Westly","George W. Bush","Marsha Blackburn"],"m_Companies":["Solarcity","Pandora","Energy Dept.","Jpmorgan Chase","Tesla Motors","Diesel","Greens","Marketwatch"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":457}
