{"m_szDocID":"680059","m_szDocTitle":"Science Fiction? Or Will This Fuel Really Power Future Generations?","m_szYear":"2013","m_szDocSumamry":"Science Fiction? Or Will This Fuel Really Power Future Generations? Photo credit: Flickr/ Milan Klusacek I'm a firm believer that America's fuel of the future is already here . That fuel, in my opinion, is natural gas. It's clean, abundant, cheap and made right here in the good ole U.S.A. Auto makers like Ford (NYSE: F     )  and General Motors (NYSE: GM     )  are starting to catch on and are building more vehicles that will run on natural gas. That's why sales of Ford's popular F-150 could soon be fueled by natural gas . Likewise, General Motors' latest move has it looking to leap past Ford ","m_szDocBody":"science fiction fuel power future generation photo credit milan klusacek firm believer americas fuel future fuel opinion natural gas clean abundant cheap made good ole usa auto maker ford nyse general motor nyse starting catch building vehicle run natural gas sale ford popular fueled natural gas likewise general motor latest move leap past ford selling fleet footed chevy impala option running natural gas electric vehicle teslas nasdaq tsla model general motor chevy volt spark place fact teslas bold goal produce half million evs year good electric grid said natural gas playing huge future role fueling country directly fueling automobile fuel increasing number power plant power electric car however fool note small natural gas forever current estimate suggest hundred year supply natural gas bridge fuel along electric vehicle day powered solar hydrogen fuel cell however read day made dream generation fuel detailed possibility thorium day fuel future thorium densest material man this potential produce phenomenal amount heat theory enable car built fueled century sound science fiction science real fact cadillac thorium fuel concept car developed today private company develop massmarket thorium powered car thorium wider realistic application longterm solution issue nuclear power meltdown sustain nuclear reaction government developing thorium reactor shortly world war project mothballed onset cold war attempt harness power thorium battle diminishing natural resource worry climate change anyone guess fueling future decade ahead current natural gas boom coming short year ago thought running stuff instead american energy company unlocked vast resource nearterm solution energy issue fun dream profitably invest now invest boom coming fun dream future oil gas fuel economy long time record oil natural gas production revolutionising united state energy position boom coming chance profit boom cheque special free report stock american energy bonanza miss timely opportunity report absolutely free matt dilallo option long call ford short put ford motley fool recommend ford general motor tesla motor motley fool own share ford tesla motor foolish newsletter service free day fool hold opinion diverse range insight make investor motley fool disclosure policy ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.fool.com/investing/general/2013/11/10/science-fiction-or-will-this-fuel-really-power-fut.aspx","m_Places":["America","United States","Tesla"],"m_People":["Milan Klusacek","Chevy Volt","Matt Dilallo"],"m_Companies":["Flickr","General Motors","Nasdaq","Cadillac","U.s. Government","Guess","Motley Fool","Tesla Motors"],"m_BiGrams":["natural gas","general motor","boom coming","motley fool"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,4,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":333}
