{"m_szDocID":"683496","m_szDocTitle":"Grumpy old man gets happy--how can this be?  Isn't the U.S. economy hopelessly doomed? | ZDNet","m_szYear":"2016","m_szDocSumamry":"ZDNet Japan Grumpy old man gets happy--how can this be?  Isn't the U.S. economy hopelessly doomed? I'm a grumpy old man.  It's very easy to get really angry or completely depressed blogging about cleantech, or the need for it. | Topic: China I'm a grumpy old man.  It's very easy to get really angry or completely depressed blogging about cleantech, or the need for it.  From the global warming arguments to whole nations--like my own and China--stubbornly refusing to move to new technologies, this seems to be an era of ultimate human folly. Instead we Americans borrow money from other countries t","m_szDocBody":"zdnet japan grumpy man happyhow economy hopelessly doomed grumpy man easy angry completely depressed blogging cleantech topic china grumpy man easy angry completely depressed blogging cleantech global warming argument nationslike chinastubbornly refusing move technology era ultimate human folly american borrow money country buy oil country problem solution choose today spoke young energetic man made feel positively hopeful downright exuberantly optmistic phone deron lovaas oil gasoline guy natuiral resource defence council see positive nottoodistant future previously blogged current liebermanwarner climate security act pass senate election year companion bill house lovaas point out pass congress current president veto face nrdc supporting bill lovaas hopeful confident give americas future energy law first lovaas pointed cleantech law inevitable politician realise current state affair texas president call addiction oil sustainable permeate building trade well heard ceo sell green poroduct construction greenness decisionaltering quality repub dem presidential nominee committed facing global warming energy law passed lovaas quoted single positive factoid talk trade deficit importation petroleum car yank stick move efficient energy gradually convert alternative cleantech source will simultaneously make american economy healthlier selfsufficient lovaas law sooner later assured coming job include demonstrating important economically environmentally start producing efficient car alternative energy proposed federal law encourage manner cleantech initiative lovaas quicker introduction plugin electric vehicle incentive cash individual state encourage energy conservation innovation programme appropriatewind kansas solar arizona tidal maine etc law lead retrofitting boom million energy wasting building half energy america making operating building rebuilt electricity grid sound lot job manufacturing needed one conservation conservation conservation oil imported money borrowed lovaas see biofuel diesel gasoline produced nonfood stock carbon cap trading system make carbon emission valuable encourage reuse lovaas see push oil existing abandoned oil well oil stay ground sequestered term vogue blogged company material see cleantech wallboard retrofitted building timing couple year law passed consumed federal level oragnizational regulatory planning meanwhile lovaass sceanario state immediatley begin advantage provided incentive state give rebate tax break people businesse energy saving measure tech generation epa administer law state raise auto emission standard year lovaas see completely restructured energy market electricity grid widespread solar wind cellulosic ethanol numerous job building retrofit business manufacturing needed product imagine posited detroit made car wanted buy energy coming inside man hopeless dreamer gave grumpy man hope generationthe greatestwaste generationmessed turn around nuclear future nrdc favour nuclear energy lovaas cited cost waste storage security issue factor make nuclear favourite nrdc current federal bill said encouragement increase nuclear power generation model japan germany increasing wind solar appeal model nuclearpowered france mckinsey greenhouse gas reduction mckinsey recently released report reducing greenhouse gas emission cost report finding here free mckinsey cleantech businesse aimed energy efficiency conservation continue fine investment mckinsey summarise energy market assessment thus mgi find global industrial sector half total capital required capture energy productivity opportunity identified billion year residential sector world billion year roughly onequarter total capital commercial transportation enduse sector smaller billion billion year respectively breaking capital requirement geographically developing region represent twothird incremental capital needed china accounting billion percent total billion annual requirement united state account billion percent total wide range energymarket failure discourage consumer businesse embracing higher energy productivity deter investor making capital outlay end user overcome initial financing barrier market failure include fuel subsidy directly discourage productive energy use lack information consumer kind energy productivity choice them agency issue highturnover commercial businesse word mckinsey guy frontrow capitalist global problem energy market failure man glad that set scream ecosocialistnazidogooder statement mainstream gang capitalist make smile grumpy now ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.zdnet.com/article/grumpy-old-man-gets-happy-how-can-this-be-isnt-the-u-s-economy-hopelessly-doomed/","m_Places":["Japan","United States","China","Lieberman-warner","America","Texas","Kansas","Arizona","Maine","Detroit","Germany","France"],"m_People":["United States Lovaas","Energy Laws"],"m_Companies":["Defense Council","Senate","House","Congress","Diesel","Epa","My Generation","Mckinsey And Co."],"m_BiGrams":["grumpy man","lovaas see","energy market","energy productivity"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":576}
