{"m_szDocID":"683897","m_szDocTitle":"Where Will Energy Come From in Five Years' Time? | News & Opinion  | PCMag.com","m_szYear":"2016","m_szDocSumamry":"Where Will Energy Come From in Five Years' Time? Where Will Energy Come From in Five Years' Time? 10 Comments At the Popular Mechanics Breakthrough 2008 Conference, a collection of engineers, inventors, educators, and enthusiasts discussed some of the innovations of the past year. In \"Energy in the Next Five Years,\" five panelists took a look at solar power, biotech, and other energy technologies, examining our near-term alternative fuel sources. At the Popular Mechanics Breakthrough 2008 Conference, a collection of engineers, inventors, educators, and enthusiasts discussed some of the innovat","m_szDocBody":"energy year time energy year time comment popular mechanic breakthrough conference collection engineer inventor educator enthusiast discussed innovation past year energy year panellist solar power biotech energy technology examining nearterm alternative fuel source popular mechanic breakthrough conference collection engineer inventor educator enthusiast discussed innovation past year energy year panellist solar power biotech energy technology examining nearterm alternative fuel source won popular mechanic breakthrough award bruce osborn chief executive stirling energy system touted capability company largescale solar plant ses suncatcher product stirling set world record solar grid conversion achieving impressive percent efficiency this real system claimed osborn one prototypesnot laboratory curiosity company solar dishes generate electricity focusing sun ray receiver transmit heat energy stirling engine similar technology powering shec lab solar dishes unlike shec stirling energy system panel installed realworld plant notably ses solar twothe world largest solar energy generation plant inventor lonnie johnson impressed osborn invention improved efficiency solar cell percentage point increase efficiency make huge difference noted apparently government agreed charle andraka sandia national laboratory discuss development plan the efficiency increase pivotal breakthrough noted underscoring plan break ground year today ses solar plant utilising technology johnson slouch himself recently invented johnson thermoelectrochemical converter generate power jtec johnson affectionately referred heat expand contract hydrogen generate electricity temperature move axle jtec force ion membrane waste heat internal combustion engine nuclear power plant create electricity tech kinkead reiling amyris biotechnology discussed plan create renewable biodiesel fuel biofuel ups down concern land consuming food product fuel joked biofuel saviour devil intelligently land have steve fambro aptera motor discussed invention aptera type electric car revolutionary car production march aim mile charge sell electric vehicle fambro note designed powertrain agnostic vehicle meaning frame bring hyperefficient design gas engine well noted innovation spite striking design window rollup mechanism internal control sort radically innovated originally posted goodcleantech ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.pcmag.com/article2/0,2817,2332644,00.asp","m_Places":[],"m_People":["D. Bruce Osborn","Lonnie Johnson","Steve Fambro"],"m_Companies":["Popular Mechanics","U.s. Government","Sandia National Laboratories","Amyris Biotechnologies","Ups","1e"],"m_BiGrams":["energy year","popular mechanic","mechanic breakthrough"],"m_TriGrams":["popular mechanic breakthrough"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":300}
