{"m_szDocID":"684746","m_szDocTitle":"Today in Small Business: Business Travel and Ebola - The New York Times","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- The New York Times You're the Boss | Today in Small Business: Business Travel and Ebola Advertisement Today in Small Business: Business Travel and Ebola By October 14, 2014 11:03 am October 14, 2014 11:03 am A daily roundup of small-business developments. What’s affecting me, my clients and other small-business owners today. The Economy Ford plans to add 850 jobs at its Dearborn, Mich., factories to build F-150 trucks (which have been popular with small businesses). Business Travel Here’s a common-sense approach to fighting in-flight germs . Here are the countr","m_szDocBody":"york time boss today small business business travel ebola advertisement today small business business travel ebola daily roundup smallbusiness development what affecting client smallbusiness owner today economy ford plan add job dearborn mich factory build truck which popular small businesse business travel here commonsense approach fighting inflight germ country ebola show next flight attendant union suing reinstate ban electronic device airplane startup hottest real estate startup york city entrepreneurship yearold entrepreneur expect consumerproduct company gross million revenue own factory china stolen wallet turn valuable lesson entrepreneur here entrepreneur learn howard stern cash flow french bank people transfer money lesson gangster rob bank marketing scottish travel agency booking rise percent spoof video viral customer service accounting firm employee lost job complaining comcast service job back country business owner inelkton recognised hometown hero businesse small california town losing customer nearby homeless encampment world united kingdom shopping level fall lowest point amazon expected create job britain social media here woman conference past week super bowl ads health care alternative businesse offer paid health care benefit retail penney chief executive helped turn home depot online here hacker private photos breaching snapchat server general electric ambitious plan move company public cloud service yelp ideas app cure loneliness strategy editor bloomberg american oil company drilling oblivion opportunity engineer critical future sustainable farming titanium dioxide gel researcher make battery day electric car fuel fast gasguzzling cousin technology here inside brooklyn printing phenomenon samsung developed wifi technology time faster gene mark own mark bala cynwyd consulting firm help client customer relationship management follow datemeta ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://boss.blogs.nytimes.com/2014/10/14/today-in-small-business-business-travel-and-ebola/","m_Places":["New York City","China","Elkton, Md.","California","United Kingdom","Britain","Brooklyn","Bala","Cynwyd, Pa."],"m_People":["Howard Stern","Gene Marks"],"m_Companies":["New York Times","Twitter","Comcast","Amazon","J.c. Penney","Home Depot","General Electric","Yelp","Samsung","Marks Group"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":256}
