{"m_szDocID":"704849","m_szDocTitle":"Ohio and the Manhattan Project | Department of Energy","m_szYear":"2016","m_szDocSumamry":"Home » Ohio and the Manhattan Project Ohio and the Manhattan Project October 13, 2015 - 2:44pm What does this project do? Goal 5. Sustain management excellence.     After a briefing regarding the Manhattan Project, Nobel Laureate Niels Bohr said to physicist Edward Teller, “I told you it couldn’t be done without turning the whole country into a factory.” Of course, the state of Ohio didn’t need to be turned into a factory, since by that time it already had a long history of industrialization. In fact, many of the state’s factories were put to use making the first nuclear bombs. This past July,","m_szDocBody":"home ohio manhattan project ohio manhattan project project goal sustain management excellence briefing manhattan project nobel laureate niel bohr physicist edward teller told couldnt turning country factory course state ohio didnt turned factory time long history industrialization fact state factory put making nuclear bomb past july department energy office legacy management employee learned role ohio legacy site played nation early atomic energy programme allhand training place dayton ohio major industrial centre largely location ironore deposit upper midwest united state rich coal field appalachian mountain iron coal ohio forge steel steel fostered industry instance dayton home early automaker speedwell motor company dayton electric car company city wright brother manufactured airplane midtwentieth century ohio major industry hub producing wide array good ranging toy tyre outbreak world war ohio manufacturer converted war production helping make arsenal democracy cincinnati aluminium industry inc switched making toy car making ammunition antitank gun dayton national cash started making magazine antiaircraft gun akron goodyear started making assault boat marine corp country wartime production included race build nuclear bomb manhattan project established harshaw chemical company cleveland started refining uranium compound provide feed gaseous diffusion plant oak ridge tennessee b&t metalsa significant african americanowned business columbusbegan making uranium rod baker brother toledo machined uranium rod slug fuel reactor hanford washington oak ridge tennessee meanwhile monsanto chemical company central research facility laboratory dayton tasked producing polonium bomb needing space company expanded facility include seminary playhouse world war ohio continued play major part nation atomic energy programme however work contracted privately owned businesse consolidated governmentowned facility mound laboratory polonium work monsanto conducted dayton fernald feed material production centre uranium work previously performed harshaw chemical b&t metal baker brother all roughly site ohio involved nation atomic energy programme today responsible site ashtabula columbus including columbus east fairfield fernald hamilton mound oxford piqua toledo coming year anticipate accepting responsibility additional site state structure gone retain knowledge important work performed ohio site addthis related article ","m_szGeo1":"United States","m_szSourceType":"source_government","m_szSrcUrl":"http://energy.gov/lm/articles/ohio-and-manhattan-project","m_Places":["Ohio","Dayton","United States","Appalachian Mountains","Cincinnati","Akron","Harshaw","Cleveland","Tennessee","Columbus","Toledo","Hanford, Washington","Central","World War Ii, Ohio","Ashtabula","Hamilton","Oxford","Piqua"],"m_People":["Niels Bohr","Rods","Baker Brothers","Columbus East"],"m_Companies":["Sustain","State Of Ohio","Dayton Electric Car Company","Wright","Aluminum Industries, Inc.","Goodyear","U.s. Marine Corps","Monsanto","Fernald Feed Materials Production Center"],"m_BiGrams":["manhattan project","atomic energy","energy programme"],"m_TriGrams":["atomic energy programme"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3],"m_TriCnt":[3],"m_iDocBodyWordCnt":320}
