{"m_szDocID":"705448","m_szDocTitle":"Saluting Daniel Poneman's Service to the Department of Energy | Department of Energy","m_szYear":"2016","m_szDocSumamry":"Home » Saluting Daniel Poneman's Service to the Department of Energy Saluting Daniel Poneman's Service to the Department of Energy October 3, 2014 - 10:11am Addthis 1 of 15 May 8, 2013: President Barack Obama listens to Acting Energy Secretary Daniel B. Poneman during a meeting with electric utility CEOs and trade association representatives at the Department of Energy in Washington, D.C. The group met to discuss lessons learned during the response to Hurricane Sandy, as well as the ongoing preparations for 2013 hurricane season. | Photo by Pete Souza, the White House. 2 of 15 April 19, 2013: ","m_szDocBody":"home saluting daniel poneman service department energy saluting daniel poneman service department energy addthis president barack obama listen acting energy secretary daniel poneman meeting electric utility ceos trade representative department energy washington met discuss lesson learned response hurricane sandy ongoing preparation hurricane season photo pete souza white house acting secretary energy daniel poneman cheque toyota fuel cell electric vehicle tour energy system integration facility national renewable energy laboratory nrel golden colorado photo dennis schroeder nrel standing visualisation room national renewable energy laboratory nrel acting secretary poneman inside active layer organic solar cell sunlight harvested photo dennis schroeder nrel deputy secretary poneman centre tour hanford waste treatment immobilisation plant richland washington energy department photo deputy secretary daniel poneman visit lawrence livermore national laboratory here poneman take target installed livermore national ignition facility nif chamber energy department photo energy secretary ernest moniz left deputy energy secretary daniel poneman centre meet bill gate founder technology advisor microsoft corporation right department energy photo ken shipp energy department deputy secretary poneman introduce ernest moniz officially swearing secretary energy photo sarah gerrity energy department september ceremony portsmouth gaseous diffusion plant piketon ohio deputy energy secretary poneman sign cylinder commemorating start hot functional testing operation depleted uranium hexafluoride duf conversion plant left ohio governor ted strickland energy department photo energy deputy secretary daniel poneman speak dedication clemson university wind turbine drivetrain testing facility south carolina photo courtesy clemson university deputy secretary daniel poneman right band yellow cake perform energy department fed feed family event energy department photo deputy secretary daniel poneman speak arpae innovation summit photo ken shipp energy department deputy energy secretary daniel poneman meet qatar deputy prime minister minister energy industry abdulla bin hamad alattiyah official visit middle east energy department photo deputy secretary daniel poneman tour brookhaven graphite research reactor cheque remotely operated equipment control graphite removal facility energy department photo deputy secretary energy daniel poneman centre talk student visit duke university photo courtesy duke university deputy secretary daniel poneman tour oregon caithness shepherd flat wind farm largest wind farm world energy department photo ","m_szGeo1":"United States","m_szSourceType":"source_government","m_szSrcUrl":"http://energy.gov/articles/saluting-daniel-ponemans-service-department-energy","m_Places":["Washington, D.c.","Toyota","Golden, Colorado","Richland, Washington","Portsmouth Gaseous Diffusion Plant","Piketon, Ohio","Ohio","South Carolina","Qatar","Middle East","Brookhaven","Oregon"],"m_People":["Daniel Poneman","Barack Obama","Pete Souza","Dennis Schroeder","Ernest Moniz","Bill Gates","Ken Shipp","Sarah Gerrity","Ted Strickland","Abdulla Bin Hamad","Energy Daniel"],"m_Companies":["Saluting","Department Of Energy","White House","Secretary Of Energy","National Renewable Energy Laboratory","Nrel","Energy Department","Lawrence Livermore National Laboratory","Target","Microsoft Corporation","U.s. Secretary Of Energy","Clemson University","Duke University"],"m_BiGrams":["daniel poneman","energy department","secretary daniel","deputy secretary","department photo","energy secretary","department energy","secretary poneman","photo deputy","secretary energy","poneman centre","deputy energy"],"m_TriGrams":["secretary daniel poneman","energy department photo","deputy secretary daniel","department photo deputy","photo deputy secretary","energy secretary daniel","deputy energy secretary"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[13,11,9,9,7,5,4,4,4,3,3,3],"m_TriCnt":[9,7,6,4,4,3,3],"m_iDocBodyWordCnt":340}
