{"m_szDocID":"707327","m_szDocTitle":"How to Find Undervalued Resource Stocks - Interview with Peter Epstein | OilPrice.com","m_szYear":"2016","m_szDocSumamry":"How to Find Undervalued Resource Stocks - Interview with Peter Epstein How to Find Undervalued Resource Stocks - Interview with Peter Epstein By The Energy Report Posted on Sun, 28 July 2013 00:00 | 0 Big gains are rarely found by jumping on the bandwagon. Independent Analyst and founder of MockingJay Inc., Peter Epstein argues that market darlings won't reward latecomers; that's why he spends his time finding undervalued, underfollowed junior resource companies. In this interview with The Energy Report, Epstein shares his resource stock diamonds in the rough, including a uranium name commerci","m_szDocBody":"undervalued resource stock interview peter epstein undervalued resource stock interview peter epstein energy report posted sun big gain rarely found jumping bandwagon independent analyst founder mockingjay inc peter epstein argue market darling reward latecomer spend time finding undervalued underfollowed junior resource company interview energy report epstein share resource stock diamond rough including uranium commercialising groundbreaking technology graphite company beating competitor market energy report written great company necessarily make great investment implying junior bet peter epstein yesjunior highly risky move large amount example junior trading cash value risky really point upside outweigh risk make mistake good project cash bank strong management team buying share company trading cash value basically asset free ter great company necessarily great investment cameco corp ccotsx ccjnyse true leader uranium space great company underlying uranium price rebound pound pundit expect analyst price target camecos stock increase however select oversold junior space return multiple amount invested ter portfolio run gamut resource sector choose commodity focus read lot speak management team industry expert necessarily difficult pick commodity strong core fundamental example iron ore fundamental challenging rio tinto rionyse riolse rtppf otcpk bhp bhpnyse bhplfotcpk vale valenyse fortescue metal fmgasx representing twothird iron ore industry ramping production level dramatically hand uranium fundamental strong japan restarting number nuclear reactor early year china india building reactor fast can china choice major city choked coalrelated air pollution mention million car road indias coal market hopelessly complicated corrupt coalfired electricity generation possibly demand indias stated goal power nuclear energy suggest increasing demand uranium ter oversold junior watching uranium space energy fuel inc efrtsx efrffotcqx extremely positioned topfive uranium development project close announced acquisition ofstrathmore mineral corp stmtsx sthjfotcqx energy fuel own operating conventional uranium mill country mill replacement cost hundred million energy fuel fully diluted market cap million energy fuel trade substantial discount peer uranium producer time major bull market uranium stock energy fuel stock month time around star aligning big gain again ter determine topfive project based solely size largely based scale project home number emerging insitu recovery isr project produce million pound mlb resource year company urenergy inc uretsx urgnysemkt uranerz energy corp urztsx urznysemkt uranium energy corp uecnysemkt difference energy fuel project conventional mining operation opposed isr lowercost method however conventional mining project time large isr project make strong return scale lower margin clear though economy scale energy fuel major project easily margin compared proposed isr project ter black range mineral ltd blrasx unusual uranium ore concentrating technology called ablation method measure isr conventional mining project technology concentrate uranium mineralization mine separating waste ore lowcost green purely mechanical process therefore shipping tonne ore mill hundred mile away tonne concentrate shipped translate immense saving step mining operation ore cheaper transport process tailing unique black range mineral addition ranch uranium project colorado which mlb make black range topfive resource holder company joint venture private company named ablation technology llc exclusive global right ablation technology gamechanger major watching deployment semicommercial scale unit closely coming month interest hidden asset worth multiple black range entire market cap ter follow potash stock well potash play emerging economy projecting commodity potash solid longterm fundamental uranium essential commodity substitute play emerging middle class developing economy domestic angle well import potash consume passport potash inc ppitsxv pprtfotcqx located arizona producing million tonne potash year greatly reduce dependency foreignsourced potash passport delivered cost untouchable west mississippi passport easy west coast gulf mexico port export asia passport potash project world company market cap fraction global junior peer fact passport released preliminary economic assessment robust aftertax internal rate return passport continue derisk project valuation double triple half junior potash peer karnalyte resource inc krntsx elemental mineral ltd elmtsx elmasx eminfotcpk passport active discussion multiple strategic investor offtake partner month good chance passport execute strategic investment offtake agreement derisk storey ter move oil oil price holding barrel sustainable price oil price evaluate oil company worth upside potential downside risk predict commodity price pick company fundamental commodity price rise fall fundamental suggest wouldve thought oil price yeartodate silver gold copper oil company excited zodiac exploration inc zextsxv oversold underfollowed misunderstood venture exchangetraded stock trading share worth share zodiac debt cash equal company control net acre highly prospective oil property california late private company named aera energy llc executed zodiac acre zodiac holding aera committed pay cost vertical horizontal well total expected cost order earn interest acre huge vote confidence zodiac asset imply valuation zodiac greater market ascribing now icing cake zodiac tax pool conservatively worth share therefore pershare company cash tax pool worth considerably current stock price investor highly prospective acre free recent announcement western energy production llc pooling acre zodiac evidence increased activity interest zodiac holding major region including exxon mobil corp xomnyse royal dutch shell plc rdsanyse rdsbnyse chevron corp cvxnyse occidental petroleum corp oxynyse aware zodiac zodiac discussion multiple party development activity pyramid oil pdonysemkt located california people realise larger oilproducing state pyramid dollar cash debt fewer share outstanding company cashflow positive existence yearssince company exploring multiple corporate initiative enhance shareholder value pyramid oil run successful exploration production play ter follow natural gas space company keeping tab cbm asia development corp tcftsxv junior coalbed methane play indonesia shareholder suffering investor fatigue underlying fundamental remain fantastic cbm asia junior surrounded exxon total totnyse plc bpnyse bplse chevron other indonesia single market coalbed methane world cbm land grab past year pay big year common perception natural gas price low canada low place world europe asia time higher make cbm asia compelling play lot domestic natural gas stock asia price thousand cubic feet compared ter lot discussion coal competitive fuel source compared cheap domestic natural gas wrote december argued coal industry return high outlook changed not coal decade place world increasing coalfired electricity generation faster source energy coalfired power generation fallen total mix past year largely due low natural gas price coal decline china india increasing fairly good clip coking coal bit different viewed necessarily evil making steel substitute coking coal blast furnace amount coking coal globally small fraction thermal coal generate electricity ter cover celsius coal ltd claasx coking coal project storey there celsius coal junior place time uzgen basin coking coal project kyrgyz republic historical drilling show deposit host highquality coking coal important coking coal world lower quality subject greater price volatility project located hundred kilometre chinese border captive regional market western china celsius impacted highly volatile seaborne coking coal price customer benefit stability security supply reduced delivery time choosing celsius coal versus coking coal producer thousand kilometre away celsius lucky strong financial backing loyal shareholder base ter conclude graphite year rollercoaster ride investor demand driver true graphite wild ride key storey graphite price settled historical level demand driver include proliferation electric vehicle tesla motor example battery kilogramme graphite lithiumion battery continue main driver graphite demand course teslas current run rate automobile significant global context tesla electric car manufacturer popping world move needle coming year ter company space lesson learned year company market enjoy strong pricing strong demand dozen graphite junior race half finish big north graphite corp nrttsxv big suggest cashflow positive selling graphite month company aggressively pursuing existing amorphous graphite region mexico known flake graphite play reach production year big north selling thousand tonne mexico year fact big north announced mined stockpiled tonne highly speculative smallcap company meaningful production begin ter final advice investor energy space patience rewarded global stock market nearterm high true contrarian happy walk market hold basket junior pick diversified basket wellpositioned junior return dramatically outperform indexe s&p matter time ter taking time speak today course peter epstein cfa left senior analyst position hedge fund formed mockingjay inc consultancy company natural resource space informal investment advisor net worth investor family office fund epstein areas expertise include uranium coal potash gold oil gas published hundred article investment site seeking alpha motley fool auwirecom ","m_szGeo1":"United Kingdom","m_szSourceType":"source_investments","m_szSrcUrl":"http://oilprice.com/Finance/investing-and-trading-reports/How-to-Find-Undervalued-Resource-Stocks-Interview-with-Peter-Epstein.html","m_Places":["Vale","Japan","China","India","United States","Ur","Colorado","Arizona","Mississippi","Gulf Of Mexico","Asia","California","Indonesia","Canada","Europe","Kyrgyz Republic","Tesla","Mexico"],"m_People":["Peter Epstein"],"m_Companies":["Mockingjay Inc.","Cameco Corp","Rio Tinto","Fortescue Metals","Fmg","Ramping","Energy Fuels Inc.","Minerals Corp.","Mill","Bull","Mlb","Energy Inc.","Uranerz Energy Corp.","Uranium Energy Corp.","Black Range Minerals Ltd.","Ablation Technologies Llc.","Passport Potash Inc.","Karnalyte Resources Inc.","Elemental Minerals Ltd.","Zodiac Exploration Inc.","Venture","Aera Energy Llc","Ascribing","Western Energy Production Llc","Pooling","Exxon Mobil Corp","Royal Dutch Shell Plc","Chevron Corp","Occidental Petroleum Corp","Pyramid Oil Co.","Cbm Asia Development Corp.","Exxon","Bp Plc","Bp","Chevron","Celsius Coal Ltd.","Tesla Motors","Big North Graphite Corp.","Epstein's","Motley Fool"],"m_BiGrams":["coking coal","energy fuel","peter epstein","natural gas","black range","resource stock","energy report","great company","market cap","isr project","conventional mining","cbm asia","celsius coal","big north"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,7,5,5,4,3,3,3,3,3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":1294}
