{"m_szDocID":"716326","m_szDocTitle":"Stocks slide further on global worries - SFGate","m_szYear":"2003","m_szDocSumamry":"Stocks slide further on global worries Indexes off 10 percent for year as oil drops to lowest level since 2008 Alex Veiga, Associated Press Published 2:47 pm, Thursday, February 11, 2016 Jitters over the global economy and a steep drop in crude oil knocked U.S. stocks lower for the fourth day in a row Thursday. The drop in the U.S. followed large losses all around the world, and left all three major U.S. indexes down at least 10 percent since the beginning of the year. The latest slump reflected heightened concerns that global economic growth is slowing, even as Federal Reserve Chair Janet Yel","m_szDocBody":"stock slide global worry indexe percent year oil drop lowest level alex veiga press published thursday jitter global economy steep drop crude oil knocked stock lower fourth day row thursday drop large losse world left major indexe percent beginning year latest slump reflected heightened concern global economic growth slowing federal reserve chair janet yellen reiterated confidence economy testimony congress thursday lot people trouble assessing true stock kinahan ameritrade chief strategist what continue volatility financial company biggest decliner amid growing anxiety interest rate remain low sap bank profit price oil tumbled lowest level investor fled traditional haven bond precious metal gold jumped percent stock ended lower recovered steeper losse earlier day dow jone industrial average dropped point percent average point standard poor lost point percent nasdaq composite fell point percent investor increasingly worried mounting market turmoil put brake global economy time struggling litany issue including chinas slowdown low inflation plunging energy market yellen day testimony lawmaker thursday acknowledged global economic pressure pose risk economy early risk severe alter central bank interestrate policy failed reassure investor hoping fed signal rate hike table year katie nixon chief investment officer northern trust wealth management the market disappointed direct comment pushing rate increase nixon said she opportunity that feeding market anxiety sector s&p index closed lower financial stock fell most percent citigroup fell percent bank america shed cent percent jpmorgan slid percent benchmark crude oil fell sixth day row sliding percent barrel york brent crude benchmark international oil dropped cent percent barrel london natural gas fell cent percent cubic feet drop oil natural gas price share energy company lower southwestern energy lost cent percent nrg energy shed percent boeing plunged percent report security exchange commission investigating aircraft manufacturer accounting practise stock worstperformer dow losing trader bid share tripadvisor travel website operator fourthquarter profit revenue topped estimate stock gained percent performing stock s&p tesla motor climbed percent electric car maker lowerpriced model sedan schedule release stock added ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/business/article/Stocks-slide-further-on-global-worries-6824572.php","m_Places":["United States","China","New York","Brent","London"],"m_People":["Alex Veiga","Janet Yellen","J.j. Kinahan","Katie Nixon"],"m_Companies":["Associated Press","Td Ameritrade","Sap","Signal","Northern Trust","Citigroup","Bank Of America","Nrg Energy","Boeing","Securities And Exchange Commission","Tesla Motors"],"m_BiGrams":["cent percent","point percent"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":321}
