{"m_szDocID":"725534","m_szDocTitle":"Making Lemonade: \"Green Freedom\" to Make Gasoline from Carbon Emissions | CleanTechnica","m_szYear":"2008","m_szDocSumamry":"Making Lemonade: \"Green Freedom\" to Make Gasoline from Carbon Emissions February 20th, 2008 by Carol Gulyas   Dr. Jeffrey Martin and William L. Kubic, Jr. have proposed a concept to synthesize gasoline from carbon dioxide emissions, and have dubbed their idea “Green Freedom.” “The idea is simple,” (a sure bet that it’s anything but) says Kenneth Chang in the New York Times: Air would be blown over a liquid solution of potassium carbonate, which would absorb the carbon dioxide [which] would then be extracted and subjected to chemical reactions that would turn it into fuel: methanol, gasoline or","m_szDocBody":"making lemonade green freedom make gasoline carbon emission carol gulyas jeffrey martin william kubic proposed concept synthesise gasoline carbon dioxide emission dubbed idea green freedom idea simple bet but kenneth chang york time air blown liquid solution potassium carbonate absorb carbon dioxide which extracted subjected chemical reaction turn fuel methanol gasoline jet fuel resulting gasoline emit carbon dioxide developed los alamos idea based sound physic proven factory level problem concept enormous amount energy produced economically nuclear power plant thousand built order replace petroleum current level use scientist estimating process produce gasoline cost gallon consumer sound contorted process carbon emission problem remain hard nut crack electric car move energy power plant car powered solarcharged battery hydrogen fuel cell large amount energy create hydrogen biofuel valuable farmland replace rainforest needed offset carbon emission blame scientist trying martin kubic idea today alternative energy conference lake buena vista florida green freedom project steve verhey post gas cleantechnicas completely free electric car report electric car early adopter follower want date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter tag green freedom los alamos carol gulyas carol gulyas leader renewable energy community illinois serve board illinois solar energy association recently cofounded ecoachiever provider online education renewable energy sustainable living community spent year direct marketing industry york chicago teaching librarian columbia college chicago carol grew small town central indiana lived pacific northwest lima peru york city inspired reducing energy consumption renewable energy energy efficiency green building technology related post ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2008/02/20/making-lemonade-green-freedom-to-make-gasoline-from-carbon-emissions/","m_Places":["Los Alamos","Buena Vista, Florida","Illinois","New York","Chicago","Indiana","Lima","Peru","New York City"],"m_People":["Carol Gulyas","Jeffrey Martin","William L. Kubic, Jr.","Kenneth Chang","Steve Verhey"],"m_Companies":["New York Times","Illinois Solar Energy Association","Columbia College Chicago","Pacific Northwest"],"m_BiGrams":["green freedom","carbon emission","carol gulyas","carbon dioxide","electric car","renewable energy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":255}
