{"m_szDocID":"730309","m_szDocTitle":"1.8 GW Of New Solar For Japan In Q2 | CleanTechnica","m_szYear":"2013","m_szDocSumamry":"1.8 GW Of New Solar For Japan In Q2 October 14th, 2013 by Jake Richardson   Japan keeps strongly increasing solar capacity and racked up another 1.8 GW of projects completed in the second quarter of this year. Most of this (1.4 GW) was commercial installations. Residential PV solar for the same period was just 410 MW . For Q2 this ratio was a reversal of the prior period, which favored residential solar installations over commercial. If you guessed that it was the national feed-in-tariff scheme that fueled the continued solar surge, you were correct. The FIT did not arise on its own, however. ","m_szDocBody":"solar japan jake richardson japan strongly increasing solar capacity racked project completed quarter year commercial installation residential solar period ratio reversal prior period favoured residential solar installation commercial guessed national feedintariff scheme fueled continued solar surge correct fit arise own however disaster fukushima sparked mostly implementing fit programme solar project completed gigawatt installed end year japan intend nuclear power point renewable energy development continued support barrier expediting estimated solar project approved commissioned grid connectivity investigation underway result reported soon impetus goal nuclear power nation fukushima constant motivation new account continued problem harrowing upcoming handling spent fuel rod worse press issue leak cement public opinion nuclear alternative energy source paradoxically shutting nuclear power plant increased consumption fossil fuel oil coal order fill energy void extra use course increased emission japan stuck potentially volatile nuclear situation fukushima increased reliance fossil fuel time large surge solar installation represent small portion total energy production hopefully support solar wind continue foreseeable future important trend reaction fukushima japanese culture appreciation beauty nature century technology engineering primary interest there greening energy system longterm logical strategy cleantechnicas completely free electric car report electric car early adopter follower want date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter tag fit japan jake richardson hello writing online time enjoy outdoor like follow related post ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2013/10/14/1-8-gw-new-solar-japan-q2/","m_Places":["Atmosphere","Japan","Most","Fukushima"],"m_People":["Jake Richardson"],"m_Companies":["Google"],"m_BiGrams":["nuclear power"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":227}
