{"m_szDocID":"731352","m_szDocTitle":"A (hopefully) quick end to a bear market, and nine other money stories you may have missed - MarketWatch","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- National news A (hopefully) quick end to a bear market, and nine other money stories you may have missed Published: Jan 17, 2016 10:32 a.m. ET Share These 10 stories are among the most interesting published by MarketWatch this week By Investing columnist Kevork Djansezian/Getty Images What may be good news for investors is that bear markets for U.S. stocks tend to end soon after reaching a 20% decline. MarketWatch rounded up 10 of the most interesting money stories published over the past week that readers might have overlooked. Bear markets tend to end quickly","m_szDocBody":"national new hopefully quick end bear market money storey missed published share storey interesting published marketwatch week investing columnist kevork image good new investor bear market stock tend end reaching decline marketwatch rounded interesting money storey published past week reader overlooked bear market tend end quickly s&p index spx year thursday tumbled friday factset s&p returned dividend reinvested past month mark hulbert shared interesting fact based history bear market stock bear market typically defined decline realise one oil price oil price falling end prediction decline inevitable turnaround highercost producer forced cutting production law supply demand tell point momentum swing way has william watt pointed cheapest highgrade crude oil world surprising place oil sand canada return inflation rex nutting interviewed stephen stanley chief economist amherst pierpont security expected federal reserve raise benchmark federal fund rate time wouldnt shock inflation higher fed think stanley said central bank raise rate higher baked security valuation market fearful headline rising inflation cause good saver investor time higher inflation earning decent return saving holding expense possible ahead avoid china emerging market bill mann chief investment officer motley fool asset management interview investor avoid overexposure stock china emerging market china core market said heavyhanded government interference listed bestperforming emerging market fund clear trend strongest performance country analyst biotech victor reklaitis discussed political technical reason recent slide biotechnology stock analyst longterm michael brush highlighted attractive biotechnology stock mcdonald share mcdonald corp mcd year thursday stock returned past month dividend reinvested compared decline s&p tonya garcia detailed company introduction allday breakfast october mean mcdonald longterm revenue growth prospect fed closer cash real estate buyer sitting mountain cash wondering nice problem have thinking shell company purchase highend property miami york borrowing expect plenty scrutiny treasury financial crime enforcement network wallace witkowski temporary reporting requirement kick require company report identity people shell company make purchase low apple stock fall share apple inc aapl world largest company market value fallen year past year sara sjolin discussed alphabet inc goog concurrent rise price level analyst apple compelling stock apple chase tesla remember electric car considered cool faroff time gasoline price falling much longterm viability electric car clear jennifer booton looked challenge faced apple make analyst toolate entry business again coming late party suit apple all ipod introduced player available apple space quickly smartphone remember carrying blackberry palm treo easier play pot kathleen burke discussed terra tech corp trtc agreement acquire blum oakland dispensary creation publicly traded fully integrated company directly involved production extraction sale cannabis make lot easier investor make major bet space challenge remain varying local law make difficult marijuana company bank business them marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.marketwatch.com/story/a-hopefully-quick-end-to-a-bear-market-and-nine-other-money-stories-you-may-have-missed-2016-01-15","m_Places":["United States","Canada","Amherst","Pierpont","Stanley","China","Miami","New York","Tesla","Oakland"],"m_People":["Mark Hulbert","William Watts","Rex Nutting","Stephen Stanley","Bill Mann","Victor Reklaitis","Michael Brush","Tonya Garcia","Wallace Witkowski","Sara Sjolin","Jennifer Booton","Palm Treo","Kathleen Burke"],"m_Companies":["Marketwatch","Getty Images","Spx","Motley Fool","Mcdonald","Shell","U.s. Treasury","Apple","Apple Inc.","Alphabet Inc.","Blackberry","Tech Corp"],"m_BiGrams":["bear market","emerging market"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3],"m_TriCnt":[],"m_iDocBodyWordCnt":433}
