{"m_szDocID":"739280","m_szDocTitle":"Emerging Technologies — The National Academies","m_szYear":"2016","m_szDocSumamry":"Advanced Nuclear Fission Nuclear power plants account for 20% of U.S. electricity generation, but no new reactors have come on line since 1996. The need to reduce CO2 emissions is renewing interest in nuclear energy. What are the new nuclear technologies and how do they improve upon existing nuclear plants? Hydrogen Fuel Cells There are no natural reservoirs of pure hydrogen; this resource must be extracted from compounds such as natural gas or water. Hydrogen fuel cells have the potential to drastically reduce U.S. dependence on foreign sources of energy. What are fuel cells and how close are","m_szDocBody":"advanced nuclear fission nuclear power plant account electricity generation reactor line reduce emission renewing interest nuclear energy nuclear technology improve existing nuclear plant hydrogen fuel cell natural reservoir pure hydrogen resource extracted compound natural gas water hydrogen fuel cell potential drastically reduce dependence foreign source energy fuel cell close nationwide hydrogen economy alternative conventional oil region covering part colorado utah wyoming oil shale totaling time proven oil reserve saudi arabia tar sand oil shale heavy crude oil greatly affect oil supply future source are found influence energy situation electric vehicle today allelectric vehicle travel mile emissionsfree single battery charge energy technology working vehicle reduced dependence fossil fuel gasoline diesel natural gas learn technologiesallelectric vehicle plugin hybrid electric vehiclesand potential contribution advanced coal technology coal account onethird emission coal inexpensive abundant domestic energy resource major contributor carbon dioxide emission learn igcc plant clean coal technology designed capture sequester biofuel energy independence security act stipulate produce billion gallon advanced biofuel cellulosic ethanol nation offset dependence fossil fuel biodiesel cornbased ethanol alternative gasoline diesel affect energy supply ","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://needtoknow.nas.edu/energy/energy-sources/emerging-technologies/","m_Places":["United States","Utah","Wyoming","Saudi Arabia","Independence"],"m_People":[],"m_Companies":["Nationwide","Diesel"],"m_BiGrams":["fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":174}
