{"m_szDocID":"747632","m_szDocTitle":"Why Georgia Marches on Towards More Nuclear - Power Engineering","m_szYear":"2015","m_szDocSumamry":"Why Georgia Marches on Towards More Nuclear 11/13/2015   Tim G. Echols While the rest of the nation toggles between natural gas and renewables, Georgia maintains a strong commitment to building new nuclear. Some scratch their head in disbelief, but those who live in this bright red state understand our determination. Let me explain. First, our state has no Columbia or Colorado Rivers to produce big hydro power. We have no power plants on mine-mouths, natural gas fields, or Hoover Dams. A significant portion of Georgia’s fuel for electricity production has to be transported over 1,000 miles. Ye","m_szDocBody":"georgia marches nuclear tim echol rest nation toggle natural gas renewable georgia maintain strong commitment building nuclear scratch head disbelief live bright red state understand determination explain first state columbia colorado river produce big hydro power power plant minemouth natural gas field hoover dam significant portion georgias fuel electricity production transported mile yet energy price low chalk good planning management georgia power constructive regulation allrepublican public utility commissionelected statewide year nuclear power enjoy widespread support all state situated silicon valley nuclear power plant vogtle south augusta savannah river directly savannah river site square mile allthingsnuclear including reprocessing storage decommissioned reactor arevabuilt mox facility construction road federal plant summer scana building westinghouse reactor built plant vogtle georgia northwest oconee nuclear stationa reactor operating finally east barnwell lowlevel waste storage operation native advertisement see citizen familiar nuclear power fact attribute low rate nuclear low life cycle cost megawatt nuclear power unit construction increase georgias capacity generate nuclear electricity percent zeroemission nuclear unit operation supply substantial portion state baseload generation coal hater there good new retired georgia tech engineering professor jame rust factor mentioned support nuclear power influence domestic reserve coal natural gas rust research demonstrate nuclear unit plant vogtle fossilunit instead consume million tonne coal trillion cubic feet natural gas year lifetime essence nuclear power plant extend life fossil fuel reserve future reduce future price increase guess good new india china germanywho opportunity buy cheap american coal nuclear power poster child reliability accident georgia doesnt experience blackout rolling brownout experienced northeastern state texas california vogtle coowner georgia power oglethorpe power the emc meag cityowned electric utility city dalton enjoy benefit reactor operating month timerain shine snow wind without remember polar vortex price natural gas spiked percent northeastern state georgia didnt experience mess yet equallyreliable vermont yankee nuclear plant located england iso independent system operator shut objection president obama northern politician figure understand georgia politic georgia legislature passed bill georgia power collect financing cost vogtle project construction psc prior arrival approved similar measure why reduced certified cost project million reduced company borrowing cost ten million dollar let clear vested leadership legislature utility investing vogtle politician vested project success state allin nuclear addition production tax credit federal loan guarantee current lowinterest cost environment sweetened deal clean power plan understand focused official comment lobbying political capital full credit reactor draught plan formula shortchanged state final plan issued nuclear received favourable treatment making reactor worth percent total compliance clean power plan psc georgia power envisioned carbonconstrained future certified reactor future reality concern nuclear power economic societal perspectivesincluding concern nuclear waste day hope commercial reprocessing facility aforementioned silicon valley nuclear power areas legitimate concern smartest mind world working issue confident work sustainable solution meantime georgia south carolina competitive advantage cheap nuclear energy bring job state tim echol commissioner state georgia strong advocate nuclear power own electric car promote utility scale solar ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://www.power-eng.com/articles/npi/print/volume-8/issue-6/departments/fuel-for-thought/why-georgia-marches-on-towards-more-nuclear.html","m_Places":["Georgia","Columbia","Silicon Valley","Augusta","Barnwell","India","China","Germany","Texas","California","South Carolina"],"m_People":["Tim G. Echols","Barack Obama"],"m_Companies":["Areva","Scana","Oconee Nuclear Station","Georgia Tech","Guess","Oglethorpe Power","Emcs","Iso","Independent System Operator","State Of Georgia"],"m_BiGrams":["nuclear power","natural gas","georgia power","plant vogtle"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,5,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":474}
