{"m_szDocID":"749495","m_szDocTitle":"Next Big Future: All electric cars could mean 20-50% more US electric power generation","m_szYear":"2013","m_szDocSumamry":"All electric cars could mean 20-50% more US electric power generation Reddit The US, Europe and Japan have been slow growing economies. With less than 2.5% GDP growth there is almost no new reactors other than replacing broken ones and shifting some power to where people are moving. 1% is from gains in efficiency. This is why China (and other emerging countries like India) where the fast growth is building most of the new power generation of all types. 70 nuclear reactors are being built worldwide. China is making 30 of them and at about $2 billion per GWe and completing them in 5 years time. ","m_szDocBody":"electric car electric power generation reddit europe japan slow growing economy gdp growth reactor replacing broken shifting power people moving gain efficiency china and emerging country india fast growth building power generation type nuclear reactor built worldwide china making billion gwe completing year time china double power generation china year china spin lot nuclear power part energy mix china push coal hydro natural gas nuclear wind solar fracking cheap natural gas half polluting coal massive conversion electric car electricity generation needed tesla model electric car kwh battery million electric car like tesla future electric suvs assumption people weaker car replace existing car perfectly safe robotic car remove lot weight extra physical safety system make lighter efficient car heavy usage mile day twh power generation needed current power generation usa night time charging reduce possibly eliminate power generator produced electricity usage night require natural gas coal constrained costly conceivable electric plug hybrid dominant car preference main type car road fracking increased natural gas strained bring electrical power usa significant price increase make alternative affordable bigger part energy mix twh uprating annular fuel existing nuclear reactor annular fuel different shape surface area developed company called lightbridge boost power existing reactor mwh south korea developing mit innovation commercial reactor testing certification deployment early switch regular maintenance existing technology uprate increased power boost power involve changing turbine equipment gwe gwe approaches pushed ish testing design validation metallic fuel regulatory approval timeframe commercial installation year regulatory approval increased power generation levelized cost mwh half cost coal natural gas regular nuclear construction also existing coal plant similar layout configuration land area nuclear plant connected grid coal burner swapped nuclear reactor produced temperature heat cost speed conversion nuclear faster cost exported nuclear plant brought mass production china china built hundred nuclear reactor factory mass produced piece reactor mwe htrpm high temperature pebble bed reactor reactor built chinese factory shipped installation overseas enable china price nuclear power billion gwe time cheaper current price europe nuclear reactor module buildable year article give quick review ycombinator stumbleupon author ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://nextbigfuture.com/2013/12/all-electric-cars-would-mean-doubling.html","m_Places":["Us","Europe","Japan","China","India","Tesla","Usa","South Korea"],"m_People":[],"m_Companies":["Reddit","2020s"],"m_BiGrams":["power generation","nuclear reactor","natural gas","electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,5,5,4],"m_TriCnt":[],"m_iDocBodyWordCnt":338}
