{"m_szDocID":"751946","m_szDocTitle":"Road plan will be focus of Senate’s extra summer sessions - SFGate","m_szYear":"2016","m_szDocSumamry":"Road plan will be focus of Senate’s extra summer sessions By Chris Aldridge  Tribune Staff Writer Published 10:48 am, Wednesday, April 20, 2016 UPPER THUMB — Top priority this summer is roads. That’s according to Sen. Phil Pavlov, R-St. Clair Township. “I think it’s important that we prioritize our summer around roads and infrastructure improvement,” said Pavlov, who represents Huron, Sanilac, St. Clair and Macomb counties. Pavlov will join other Michigan senators after Majority Floor Leader Mike Kowall’s announcement earlier this week to add sessions in June, July and August — when the Senate","m_szDocBody":"road plan focus senate extra summer session chris aldridge tribune staff writer published wednesday upper thumb top priority summer road sen phil pavlov rst clair township important prioritise summer road infrastructure improvement pavlov represent huron sanilac clair macomb county pavlov join michigan senator majority floor leader mike kowall announcement earlier week add session june senate recess voter huron sanilac clair macomb overwhelmingly turned proposal controversial measure aimed boosting road funding increasing sale tax percent upping vehicle registration fee earned income credit percent county popular night prince sat courtside warrior game time turn voter like road only simple solution invest directly infrastructure pavlov said dont earned income tax credit confusion education funding roadsonly solution existing budget pavlov like direction house speaker kevin cotter going cotter republicanbacked plan introduced earlier week eliminate earned income tax credit place fee hybrid electric vehicle eliminate million film subsidy redirect hundred million state restricted fund bulk plan rely million anticipated revenue growth channelled state general fund road doesnt provide stable source forward pavlov said month senate deliberative pavlov state invest million additional revenue road taxe stay path said friday pavlov spoke canadian joint review panel decision nuclear waste storage buried feet underground limestone mile lake huron significant environmental harm proposed mile east huron county kincardine ontario joint review panel made terrible mistake recommending nuclear waste dump shore lake huron said pavlov presented town hall meeting oppose ontario power generation plan legislator continue work canadian government solution imploring obama secretary state john kerry resolution involving international joint commission partnership canada handle dispute involving water shared country ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/news/article/Road-plan-will-be-focus-of-Senate-s-extra-7263177.php","m_Places":["Michigan","Macomb","Most","Cotter","Lake Huron","Huron County","Ontario","United States","Canada"],"m_People":["Phil Pavlov","Said Pavlov","Mike Kowall","He Likes","Kevin Cotter","John Kerry"],"m_Companies":["Senate","Chris Aldridge Tribune Staff","Macomb Counties","Path","Ontario Power Generation","Canadian Government","International Joint Commission"],"m_BiGrams":["earned income"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":259}
