{"m_szDocID":"752068","m_szDocTitle":"Q&A: Amory B. Lovins / Energy Expert Talks About California's Crisis - SFGate","m_szYear":"2016","m_szDocSumamry":"Q&A: Amory B. Lovins / Energy Expert Talks About California's Crisis D.F. Tweney, Special to SF Gate Published 4:00 am, Thursday, April 26, 2001 Noted energy expert and former experimental physicist Amory B. Lovins founded the Rocky Mountain Institute , an influential energy think tank based in Snowmass, Colo., in 1982. While still in his 20s, Lovins rose to prominence during the oil crisis of the 1970s as an articulate advocate for energy conservation. Since then, his work has focused on market-friendly approaches to using resources more efficiently and solving environmental problems. A recip","m_szDocBody":"q&a amory lovin energy expert talk californias crisis tweney special gate published thursday noted energy expert experimental physicist amory lovin founded rocky mountain institute influential energy tank based snowmass colo lovin rose prominence oil crisis articulate advocate energy conservation then work focused marketfriendly approaches resource efficiently solving environmental problem recipient macarthur fellowship lovin recent book natural capitalism creating industrial revolution recent visit california lovin met gov grey davis made numerous public speaking appearance span day caught earth day technology role causing solving california energy crisis lot people blame internet californias web server farm current energy crisis california rank united state percapita energy consumption here popular night prince sat courtside warrior game western fuel effectively spread urban myth internet percent electricity actual number percent fact californias capita power consumption essentially flat year good deal population growth demand grown grew average rate percent year twofifth national average quarter reduction electric intensity united state coming california myth server farm information technology causing california experiencing soaring demand demand soar demand crawled technology industry biggest consumer power biggest electricity california pumping water mountain therefore water efficiency good save electricity big webhosting facility exodus consume lot power read press watt square foot office act kind small smelter measured intensity typically watt square foot however lower office year replaced window server linux box size book called rebel netwinder peak watt poke watt faster cheaper capable boxe put together space percent electricity boxe replace technology solve energy crisis practically electricity severalfold efficiently lower cost service quality squarefoot household month worth electricity normal aspen minus degree occasion harvested banana crop inside furnace superwindow superinsulation cost furnace cost instal superwindow technology called heat mirror southwall technology palo alto rocky mountain institute tenet small profitable argued decentralised power grid reliable centralised one long power plant back yard back yard basement rooftop driveway coming fast hypercar inc web describe car developing milepergallon midsize sport utility vehicle run hydrogen fuel cell volume production year hydrogen fuel cell car drive work plug spare hydrogen producing capacity nearby building plug electric grid sit desk car power plant wheel sending back kilowatt utility earn back half cost owning car hypercar vehicle fleet fully built out time generating capacity current national grid people liking proposition put coal nuclear plant business american hellbent buying biggest heaviest fuelefficient suvs find electric car sold well market fuelefficient vehicle true battery car sell well pretty good reason hybrid car honda insight drive toyota prius selling hotcake give basic spec hypercar revolution concept car handle adult cubic feet cargo half tonne capacity haul percent grade bit lexus second sporty light slippery cruise mile hour energy lexus air conditioner body dent rust fatigue radar stealthy bullet resistant know attribute modern urban environment technology buy borrow steal energy rmi web site book called homemade money saving energy dollar home order rent house apartment basically light appliance efficient one american council energy efficient economy put annual guide efficient appliance market give gadget palm pilot cell phone tivo essentially electricity indeed good evidence web ecommerce information revolution save energy electricity use office building turn thermostat degree summer hot afternoon chance notice save percent peak energy load simple one office venetian blind tilt light bounced ceiling god intended room suffused diffuse soft light turn light optimistic people learn conserve energy efficiently yeah people pretty smart plenty incentive energy save money short term curtailment neednt painful turning anyway switch cut bill summer ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.sfgate.com/news/article/Q-A-Amory-B-Lovins-Energy-Expert-Talks-About-2927952.php","m_Places":["California","Snowmass, Colo.","Most","United States","Palo Alto"],"m_People":["Amory B. Lovins","Gray Davis"],"m_Companies":["Sf Gate","Rocky Mountain Institute","Fuels Association","Linux","Southwall Technologies","Tenets","Hypercar Inc.","Revolution","American Council","Tivo","Indeed"],"m_BiGrams":["energy crisis"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":564}
