{"m_szDocID":"752487","m_szDocTitle":"Goodbye to the open road? - LA Times","m_szYear":"2008","m_szDocSumamry":"Opinion Goodbye to the open road? Today's question: What's the future of the personal automobile? Previously, White and Taylor discussed calls to build more nuclear power plants , T. Boone Pickens' alternative-energy plan and offshore drilling . More electric, less drivingPoint: V. John White Four-dollar gasoline has sent shock waves through the U.S. economy. Indeed, for the first time in memory, U.S. gasoline consumption has declined. India's and China's rising demand for oil to power their explosion in automobile use is putting pressure on the world's oil supply system. Global production of ","m_szDocBody":"opinion goodbye open road today question future personal automobile previously white taylor discussed call build nuclear power plant boone picken alternativeenergy plan offshore drilling electric drivingpoint john white fourdollar gasoline shock wave economy indeed time memory gasoline consumption declined indias chinas rising demand oil power explosion automobile putting pressure world oil supply system global production car projected rise million year million worldwide competition gasoline push fuel price assuming oil production peaked supply expand meet global demand gasoline demand fallen people train buse bike personal automobile remain primary mean american mobility remain decade come book traffic drive and tom vanderbilt write easier remove internal combustion engine car remove driver china india driving global oil demand competing rest world gasoline keeping car afford energy power tough big required kind energy car autos energy increasing vehicle efficiency expanding electricity car truck hold promise battery electric drive technology rapidly improving car sold california hybrid onboard battery electric drive component regenerative braking system chevy volt plugin hybrid showroom fall small massachusett company system supplying plugin retrofit kit toyota prius enable car run solely electricity mile increase gas mileage mile gallon bmw plan introduce batterypowered mini cooper hydrogenpowered fuel cell follow drive platform hybrid plugin use electricity transportation making global warming worse mean renewable energy driving reduce gasoline demand stave higher fuel price california legislature pass bill curb urban sprawl encouraging transportation housing construction reduce driving voter chance pass billion bond highspeed rail system jerry hate subsidy government regulation preserve personal freedom automobile provide state federal government step challenge aggressive combination regulatory stick financial carrot accelerate public private investment transform power personal automobile john white executive director sacramentobased centre energy efficiency renewable technology make predictionscounterpoint jerry taylor john humility demand acknowledge idea personal automobile future hydrogenpowered fuel cell economic horizon battery technology advance extent introduction lowcost highperforming allelectric vehicle plugin hybrid technological advance make superefficient internalcombustion engine reality advanced cellulosic ethanol methanol emerge lowestcost fuel future exotic natural gasfired synthetically fueled car essentially turning coal oil card organisation sort time machine simply pretend know think john discount possibility oil price return historic have car tomorrow lot car today recent statistical analysis world crude oil price quarter san diego economist jame hamilton find statistically significant scarcity signal whatsoever conclude the real price oil follow random walk drift pointedly note argued economist understand something predict happen next oil price interesting stock price another economic variable which understand completely unable predict know however price gasoline public anxiety reliance foreign oil greenhouse gas emission market actor mean motive pursue promising avenue research carrot stick financial carrot euphemism tax dollar engage sort corporation hijack earning end public treasury pay paid corporate stockholder regulatory stick promote preordained geologic demographic technological reality introduce possibility error government make wrong bet promising technology industry emerge quickly time money wasted promoting commercial deadend agree john automobile manufacturer primarily interested making money limb suggesting mean produce car people buy oil price continue rise battery fuel cell perform future say consumer buy car prescribe automaker lust profit move heaven earth make car well wrong however future oil price chance technological advance number scientific front policy proscription harm good necessarily hate subsidy government regulation john however deeply distrust utility automotive energy arenas good reason first distrust ability politician wellorganized special interest adept rigging market detriment public cover solving social problem see ethanol boondoggle second doubt omniscience policy planner pretend ridiculous certainty future hold multiple hardtopredict scientific economic horizon jerry taylor senior fellow cato institute ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.latimes.com/opinion/la-oew-taylor-white21-2008aug21-story.html","m_Places":["United States","India","China","California","Massachusetts","Sacramento"],"m_People":["Jerry Taylor","T. Boone Pickens","V. John","Tom Vanderbilt","Chevy Volt","James Hamilton","Energy Arenas"],"m_Companies":["Indeed","Bmw","Uc San Diego","Signal","Cato Institute"],"m_BiGrams":["oil price","personal automobile","fuel cell"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":575}
