{"m_szDocID":"762653","m_szDocTitle":"Bush Touts Alternative Energy, HSAs - TheStreet","m_szYear":"2016","m_szDocSumamry":"TheStreet Bush Touts Alternative Energy, HSAs By TSC Staff | 02/01/06 - 07:28 AM EST Reprint Rising healthcare costs and a dependence on unreliable overseas energy threaten U.S. economic autonomy and could be partially cured through technology, President Bush said in his State of the Union address. Addressing Congress ahead of midterm elections this fall, Bush advocated the development of alternative fuels to help cut U.S. energy imports by three-quarters over the next two decades. Specifically, Bush called for expanded research into a form of ethanol that is derived from agricultural waste. \"","m_szDocBody":"thestreet bush tout alternative energy hsas tsc staff est reprint rising healthcare cost dependence unreliable overseas energy threaten economic autonomy partially cured technology president bush state union address addressing congress ahead midterm election fall bush advocated development alternative fuel cut energy import threequarter decade specifically bush called expanded research form ethanol derived agricultural waste our goal make kind ethanol practical competitive year bush televised address breakthrough technology reach great goal replace oil import middle east bush address contained sweeping proposal par year illfated initiative reform social security unveiled plan expand cleanenergy research federal level touted zeroemission coalfired power plant solar wind technology clean safe nuclear energy increase research battery hybrid electric car pollutionfree car run hydrogen fund additional research cuttingedge method producing ethanol corn wood chip stalk switch grass said healthcare bush technology market liberalisation strengthen doctorpatient relationship ease burden ageing baby boomer generation expected advocated expansion health saving account combine highdeductible insurance policy taxfavored saving account ","m_szGeo1":"United States","m_szSourceType":"source_investments","m_szSrcUrl":"http://www.thestreet.com/story/10265594/1/bush-touts-alternative-energy-hsas.html","m_Places":["Est","United States","Middle East","Boomer"],"m_People":[],"m_Companies":["Congress","Social Security"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":157}
