{"m_szDocID":"770878","m_szDocTitle":"Next Big Future: Crude oil traded below $70 a barrel","m_szYear":"2008","m_szDocSumamry":"Crude oil traded below $70 a barrel This site has discussed effective energy plans. Energy Technology Plan This site has proposed an energy plan with a greater focus on applying better energy technology. The plan is not solely focused on CO2 emissions. Short term Efficiency and drilling for regular and enhanced recovery, policy that discourages coal and fossil fuel and encourages nuclear and renewables. Try to reduce fuel usage 2-4% per year and try to increase oil from drilling and biofuels by 3-6% per year. Accelerate the development and deployment of inflatable electric cars and adapting ca","m_szDocBody":"crude oil traded barrel discussed effective energy plan energy technology plan proposed energy plan greater focus applying energy technology plan solely focused emission short term efficiency drilling regular enhanced recovery policy discourage coal fossil fuel encourage nuclear renewable reduce fuel usage year increase oil drilling biofuel year accelerate development deployment inflatable electric car adapting car tata nano plug electric vehicle encourage adoption electric bike scooter china million building million year electric scooter reach highway speed folding ebike rolled public transit build factory mass producible meltdown proof temperature nuclear reactor accelerate factory mass producible hyperion power uranium hydride reactor currently targeting deployment build fuji molten salt reactor thorium burn thorium uranium plutonium leave year half life material mid term big nuclear buildup thermoelectric transmission efficiency triple nuclear power mit annular nuclear fuel increase power existing reactor uprate technology advanced thermoelectric plant energy nuclear fossil fuel reduce coal death coal air pollution death combined coal over time force death current iraq war fossil fuel air pollution usa moving billion tonne coal freight rail traffic diesel fuel usage time nuclear displace coal lot oil midlong term advanced nuclear fission nuclear fusion renewable geothermal wind kitegen superconducting wind turbine solar concentrated solar municipal rural power configuration favourite coolearth solar balloon genetically modified organism biofuel part term step impact midterm fully fund nuclear fusion power generation possibility create policy accelerate research deployment time small cost achieve large scale chance concept description scale net energy net energy small success funded plasma focus year sale xscan ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://nextbigfuture.com/2008/10/crude-oil-traded-below-70-barrel.html","m_Places":["China","Fuji","United States"],"m_People":[],"m_Companies":["Hyperion","Us Forces"],"m_BiGrams":["fossil fuel"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3],"m_TriCnt":[],"m_iDocBodyWordCnt":249}
