{"m_szDocID":"789685","m_szDocTitle":"Scientific American Climate Coverage (1960-present) - Scientific American","m_szYear":"2015","m_szDocSumamry":"Scientific American Climate Coverage (1960-present) November 26, 2007 Stumble Upon Advertisement Humanity's ability to change the climate and subsequent impacts, including rising sea levels, has been apparent for centuries. Scientific American has been following scientific thinking on the subject almost since Svante Arrhenius proposed the idea in 1896. Following is a partial bibliography, stretching back only as far as 1960, of our coverage of this issue. December 2007, Vol. 297, Num. 6, pg. 40, ENOUGH HOT AIR ALREADY, by The Editors. December 2007, Vol. 297, Num. 6, pg. 42, MEANINGFUL GOALS F","m_szDocBody":"scientific american climate coverage present stumble advertisement humanity ability change climate subsequent impact including rising sea level apparent century scientific american scientific thinking subject svante arrhenius proposed idea partial bibliography stretching back coverage issue vol num hot air already editor vol num meaningful goal climate talk jeffrey sach vol num making carbon market work david victor danny cullenward science talk ethic climate change vol num climate change law jeffrey sach satellite pinpoint predict pollution larry greenemeier world human david biello prediction global warming impossible karen hopkin climate change uncertainty principle david biello mass extinction tied past climate change david biello climate change pollution risingthank overwhelmed ocean plant david biello coalfriendly climate kansas david biello vol num oceangoing iron sourish basu bush administration pushes climate change action future david biello hot water ice age defrosted warming ocean rise david biello nuclear power reborn david biello world leader urge action climate change david biello north pole melting david biello sunny outlook sunshine provide electricity david biello ancient shell harden link climate change greenhouse gase david biello genetic seed bank needed livestock video david biello vol num physical science climate change william collin robert colman jame haywood martin manning philip mote capturing atlantic capricious current david biello coral reef losing ground pacific david biello brown haze cooking fire cooking earth too david biello insurer global warming make region hot handle victoria schlesinger meredith knight vol num earth people interview alan weisman vol num warmer ocean stronger hurricane kevin trenberth stronger link found hurricane global warming david biello blighting plant choking lung warming world smog effect david biello rain spain stay plain sourish basu cloud rival auroras bigger brighter sourish basu water hot hope hurricane david biello arctic thaw spring forward david biello blowing wind arctic plant move fast climate change david biello impure driven snow david biello cutting carbon enough climate intervention turn heat nikhil swaminathan long day global warming answer david biello plant villain climate change meredith knight planning picnic warming world satellite forecast rain david biello combating climate change farming global warming solution david biello hot potato global warming threaten spud peanut david biello climate changing pollution risingagain david biello combating climate change building better wasting less david biello science talk encyclopaedia life end john horgan pessimism steve mirsky ocean park coral rebound david biello combating climate change industrialstrength effort eliminate excess emission david biello second science north america bouncing back ice age steve mirsky combating climate change scaling back greenhouse gas emission keeping light david biello climate change happening effect severe cost fix david biello water main precipitationnot light nutrientsdetermine tropical tree thrive david biello vol num climate change refugee jeffrey sach vol num conservative climate david biello vol num gassing hydrogen sunita satyapal john petrovic george thomas picture oceanic twilight zone microscopic creature hindering carbon sequestration david biello reduce air pollution rely ethanol necessarily david biello refuge dwindling amphibian population david biello tree global warming rightnot exactly nikhil swaminathan changing clime global warming impact appearing globe david biello dust bowl southwest drying nikhil swaminathan vol num pole position charle choi vol num diesel clean steven ashley year forecast climate zone human seen minkel future clean coal power tied uncertain success carbon capture storage david biello happy international polar year david biello second science great backyard bird count calling steve mirsky climate change verdict science debate end solution debate begin david biello science talk heat steve mirsky final report human caused global warming david biello climate change science move proof prevention david biello vol num moving kyoto jeffrey sach vol num methane plant climate change frank keppler thomas rockmann global warning paris bloom winter scientist debate climate change david biello science committee wrangling climate change paris david biello scientist spend year watching leaf litter decay clue climate change david biello ancient coral reveal future stronger monsoon harsher drought david biello plant adapt climate grain david biello resurrect electric car with tweak steven ashley scientific nature researcher volcanic eruption climate lab david biello fish fin climate change hurting cold water fish david biello vol num ethanol long haul matthew wald warmer atlantic climate change presage more worse western wildfire david biello earth climate tune eccentric orbital rhythm david biello warm pour climate change produce fewer extreme monsoon rain david biello mysterious stabilisation atmospheric methane buy time race stop global warming david biello temperate zone forest fire cool climate alison snyder service sector hook greenhouse gas emission david biello appalachian triggered ancient ice age minkel gravity measurement confirm greenland glacier precipitous meltdown david biello earth tilt spawn rise fall specy david biello climate change affect forestfloor ecosystem ciara curtin vol num impact deep peter ward rare mineral implicate global warming minkel tree ring extend record hurricane activity minkel chemical process make fuel carbon dioxide david biello sunshine global warming sceptic minkel science talk nuclear energy future mousecheese relationship steve mirsky hurricane force david biello global warming show fly gene minkel vol num plan energy wayt gibb vol num hope hydrogen joan ogden vol num rise renewable energy daniel kammen vol num nuclear option john deutch ernest moniz vol num coal david hawkin daniel lashof robert william vol num efficient solution eberhard jochem vol num fueling transportation future john heywood vol num plan carbon cheque robert socolow stephen pacala vol num climate repair manual gary stix anaemic phytoplankton absorb carbon thought minkel vol num power grid hydrogen economy paul grant chauncey starr thomas overbye expert carbon dioxide make minute portion atmosphere global warming traced tiny amount change produce large effect pieter tan bee flower diversity decline tandem david biello warming climate increase western wildfire woe david biello bird extinction estimate low david biello climate change benefit crop karen schrock science talk bering sea radiation historic tortoise steve mirsky pulitzer prizewinning naturalist edward wilson steve mirsky warming atmosphere expand tropic david biello climate change blamed pleistocene megafauna bust boom david biello warming climate earlier bird catches worm david biello coral withstand bleaching feeding david biello scientist predict extinction global warming david biello vol num globalisation hurt world poor pranab bardhan vol num hybrid vehicle gain traction joseph romm andrew frank balloon data confirm antarctic warming trend david biello climate model predict greater melting submerged city david biello study support connexion climate change malaria rise david biello statistical analysis bolster theory linking warmer ocean stronger hurricane david biello vol num green molecule terrence collin chip walter vol num danger ocean acidification scott doney greenland glacier melting move david biello vol num protecting orlean mark fischetti surface permafrost disappear david biello ice core extend climate record back year david biello gene swapping help bacteria adapt david biello selective logging fail sustain rainforest tracy staedter climate model predict extreme tracy staedter vol num set priority wayt gibb vol num economic full world herman daly vol num profit carbon amory lovin vol num climax humanity george musser climate flux fostered early human speciation diatom study suggest kate wong climate change set dune motion study suggest sarah graham vol num bury global warming robert socolow vol num doubt product david michael earth holding sun heat study suggest sarah graham vol num shaping future steven popper robert lempert steven banke climate model reveal inevitability global warming sarah graham vol num road fuelcell car steven ashley vol num human alter global climate william ruddiman capturing carbon dioxide don monroe vol num punctuated disequilibrium claudio angelo climate change desiccating planet researcher conclude sarah graham dna evidence weigh ice age extinction debate sarah graham threat extinction plague specy sarah graham vol num abrupt climate change richard alley vol num controlling hurricane ross hoffman ice shelf loss sped glacier movement sarah graham expert past temperature determined ice core robert mulvaney model predict future heat wave intense sarah graham surface climate effect felt ocean floor sarah graham vol num methane made climate jame kasting global study link climate rate childhood asthma sarah graham study resolve longstanding global warming debate alla katsnelson vol num question hydrogen economy matthew wald vol num defusing global warming time bomb jame hansen satellite data reveal drought amazon rain forest sarah graham climate changed genetic canadian lynx sarah graham advertisement ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.scientificamerican.com/article/clash-climate-change-coverage/","m_Places":["Friendly","Kansas","North Pole","Outlook","U.s.","Spain","Auroras","Springs","North America","Kyoto","Paris","Rains","Appalachians","Gravity","Greenland","Affects Forest-floor","Bering Sea","Submerged Cities","New Orleans","Bury","Made"],"m_People":["Svante Arrhenius","Jeffrey D. Sachs","David G. Victor","Danny Cullenward","Larry Greenemeier","David Biello","Karen Hopkins","Can Sunshine","William Collins","Robert Colman","James Haywood","Martin R. Manning","Philip Mote","Victoria Schlesinger","Alan Weisman","E. Trenberth","Nikhil Swaminathan","Long Day","John Horgan","Steve Mirsky","Sunita Satyapal","John Petrovic","George Thomas","Charles Q. Choi","Steven Ashley","Frank Keppler","Thomas Rockmann","Matthew L. Wald","Alison Snyder","Ciara Curtin","Peter D. Ward","W. Wayt","Joan Ogden","Daniel M. Kammen","John M. Deutch","Ernest J. Moniz","David G. Hawkins","Daniel A. Lashof","Robert H. Williams","Eberhard K. Jochem","John B. Heywood","Robert H. Socolow","Stephen W. Pacala","Gary Stix","Paul M. Grant","Chauncey Starr","Thomas J. Overbye","Karen Schrock","Edward O. Wilson","Pranab Bardhan","Joseph J. Romm","Andrew A. Frank","Terrence J. Collins","Chip Walters","Scott C. Doney","Mark Fischetti","Tracy Staedter","E. Daly","Amory B. Lovins","George Musser","Early Human","Kate Wong","Sarah Graham","David Michaels","Steven W. Popper","Robert J. Lempert","Steven C. Bankes","William F. Ruddiman","Don Monroe","Claudio Angelo","Richard B. Alley","Ross N. Hoffman","Robert Mulvaney","James F. Kasting","Alla Katsnelson","James Hansen"],"m_Companies":["Scientific American","Humans","Bush Administration","Atlantic","Meredith","Rain","Move","Picnic","Rebound","Diesels","Zones","Polar","Monsoons","Adapt","Presage","Wildfires","Eccentric","Orbital","Monsoon","November 17","Plan B","Wildfire","Bust","Theory","Sustain","Dunes","Amazon Rain Forest"],"m_BiGrams":["david biello","vol num","climate change","global warming","sarah graham","biello vol","biello climate","steve mirsky","science talk","change david","graham vol","jeffrey sach","ice age","warming david","combating climate","sach vol","num climate","sourish basu","nikhil swaminathan","biello combating","biello science","steven ashley","carbon dioxide","climate model","model predict","study suggest"],"m_TriGrams":["david biello vol","biello vol num","david biello climate","biello climate change","climate change david","change david biello","sarah graham vol","graham vol num","global warming david","warming david biello","combating climate change","jeffrey sach vol","sach vol num","vol num climate","david biello combating","biello combating climate","david biello science"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[75,47,33,19,12,9,8,7,5,5,5,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3],"m_TriCnt":[9,9,8,6,5,5,5,5,4,4,4,3,3,3,3,3,3],"m_iDocBodyWordCnt":1349}
