{"m_szDocID":"790328","m_szDocTitle":"Could Huge Solar Blimps Haul Cargo Fast and Clean at 30,000 Feet? | CleanTechnica","m_szYear":"2010","m_szDocSumamry":"Could Huge Solar Blimps Haul Cargo Fast and Clean at 30,000 Feet? April 13th, 2010 by Susan Kraemer     Could a solar-powered dirigible be the cargo ship of our peak-oil, carbon-constrained future? If the inventor of the patent pending  High Speed Solar Airship is  correct, the future of long haul cargo combines solar powered transmission married to centuries-old dirigible technology. Like the old  blimp, a gas envelope lifts the airship from sea level to its cruising  altitude. Unlike the old blimp, this new solar blimp would cruise at a much  higher altitude: at 30,000 feet. The HSSA would b","m_szDocBody":"huge solar blimp haul cargo fast clean feet susan kraemer solarpowered dirigible cargo ship peakoil carbonconstrained future inventor patent pending speed solar airship correct future long haul cargo combine solar powered transmission married centuriesold dirigible technology blimp gas envelope lift airship sea level cruising altitude unlike blimp solar blimp cruise higher altitude feet hssa powered square feet thinfilm solar cell integrated application top balloon rated power however rating earth altitude efficiency boost solar power aloft freezing cold altitude addition height cloud level sunlight unobstructed provide sun maximum earthbound solar hour day thinner air height mean faster speedsthe foot long airship reach daytime speed mph utilising mph average jet stream wind speed continue flying night speed mph carrying tonne cargo million cubic feet helium inventor limited flight testing scale model work full size low carbon cargo transport option future company solarairship claim million blimp competitive speed cost conventional trucking travelling jet stream assist water weigh unloading unloading company land place road reach landing strip carrying cargo cheaply traditional vtol aircraft provide implication disaster relief emergency rescue significant however helium gas loft solar cargo blimp scarce resource produced slowly decaying uranium thorium buoyancy gas option ammonia coal gas hydrogen methane worse greenhouse gase dangerously flammable option solarheated air lifting envelope hot air rise original dirigible lofted air heated burner underneath burning fuel though solar heat air lift cleantechnica susan kraemer journalist cleantechnicas completely free electric car report electric car early adopter follower want date hottest cleantech new subscribing free cleantech newsletter eye sectorspecific new also free solar energy newsletter electric vehicle newsletter wind energy newsletter tag feet cargo dirigible efficient solar speed solar airship hssa jet stream solar blimp susan kraemer write cleantechnica csptoday renewable energy world published wind energy update solar plaza earthtechling pvinsider greenprophet ecoseed nrdc onearth matternetwork celsius energynow scientific american serial entrepreneur product design susan bring innovator perspective inventing carbonconstrained civilization necessity mother invention solving climate change mother necessitiesas lover history scifi enjoy chronicling strange future creating interesting time follow susan related post ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://cleantechnica.com/2010/04/13/could-huge-solar-blimps-haul-cargo-fast-and-clean-at-30000-feet/","m_Places":[],"m_People":["Susan Kraemer"],"m_Companies":["Mph","Twitter","Scientific American"],"m_BiGrams":["solar blimp","susan kraemer","jet stream"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":335}
