{"m_szDocID":"792157","m_szDocTitle":"Thorium-Powered Cars Could Be The Way of the Future","m_szYear":"2014","m_szDocSumamry":"That photo is not the right car either, Ian. Homo Internetus Oh no, not this story again.  Laser Power Systems is a crackpot or a scam, to get from fission to laser, a machine must take the heat from the fission to create steam to drive a turbine to create electricity to power a laser.  What they describe isn’t even a good scam.  Would everyone please stop writing about this, it’s distracting from the real potential that LFTRs and MSRs have. Lance Sjogren Damn straight, what’s the world coming to when you can’t even rely on a scammer to do a good scam! right_wing_bob Why do they put a current ","m_szDocBody":"photo car either ian homo internetus storey again laser power system crackpot scam fission laser machine heat fission create steam drive turbine create electricity power laser describe isnt good scam stop writing this distracting real potential lftr msr have lance sjogren damn straight what world coming rely scammer good scam rightwingbob put current date written year ago presented multiple time wrong forgiven read exact stuff before forgive update progress prototype make sense nuclear airplane promoted make dirty bomb steal someone car rig nuclear important part future stop making people crackpot real purpose article right recycling recycle garbage storey lance sjogren thorium powered car probaby insanely complex machine thorium potential car fuel form thorium power plant fueling electric grid power battery electric vehicle thorium reactor battery thorium powered car roger blomquist ian aware power plant nuclear reactor heavy shielding onboard reprocessing plant asked insurance compny premium charge ","m_szGeo1":"","m_szSourceType":"source_general","m_szSrcUrl":"http://www.theautofuture.com/2014/08/12/thorium-powered-car/","m_Places":[],"m_People":["Lance Sjogren","Roger Blomquist"],"m_Companies":[],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":146}
