{"m_szDocID":"822544","m_szDocTitle":"Alternative and Renewable Energy Sources - Find Out How They Work Here","m_szYear":"2016","m_szDocSumamry":"Solar Cooking Geek Out With All Kinds Of Alternative Energy! Here you will find the answers to all things alternative energy: solar power, wind energy, geothermal, nuclear and so much more. Ever wonder how solar energy works? Or how big wind turbines have to be? What's the best alternatives for the environment? How many other safe, eco-friendly alternative energy sources are really out there? There's so many answers to all kinds of these questions I just want to geek out! You can find tips on how to build your own solar panels, learn how to save money on your energy bills, recondition your bat","m_szDocBody":"solar cooking geek kind alternative energy answer alternative energy solar power wind energy geothermal nuclear more solar energy work big wind turbine alternative environment safe ecofriendly alternative energy source there answer kind question geek out tip build solar panel learn save money energy bill recondition battery improve carbon footprint convert car electric kind stuff page discover variety energy fun fact latest new hybrid electric car affordable car part importantly kind amazing alternate energy ideas apply life geek out alternative energy geek category solar energy important turn lot thousand year magnifing glass start wood fire ancient roman glass window cold sunlight trap heat greenhouse invented make season fruit vegetable wind energy work wind energy pretty geekerific abundant renewable energy resource sun solar power play caused uneven heating the air land heat faster air water earth surface atmosphere sun fossil fuel made practise well fossil fuel gasoline diesel converted transportation fuel ethanol biodiesel run car truck airplane gasoline powered machine burned smaller carbon footprint petroleum based fuel geothermal energy well geothermal energy resource heat deep earth underneath earth crust layer extremely hot melted rock called magma magma rise close earth surface form volcanos fumarole hot spring geyser nuclear energy heat light produced splitting merging nuclei atom process merging called fusion controlling contained space dangerous benefit enormous process splitting called fission nuclear power plant today tidal energy great potential day earth ocean move enormous amount water converting electricity form hydropower tide caused gravitational reaction sun moon make tidal power predictable wind solar energy geek thumb biomass energy processe extract renewable energy living recently living organic material type are wood wood waste municipal solid waste our garbage biogas methane landfill biofuel kind solar energy plant energy sun store process photosynthesis hydrogen energy chemical element hydrogen abundant element universe star night rich earth occur gas naturally own combined element oxygen make water organic compound hydrocarbon propane methanol gasoline renewable energy source sun wind rain tide geothermal heat basically naturally replenished earth include hydrogen biomass wood wood waste sewage waste landfill waste biofuel are biogas ethanol biodiesel cold fusion energy astounding potential dramatically change world doubt close eye minuted imagine buying laptop cellular phone needing charge ever sound amazing agree yet benefit human power countless generating free power advanced technique method nice workout impact health strengthen muscle fit body course disadvantage well hydroelectric power work discover hydroelectricty green way making efficient learn advantage disadvantage future alternative energy source diy energy project easier think chance build solar cooker solar oven wind turbine solar pool heater thing start working alternative energy project today save money keeping mother earth healthy green ","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://www.alternative-energy-geek.com","m_Places":["Well"],"m_People":[],"m_Companies":["Diesel","Pool"],"m_BiGrams":["alternative energy","solar energy","wind energy","energy source","renewable energy"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":432}
