{"m_szDocID":"828313","m_szDocTitle":"Electric cars on a budget | Midwest Energy News","m_szYear":"2011","m_szDocSumamry":"Electric cars on a budget Don't miss the latest headlines. Sign up for our Daily Digests. Midwest Headlines National Headlines A electric car for $6,000? Yes, but there's a catch... Yesterday, we told you about an Ohio company that offers electric Mercedes SUV conversions for $75,000 . That's more than most people in the U.S. make in a year. Even the compact EV options aren't cheap. The 2012 Nissan Leaf starts at about $35,000. Tax credits and incentives can push that price down into the low-20s depending on where you live and assuming you make enough money to actually take advantage of the cr","m_szDocBody":"electric car budget miss latest headline daily digest midwest headline national headline electric car yes catch yesterday told ohio company offer electric mercede suv conversion people make year compact option cheap nissan leaf start tax credit incentive push price low depending live assuming make money advantage credit option lot people electric car evs rare spot neighbourhood car dealer internet ebay instance fuel type select electric navigate ebay carsandtruck scroll left column refine search writing evs sale site source tradin post which dated design updated regularly feature dozen car country offering limited diverse handful modestly priced readytodrive conversion prizm california battery promise range mile ohio handy interesting asis conversion work newton kansas beetle run battery ford escort ohio controller bidding now car caveat emptor that professionallydone conversion require visit electrician trip repair shop wrong good luck brake pad citicar autozone worth remembering waiting big automaker embrace electric car backyard mechanic small shop country figuring year fact electric car niche product now terribly complicated them battery theory technology improve range increase charge time faster price down classified patient filed under ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://midwestenergynews.com/2011/10/14/electric-cars-on-a-budget/","m_Places":["Ohio","United States","California"],"m_People":["Ev Tradin"],"m_Companies":["Daily Digests","Ebay","Autozone"],"m_BiGrams":["electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5],"m_TriCnt":[],"m_iDocBodyWordCnt":178}
