{"m_szDocID":"828437","m_szDocTitle":"EVs and car-sharing: A match made in heaven | Midwest Energy News","m_szYear":"2011","m_szDocSumamry":"EVs and car-sharing: A match made in heaven Don't miss the latest headlines. Sign up for our Daily Digests. Midwest Headlines National Headlines Don't worry. He's housebroken. Electric cars, while a smart choice for a lot of people, aren't going to be a practical transportation solution for everyone, at least at the moment. If you live in an apartment, for instance, and park on the street, you probably won't have a place to charge up. Or perhaps you're a one-car family that needs to be able to travel long distances once in a while. Sure, the Chevy Volt and other plug-in hybrids address those c","m_szDocBody":"evs carsharing match made heaven miss latest headline daily digest midwest headline national headline worry housebroken electric car smart choice lot people practical transportation solution everyone moment live apartment instance park street place charge onecar family travel long distance while sure chevy volt plugin hybrid address concern battery technology dramatically improve charging station proliferate purely electric vehicle limited application are however situation electric car make lot sense powered gasoline carsharing example service hourcar twin city igo zipcar chicago community car madison popping country chicagos carsharing service playing major role city effort expand electric car infrastructure carsharing eliminate logistical problem private ownership car specific location stored charger service designed short trip eliminating range anxiety evs filled gas shop regular oil change adam aston writing onearth magazine discovered advantage evs car sharing small spartan requiring fewer battery smaller motor typically single driver big city making tiny car smart fortwo ideal aston found electric fortwo performer traffic gasoline counterpart spacious smart dimension offer tanklike comfort suv dart hole traffic car fit nimbly dodge pothole slushy road grinning pint sized great selfconfidence newcomer york importantly evs carsharing service provide incentive publicprivate partnership instal charging station making private ownership electric car practical photo harrynl creative common filed under ","m_szGeo1":"United States","m_szSourceType":"source_industry","m_szSrcUrl":"http://midwestenergynews.com/2011/02/15/electric-vehicles-and-car-sharing-a-match-made-in-heaven/","m_Places":["Twin Cities","Chicago","Madison","New York"],"m_People":["Chevy Volt","Adam Aston"],"m_Companies":["Daily Digests","Zipcar","Creative Commons"],"m_BiGrams":["electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4],"m_TriCnt":[],"m_iDocBodyWordCnt":203}
