{"m_szDocID":"829658","m_szDocTitle":"Is This Rally Sustainable? - MoneyBeat - WSJ","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Is This Rally Sustainable? Morning MoneyBeat is the Journal’s pre-market primer. To receive this morning newsletter via email, click here:  http://on.wsj.com/MoneyBeatUSSignup OVERNIGHT DEVELOPMENTS Global investors shed stocks and commodities Friday and pushed government bond yields in Germany, Japan and the U.K. to fresh lows as a range of political and economic uncertainties continued to take a toll. The Stoxx Europe 600 dropped 1.8% late morning, following modest losses in Asia, as banks and energy companies declined. Government bond yields in Japan, German","m_szDocBody":"rally sustainable morning moneybeat journal premarket primer receive morning newsletter email here overnight development global investor shed stock commodity pushed government bond yield germany japan fresh low range political economic uncertainty continued toll stoxx europe dropped late morning modest losse asia bank energy company declined government bond yield japan germany dragged central bank buying wave risk aversion sparked uncertainty economy earlier stock japan hong kong australia finished lower chinas mainland stock market closed friday breakfast briefing trader investor deride year stockmarket rally hated ever juice left push s&p alltime high saturday rally turn month old period s&p gained sit record close index repeatedly flirted record breaking past year level magnetic pull stock time recovered big selloff span index climbed rapidly back level lost momentum reached stock poised open lower friday reason rally room run s&p rebounded fall driven handful stock primarily amazoncom netflix google parent company alphabet famed fang time around rally broader equallyweighted s&p index consistently outperformed traditional marketcap weighted index past month pointed jim paulsen chief investment strategist economist well capital management note breadth current rally stock york stock exchange hit week wednesday nasdaq nasdaq highest number stock close week high november major indexe climbed back striking distance alltime high interesting move week arguably bond market yield year treasury note slid time yield year treasury note low stock deep red year paulsen note percentage point rise year yield year weighed stock market high time around similar move thirst yield push investor move heavily equity still plenty reason investor concerned sustainability rally friday job report raised question health labour market consistent bright spot economy past year concern growth abroad remain persistent worry market beset worry risk widely word economic outlook day societe generale strategist wrote client note earlier week explain investor unsure direction stock latest american individual investor weekly sentiment survey respondent considered neutral stock headed month versus calling bullish bearish moneybeat pointed bullish indicator percentage respondent neutral stock market crosse week ago equity higher year later daily factoid day jury acquit claus von bulow charge hed murder heiress wife martha sunny von bulow moneybeat wake friday bad job report janet yellen speech philadelphia closely watched clue future rate hike moneybeat paul vigna stephen grocer discuss speech wall street journal ben eisen spencer jakab key event university michigan consumer sentiment survey prior consensus consumer sentiment remain cheap gasoline low interest rate rebound stock winter university michigan unveil monthly report consumer sentiment showing household confident economy bakerhughes rig count increase rig count oil service company baker hughes reshape outlook oil production rig added week consecutive week decline oil price gaining momentum producer incentive churn output slash gain price made past week supply increase stock watch share lost ahead bell socialmedia company notified million user account risk over file close million purported username password made public uslisted share vale dropped premarket brazil federal police blamed brazilian miner bhp billiton catastrophic dam failure killed people year oil company pressured ahead open losse oil future accelerated share chesapeake lost anadarko petroleum fell transocean gave share tesla motor lost ahead open electric car maker review potential defect suspension model number day low year german bund yield friday surpassing alltime low hit thursday read investor shed asset governmentbond yield hit fresh low global investor shed stock commodity pushed governmentbond yield germany japan fresh low range political economic uncertainty continued toll foreign demand soar treasury oneeyed king global hunger government debt intensifying investor seek return negative yield recordlow rate found japan europe boeing defence chief fighter leanne caret president boeing defence space security business focus repairing upgrading hundred jet fighter service stop making aircraft stabilising sale defence business crucial boeing wider investment case oecd call ecb make rate commitment european central bank making clear commitmentnot raise key interest ratesover coming year annual rate inflation exceed target organisation economic cooperation development friday puerto rico debt crisis bill passe house house approved legislationthursdayto stem puerto ricos escalating debt crisis capping unusually bipartisan fraught technically complex compromise measure whatsapp rival line list tokyo york messagingapp operator line corp planning dual listing tokyo york raise million fiveyearold company billion thomas perkin venture capitalist legend dy thomas perkinsone founding father modern venture capital investing died tiburon calif assistant latest blow ipo market atkore international company launching ipo year tepid market offering reason waitatkore international group initial public offering priced share thursday people close deal said range company targeted regulatory filing chart day ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://blogs.wsj.com/moneybeat/2016/06/10/is-this-rally-sustainable/","m_Places":["Germany","Japan","U.k.","Europe","Asia","United States","Hong Kong","Australia","China","Philadelphia","Baker-hughes","Vale","Brazil","Chesapeake","Puerto Rico","Tokyo, New York","Tokyo","New York","Tiburon, Calif."],"m_People":["Jim Paulsen","Claus Von Bulow","Janet Yellen","Paul Vigna","Ben Eisen","Spencer Jakab","Thomas Perkins"],"m_Companies":["Central Bank","Facebook","Amazon.com","Netflix","Google","Wells Capital Management","Nasdaq","Treasury","Societe Generale","American Association Of Individual Investors","Daily Factoid","Wall Street Journal","University Of Michigan","Baker Hughes","Twitter","Bhp Billiton","Anadarko Petroleum","Transocean","Tesla Motors","U.s. Treasury","U.s. Government","Boeing","Oecd","Ecb","European Central Bank","Target","Organization For Economic Cooperation And Development","U.s. House","House","Line Corp.","Atkore International Companies","Atkore International Group"],"m_BiGrams":["investor shed","fresh low","stock market","yield year","consumer sentiment"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":731}
