{"m_szDocID":"843972","m_szDocTitle":"What is Nuclear? / Nuclear Energy","m_szYear":"2016","m_szDocSumamry":"7.9x107 25,300 years Table 1 Energy densities of various energy sources in MJ/kg and in length of time that 1 kg of each material could run a 100W load. Natural uranium has undergone no enrichment (0.7% U-235), reactor-grade uranium has 5% U-235. By the way, 1 kg of weapons grade uranium (95% U-235) could power the entire USA for 177 seconds. All numbers assume 100% thermal-to-electrical conversion. See our energy density of nuclear fuel page for details. Capabilities of Nuclear Power Sustainable Table 1 sums the sustainability of nuclear power up quite well. However, there is quite a bit of t","m_szDocBody":"year table energy density energy source length time material run load natural uranium undergone enrichment reactorgrade uranium way weapon grade uranium power entire usa second number assume thermaltoelectrical conversion energy density nuclear fuel detail capability nuclear power sustainable table sum sustainability nuclear power well however bit talk nuclear fuel uranium running low oil technically nonissue nuclear waste recyclable economically major issue today commercial nuclear reactor burn fuel mined rest thrown depleted uranium nuclear waste recycling programme shut due proliferation economic concern today france japan recycling fuel great success technology exist greatly reduce proliferation concern recycling uranium reserve red book published iaea suggest year uranium reserve current demand large supply uranium dissolved seawater low concentration found cheapenough extract yet people close nuclear reactor run thorium fuel ecological operation nuclear power plant emit environment hot water classic cooling tower icon nuclear reactor that cooling tower clean water vapour out climatechanging gase nuclear power generation certainly produced mining construction etc amount time coal time natural gas plant detail coming soon spent nuclear fuel nuclear waste handled properly disposed geologically affecting environment way theyre safe too march nasa scientist jame hansen ppm limit fame published paper showing nuclear energy saved total million live history worldwide displacing air pollution killer include death nuclear energy responsible accident independent nuclear power country approach energy independence addicted oil major national global security concern reason electric plugin hybrid electric vehicle phevs powered nuclear reactor reduce oil demand order magnitude additionally nuclear reactor design provide highquality process heat addition electricity turn desalinate water prepare hydrogen fuel cell heat neighbourhood industrial processe problem nuclear power nuclear waste atom split release energy smaller atom left left excited state emitting energetic particle biological damage longest lived atom dont decay stability hundred thousand year nuclear waste controlled environment long designing system long daunting task major selling point antinuclear group dramatic accident major accident occurred commercial power plant chernobyl mile island fukushima chernobyl uncontrolled steam explosion released large amount radiation environment killing people requiring mass evacuation hundred thousand people causing cancer case mile island partialcore meltdown coolant level dropped fuel allowed melt hurt radiation released plant close causing operating company investor lose lot money fukushima station blackout caused huge tsunami neighbouring plant lost cooling decay heat melted core radiation released public evacuated accident scary people comfortable nuclear power cost nuclear power plant larger complicated power plant redundant safety system built plant operating safely complexity upfront cost nuclear power plant higher comparable coal plant plant built fuel cost fossil fuel cost general older nuclear plant get money operator make large capital cost investor agreeing finance nuclear power plant stop nuclear reactor nuclear energy turned electricity reference office air quality study hazardous air pollutant emission electric utility steam generating unit final report congress online kharecha hansen prevented mortality greenhouse gas emission historical projected nuclear power environ sci technol press release gabbard coal combustion nuclear resource danger online whatisnuclearcom ","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"https://whatisnuclear.com/articles/nucenergy.html","m_Places":["United States","France","Japan","Chernobyl","Three Mile Island","Fukushima"],"m_People":["James Hansen","A. Gabbard"],"m_Companies":["U.n.","Iaea","Nasa","Tsunami","Congress","Epa"],"m_BiGrams":["nuclear power","nuclear reactor","power plant","nuclear waste","nuclear fuel","nuclear energy"],"m_TriGrams":["nuclear power plant"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[11,6,6,5,3,3],"m_TriCnt":[4],"m_iDocBodyWordCnt":481}
