{"m_szDocID":"853529","m_szDocTitle":"What is nuclear?","m_szYear":"2016","m_szDocSumamry":"What is nuclear? Public education for all things nuclear. History of Nuclear Energy Learn the history of nuclear energy here, from Roentgen’s discovery of x-rays, through the Manhattan project, up to Fukushima. Molten Salt Reactors Details about molten salt reactors. What are they? Where do they come from? What are the pros and cons? Nuclear Risk Assessment Explained New contributor Brian Johnson explains nuclear reactor risk assessment and PRA. New Page on Thorium With Thorium fuel getting attention from many places, we figured it was time for a little page all for it. Check it out. Decay Hea","m_szDocBody":"nuclear public education nuclear history nuclear energy learn history nuclear energy here roentgen discovery xray manhattan project fukushima molten salt reactor detail molten salt reactor they from pros con nuclear risk assessment explained contributor brian johnson explain nuclear reactor risk assessment pra thorium thorium fuel attention place figured time cheque out decay heat basic introduction decay heat posted decay heat major nuclear safety concern discussion fukushima attempt piece happening fukushima reactor accident japan earthquake whatisnuclearcom store time holiday whatisnuclearcom propaganda here mug shirt pin nuclear sermon rachel slaybaugh gave sermon nuclear power pennsylvania audio here happy nuclear science week enjoy annual nuclear science week week isotope understanding isotope basic prereq understanding basic nuclear energy dose here actual front page time finally added bigpicture overview nuclear power front page serve launchpad article ample linking fast reactor fast reactor way make nuclear power sustainable fast reactor programme shut fast reactor pros con strange beast here nuclear fuel cycle fairly basic description concept nuclear fuel cycle nuclear nonproliferation main argument nuclear power time write defining nuclear nonproliferation forum heard whatisnuclearcom set forum discussion kind empty now lot echos action soon recycling breeding ready yucca mountain funding zeroed out time closing fuel cycle discusse mean possible implication are nuclear factoid love good factoid favourite discussion spreadsheet calculate them enjoy nuclear engineer describe nuclear engineer hire them focuse engineer working fission health radiation ready discusse radioactive dose from people afraid plugin hybrid electric vehicle plugin hybrid electric vehicle combined nuclear power heck good idea sustainable transportation why nuclear renaissance describe nuclear renaissance concept related scale energy usage figured aircraft carrier lift top burj dubai night wanted replace nuclear power plant night help visualise energy producing intuition difficulty fantasy completely renewable point counterpoint coop america coop america posted reason nuclear power energy problem briefly summarise view comparison our reading directly site nuclear bingo people nuclear industry print bingo card nuclear renaissance talk attend","m_szGeo1":"","m_szSourceType":"source_general","m_szSrcUrl":"https://whatisnuclear.com/news.xml","m_Places":["Fukushima","Japan","Pennsylvania","United States","America"],"m_People":["Brian Johnson","Rachel Slaybaugh"],"m_Companies":["Renaissance"],"m_BiGrams":["nuclear power","fast reactor","nuclear energy","decay heat","fuel cycle","nuclear renaissance"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[7,4,3,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":316}
