{"m_szDocID":"866348","m_szDocTitle":"Self-driving cars—the next terrorism threat?","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- Self-driving cars—the next terrorism threat? Monday,  6 Oct 2014 |  3:44  AM ET CNBC.com SHARES Reports over the weekend that Tesla could be the latest carmaker to add autonomous features to its products is being greeted with excitement, but experts are concerned that the new industry technology could be susceptible to sinister cybercriminal activity. Egil Juliussen, director of research for infotainment and advanced driver assistance systems at research group IHS Automotive, told CNBC via email that electronics systems in cars currently have no or very limited","m_szDocBody":"selfdriving carsthe terrorism threat monday cnbccom share report weekend tesla latest carmaker add autonomous feature product greeted excitement expert concerned industry technology susceptible sinister cybercriminal activity egil juliussen director research infotainment advanced driver assistance system research ihs automotive told cnbc electronic system car limited security measure the economic opportunity car system pcs tablet smartphone information car easily turned revenue average hacker said read teslas big reveal talk selfdriving feature instead reason hacking controlling car sinister creating traffic chaos murderforhire cyber warfare related terrorist act juliussen deal worstcase scenario believe intellectual property theft common hacking reason future denting auto manufacturer reputation liability issue fbi remain concerned unclassified report obtained newspaper guardian agency predicting autonomous car lethal weapon patrick fallon bloomberg getty image nissan autonomous drive leaf electric vehicle left test driven nissan motor event irvine california opportunity selfdriving car considered big revolution industry technology company hoping slice future revenue research advisory firm lux research predict automaker technology developer forward market worth billion ihs automotive estimate selfdriving car account half vehicle sold north america sale worldwide reaching million unit read american selfdriving car analyst sceptical car future totally autonomous feature forward simple driverassist adaptive cruise control nonetheless cybersecurity remain crucial aspect future product rainer mehl head manufacturing consulting data firm ntt data auto company extremely worried they answered cybersecurity question yet told cnbc interview explaining outcome worse gained kitchen utility refrigerator cybersecurity key said chesnot getty image incremental improvement analyst point academic paper researcher university washington university californiasan diego wirelessly hack car led auto industry waking security threat juliussen add auto manufacturer supplier research acquiring expertise year result show car said the regulator nhtsa national highway traffic safety administration similar organisation europe paying attention research eventually release recommendation legislation add security auto electronic system added expect incremental security improvement year auto manufacturer beef protection telematic connected car system juliussen datemeta monday ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.cnbc.com/2014/10/06/self-driving-carsthe-next-terrorism-threat.html","m_Places":["Tesla","U.k.","Irvine, California","North America","San Diego","United States","Europe"],"m_People":["Egil Juliussen","Patrick T. Fallon","Rainer Mehl"],"m_Companies":["Cnbc.com","Cnbc","Fbi","Guardian","Getty Images","Nissan","Nissan Motor Co","Revolution","Google","Slice","University Of Washington","University Of California","National Highway Traffic Safety Administration"],"m_BiGrams":["auto manufacturer","selfdriving car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":309}
