{"m_szDocID":"866812","m_szDocTitle":"Grid energy storage: The next big thing for Li-ion? | Industrial Minerals","m_szYear":"2016","m_szDocSumamry":"Grid energy storage: The next big thing for Li-ion? By Myles McCormick Tweet Though unlikely to rival the electric vehicle industry for size, grid energy storage is likely to become one of its largest end-markets for lithium-ion batteries. Questions remain as to what size the market will reach, however. The scope for growth in demand for     lithium-ion (Li-ion) batteries continues to drive the     excitement around lithium production. Centre-stage in the frenzy is the expected     surge in demand for Li-ion-powered electric vehicles (EVs),     fronted by Tesla Inc. and its enigmatic CEO, Elon","m_szDocBody":"grid energy storage big liion myle mccormick tweet rival electric vehicle industry size grid energy storage largest endmarket lithiumion battery question remain size market reach however scope growth demand lithiumion liion battery continue drive excitement lithium production centrestage frenzy expected surge demand liionpowered electric vehicle evs fronted tesla inc enigmatic ceo elon musk oftforgotten sister market expected propel liion demand grid energy storage renewable energy sector slated grow exponentially coming year wind energy expanding compound annual growth rate cagr solar energy making necessity way flexibly storing power produced pertinent albemarle inc world big lithium producer predict year approximately trillion worth future infrastructure underutilised storage view liion powered grid provide answer question remain potential liionbased grid technology due difficulty turning profit off expert maintain stood alongside technology grid storage remain cinderella liion storey renewable expected drive growth liion battery grid energy storage source murray storing growth dean frankel yorkbased lux research inc mwh megawatthour energy storage system liion chemistry deployed grid albemarle suggested that driven growth renewable energy resource provide system flexibility balance supply demand lithium carbonate equivalent lce grid energy storage increase cagr higher rate key market liion transportation consumer device touted growth rate lower starting point making money big number predicted term growth prohibitive cost remain central development system right now entire stationary energy storage market place struggling consistent profitable application drive revenue frankel told the cost energy storage system liion storage system significantly past year finding application drive consistent revenue remain challenge added frankel expect rate structure utility change however such start service energy storage provide utility provider finding way operate energy storage compensate owner energy storage system grid expect energy storage system begin making money virtual power plant virtually connecting energy storage system wirelessly smart software management act tandem aggregate load powerful impact grid lux predict liion battery reach gwh gigawatthour installed system annually note they capture energy storage market alternative chemistry deployed flow battery molten salt other remain sceptical big fan grid storage involving liion battery jon hykawy ceo canadabased research group stormcrow research told proponent cherrypick data manage argue liion battery winning path garbage hykawy view important parameter capital cost kwh kilowatthour power produced operation maintenance cost cost build cost daytoday basis run areas liion battery technology trump there largescale pumped hydro project there working example today capital cost energy delivered grid future projection lithium battery hoping achieve said this hykawy maintain success liion battery application evs necessarily transferrable energy storage simply faith that lithium battery make tesla run weight volume critical factor back huge wind farm nuclear plant cost matter foolish playing fiddle issue remain doubt grid energy storage grow substantially coming year reach lofty height evs liion end market dont scale potential robert bayliss managing director roskill information service told noting evs industry transform grid storage indirectly reliant growth renewable wind solar transform anything frankel agree stationary storage remain significantly smaller market liion evs approach eventually surpass consumer electric segment ","m_szGeo1":"Canada","m_szSourceType":"source_news","m_szSrcUrl":"http://www.indmin.com/Article/3547870/Grid-energy-storage-The-next-big-thing-for-Li-ion.html","m_Places":["United States","New York","Canada","Tesla"],"m_People":["Myles Mccormick","Elon Musk","Dean Frankel","Jon Hykawy","Robert Bayliss"],"m_Companies":["Tesla Inc.","Albemarle Inc.","Lux Research Inc.","Albemarle","Frankel","Path"],"m_BiGrams":["energy storage","liion battery","grid energy","storage system","grid storage"],"m_TriGrams":["grid energy storage","energy storage system"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[16,7,6,6,3],"m_TriCnt":[6,5],"m_iDocBodyWordCnt":487}
