{"m_szDocID":"868289","m_szDocTitle":"Roof Racks are Wasting Your Gas - The Drive","m_szYear":"2016","m_szDocSumamry":"Roof Racks are Wasting Your Gas Americans buy an extra 100 million gallons of gas every year because of them. Gear Up Getty Images Roof racks reduce gas mileage. Everyone knows that. However, we never knew exactly how much extra gas Americans slurp up annually because of roof racks. According to two researchers at Lawrence Berkeley National Laboratory and the National Renewable Energy Laboratory, now we do: 100 million gallons in 2015. Their study, said to be the first of its kind , which considered the entire US light vehicle fleet and various roof rack configurations instead of individual ve","m_szDocBody":"roof rack wasting gas american buy extra million gallon gas year them gear getty image roof rack reduce gas mileage that however knew extra gas american slurp annually roof rack researcher lawrence berkeley national laboratory national renewable energy laboratory million gallon study kind considered entire light vehicle fleet roof rack configuration individual vehicle revealed finding paper called fuel consumption impact auto roof rack energy policy vantage point million gallon tiny number percent total lightduty fuel use hand checking energy emission conservation equivalent million gallon epas greenhouse gas equivalency calculator figure impressive equal tonne waste recycled landfill burning pound coal greenhouse gas emission single car driving mile electricity home entire year keeping erector set top car study author alan meier yuche predict number headed spectacularly anticipating roofrack usage explode percent consume time fuel due roof rack amount fuel expect save due hydrogen fuel cell vehicle consumption eat half expected fuel saving battery electric vehicle tesla sell model make single subaru roof rack study figure save billion gallon gasoline year design legislative approaches reducing aerodynamic impact roof rack billion gallon equivalent replacing city philadelphia forest legal approach isnt happen looniest body politic wont mandate removing roof rack arent use stay office long through rack maker decide design aerodynamic rack doesnt minute fine motor skill operation champion remove good start road test ","m_szGeo1":"","m_szSourceType":"source_news","m_szSrcUrl":"http://www.thedrive.com/gear-up/3282/roof-racks-are-wasting-your-gas","m_Places":["United States","Tesla","Subaru","Philadelphia"],"m_People":["Alan Meier","Yuche Chen"],"m_Companies":["Getty Images","Lawrence Berkeley National Laboratory","National Renewable Energy Laboratory","Epa"],"m_BiGrams":["roof rack","million gallon"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,4],"m_TriCnt":[],"m_iDocBodyWordCnt":219}
