{"m_szDocID":"868282","m_szDocTitle":"Roof racks are a drag : TreeHugger","m_szYear":"2016","m_szDocSumamry":"Roof racks are a drag Share on Facebook via Subaru Outback I used to tool around with a big Thule ski coffin on the roof of my Subaru and knew that it was costing me fuel mileage, but I assumed that when I took the box off, the roof rack itself was not a big deal. It turns out that it is; a new study by the Berkeley Lab has determined that roof racks are responsible for 0.8 percent of fuel consumption. That doesn't sound like much, but when you do the math it turns out to be 100 million gallons of gasoline every year. The press release puts this into context: Use of roof racks requires vehicle","m_szDocBody":"roof rack drag share subaru outback tool big thule ski coffin roof subaru knew costing fuel mileage assumed box off roof rack big deal turn study berkeley lab determined roof rack responsible percent fuel consumption sound much math turn million gallon gasoline year press release put context roof rack require vehicle expend energy due aerodynamic drag study impact individual vehiclesdepending configuration fuel consumption penalty percent passenger carsthis study estimate impact national level moreover roof rack projected increase national travel trend national perspective needed justify policy action author write comparison additional fuel consumption caused roof rack time larger anticipated fuel saving fuel cell vehicle percent anticipated fuel saving battery electric vehicle word removing roof rack bigger deal introducing hydrogen fuel cell car cost billion dollar infrastructure researcher roof rack designed removed easily rule researcher estimated government policy minimise unloaded roof rack admittedly extreme combination energyefficient design result cumulative saving equivalent billion gallon gasoline year policy extreme lot gas lot carbon related treehuggercom ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.treehugger.com/cars/roof-racks-are-drag.html","m_Places":["Subaru"],"m_People":[],"m_Companies":["Facebook"],"m_BiGrams":["roof rack","fuel consumption"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[9,3],"m_TriCnt":[],"m_iDocBodyWordCnt":161}
