{"m_szDocID":"868322","m_szDocTitle":"Politics as usual won’t overcome our climate challenge - MarketWatch","m_szYear":"2016","m_szDocSumamry":"JeffreyD. Sachs Columnist NEW YORK ( Project Syndicate ) — The diplomats have done their job, concluding the Paris climate agreement in December. And political leaders gathered last week at the United Nations to sign the new accord. But implementation is surely the tough part. Governments need a new approach to an issue that is highly complex, long term, and global in scale. At its core, the climate challenge is an energy challenge. About 80% of the world’s primary energy comes from carbon-based sources: coal, oil, and gas. When burned, they emit the carbon dioxide that causes global warming. ","m_szDocBody":"jeffreyd sach columnist york project syndicate diplomat job concluding paris climate agreement december political leader gathered week united nation accord implementation surely tough part government approach highly complex long term global scale core climate challenge energy challenge world primary energy carbonbased source coal oil gas burned emit carbon dioxide global warming world economy carbonfree prevent global warming running dangerously control paris agreement recognise basic fact call world cut greenhousegas emission especially netzero level half century end government prepare plan year the socalled nationally determined contribution ndc midcentury the socalled lowemission development strategy led world government attempted remake core sector world economy global scale aggressive timeline fossilfuel energy system created step step century comprehensively overhauled year country everywhere government approaches develop implement led country establishing politically independent energy agency technical expertise reason politic usual sufficient first energy system that system interconnected part technology power plant pipeline ocean transport transmission line dam land use rail highway building vehicle appliance fit working whole system overhauled small incremental step deep overhaul require systemwide reengineering ensure part continue work effectively together second large technological uncertainty moving lowcarbon energy system vehicle decarbonized batteryelectric power hydrogen fuel cell advanced biofuel coalfired power plant made safe carbon capture storage ccs nuclear energy politically acceptable safe low cost plan investment research development resolve uncertainty improve technological option third solution require international energy cooperation key fact lowcarbon energy just fossil fuel generally located ultimately used coal oil gas transported long distance wind solar geothermal hydropower moved long distance transmission line synthetic liquid fuel made wind solar power read ocean downright scary fourth powerful vested interest fossilfuel industry resisting change abundantly clear example republican party deny climate change sole reason heavily funded oil industry specy intellectual corruption political corruption its both fact energy system involve complex interconnection lead tremendous inertia shifting lowcarbon energy system require considerable planning long lead time dedicated financing coordinated action part economy including energy producer distributor residential commercial industrial consumer policy measure tax carbon emission address challenge energy transition beijing auto show debut latest electric vehicle electric vehicle make chinese car market spotlight beijing auto show photo press problem government plan year ahead typical energy policy year tend make poor systemrelated choice example energy planner move coal lowercarbon natural gas tend underinvest decisive shift renewable energy similarly opt raise fuel standard internalcombustion automobile push needed shift electric vehicle sense planning year ahead vital make correct longrun choice inform correct shortterm choice uns deep decarbonization pathway project shown longterm plan designed evaluated challenge sit easily elected politician decarbonization challenge require consistent policy year politician time horizon tenth that politician comfortable problem require largescale public private financing highly coordinated action part economy decisionmaking face ongoing technological uncertainty small wonder then politician shied challenge practical progress made framework convention climate change signed key step believe remove issue shortterm electoral politic country establishing politically independent energy agency technical expertise course key energy decision such deploy nuclear energy build transmission grid require deep public participation planning implementation free excessive partisan politic lobbying government successfully central bank political independence give energy agency leeway enable act long term global climate meeting cop marrakesh moroccos government team sustainable development solution network join partner cohost lowemission solution conference conference bring energy expert member country businesse city work highly practical approaches deep decarbonization paris climate agreement force move urgently effective implementation published permission project syndicate politic clean energy marketwatch ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.marketwatch.com/story/politics-as-usual-wont-overcome-our-climate-challenge-2016-04-27","m_Places":["New York","Paris","United States","Beijing","Morocco"],"m_People":[],"m_Companies":["United Nations","Republican Party","Associated Press","U.n.","Pathways","Central Banks","Marketwatch"],"m_BiGrams":["energy system","energy agency","lowcarbon energy","electric vehicle"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,3,3,3],"m_TriCnt":[],"m_iDocBodyWordCnt":562}
