{"m_szDocID":"870344","m_szDocTitle":"IHS Study Lays Out Challenges Hydrogen Fuel Cell Cars Face","m_szYear":"2016","m_szDocSumamry":"IHS Study Lays Out Challenges Hydrogen Fuel Cell Cars Face Hide Hydrogen fuel cell vehicles have a window of opportunity for reaching the mass market, but that window will close if it doesn’t happen soon, according to an IHS Automotive study. While plans are in place to expand fuel cell cars from three on the market today – the Toyota Mirai, Hyundai ix35/Tucson and the Honda Clarity – to 17, it’s not going to see real growth in the U.S. for a few years. The three fuel cell models are only available in California for now in the U.S. market. Most of these new models will be rolled out in Japan a","m_szDocBody":"ihs study lay challenge hydrogen fuel cell car face hide hydrogen fuel cell vehicle window opportunity reaching mass market window close doesnt happen soon ihs automotive study plan place expand fuel cell car market today toyota mirai hyundai honda clarity real growth year fuel cell model california market model rolled japan korea initially european carmaker expected leading role government emission target tougher ihs fuel cell vehicle production reach unit represent percent vehicle produced world ben scott senior analyst ihs automotive study author fuel cell window opportunity firmly stabled marketplace including advantage battery electric vehicle hydrogen fuel cell vehicle longer driving range shorter fueling time evs refuelling habit fuel cell vehicle similar conventional car customer acceptance scott said biggest stumbling block mass adoption limited refuelling infrastructure today public hydrogen station world challenge cost installing station million inexpensive charger station competitive edge also mercede bmw future emphasise fuel cell vehicle battery electric car hydrogen industrial application hydrogenpowered forklift hydrogen fossil fuel natural gas coal produce renewable source expensive tradeoff hydrogen carbon footprint cost scott said battery technology improving year put pressure fuel cell technology lithium battery improvement cost kilowatthour decreasing energy density increasing fuel cell electric vehicle year move past early adopter theyll remain niche market status scott situation fcevs mass market mobility scott ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.hybridcars.com/ihs-study-lays-out-challenges-hydrogen-fuel-cell-cars-face/","m_Places":["Toyota","Tucson","United States","California","Most","Japan","Korea"],"m_People":["Ben Scott"],"m_Companies":["Hyundai","Honda","Bmw"],"m_BiGrams":["fuel cell","cell vehicle","hydrogen fuel"],"m_TriGrams":["fuel cell vehicle","hydrogen fuel cell"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[11,5,3],"m_TriCnt":[5,3],"m_iDocBodyWordCnt":212}
