{"m_szDocID":"917793","m_szDocTitle":"Pets: The next frontier for the sharing economy? - The Washington Post","m_szYear":"2014","m_szDocSumamry":"textArticle -------------------- Pets: The next frontier for the sharing economy? The inside track on Washington politics. Be the first to know about new stories from PowerPost. Sign up to follow, and we’ll e-mail you free updates as they’re published. You’ll receive free e-mail news updates each time a new story is published. You’re all set! By Matt McFarland April 1, 2014 Follow @mattmcfarland Don’t have time to walk a dog every day? Here’s one solution. (Matt Cardy/Getty Images) Here’s a look at five ideas that affect the way we live, work and play. 1. Communal dogs. Research shows that hav","m_szDocBody":"pet frontier sharing economy inside track washington politic storey powerpost follow free update theyre published youll receive free new update time storey published youre set matt mcfarland follow dont time walk dog day here solution matt image here ideas affect live work play communal dog research show pet make happier single people work long day frequently travel dog isnt realistic solution shared pet here apartment building that jonathan oconnell communal gym pool spas game room grill roof deck like emmy communal dog named coincide building brand two emmy doghouse replica building resident busy dog pick lobby upstair apartment walk return book dvd bowling shoe climate change time vegan fast company government agreed work limiting global greenhouse gas emission temperature rise degree celsius degree fahrenheit consensus kind temperature increase wreak significant havoc since scientist shown degree higher environmental social cost previously thought study published climatic change trio scandinavian researcher show reducing meat dairy consumption twodegree goal impossible year important succeed tesla chief executive elon musk gave excellent interview minute sunday explained initially felt tesla fail addressing misperception electric car here full segment walmart carbon fibre truck mashable dubbed walmart advanced vehicle experience wave fuelefficient truck part company larger commitment sustainability walmart promised double efficiency fleet tractor trailersand driver now year later retailer claim achieved improvement fleet efficiency baseline government provide internet access susan crawford explain vox public option internet internet electricity road grid private market doesnt provide left device theyll systematically provide extraordinarily expensive service richest people america leave huge percentage population and general make profit expense social good freddie grey case ","m_szGeo1":"United Kingdom","m_szSourceType":"source_news","m_szSrcUrl":"https://www.washingtonpost.com/news/innovations/wp/2014/04/01/pets-the-next-frontier-for-the-sharing-economy/","m_Places":["Washington","Connell","Tesla","America"],"m_People":["Matt Mcfarland","Matt Cardy","Elon Musk","Susan Crawford"],"m_Companies":["Getty Images","Fast Company","Climatic Change","Wal-mart","Via Mashable","Walmart"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":261}
