{"m_szDocID":"918830","m_szDocTitle":"Is Tesla Stock Going to Keep Rising? Elon Musk Reassured Investors in February | Inverse","m_szYear":"2013","m_szDocSumamry":"textArticle -------------------- Is Tesla Stock Going to Keep Rising? Elon Musk Reassured Investors in February Model 3 hype and reservations have really boosted the EV company's stock. share Back in February, Inverse listened in on the Tesla investors’ call. CEO Elon Musk did his job well, reassuring investors that his electric vehicle company was doing just fine , and even promising that 2016 would prove a big year. Musk, it turns out, was not misleading those investors. Ever since that phone call, Tesla stock ($TSLA) has continued to steadily climb. In the just under two months that have pa","m_szDocBody":"tesla stock rising elon musk reassured investor model hype reservation boosted company stock share back february inverse listened tesla investor call ceo elon musk job well reassuring investor electric vehicle company fine promising prove big year musk turn out misleading investor phone call tesla stock tsla continued steadily climb month passed call stock jumped share lowest late the regrettinged math simple here youd bought share back then youd grand richer grand model reservation cost youd bought share then youd grand richer grand onethird model total cost cetera revitalised climb began day reservation opened model day share model massmarket version luxurious model start tax incentive modular meaning final price higher average musk think people select option bring total affordableyetluxurious electric vehicle turning head way teslas generate hype iphone did middle manhattan workday people lined reserve model brooklyn people camped out every peak valley something hype musk generate sneaky allusion head continue turn head continue turn tesla stock continue rise musk think shorting tesla stock unwise suggesting isnt expecting downturn anytime soon elon musk time scepticism tesla notoriously struggled meet production quotas pace demand tesla model reservation blowing musk expectation water hes admitted rethink production strategy stock continue inflate with natural depression tossed mix important date case tesla pace photos getty image datemeta ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.inverse.com/article/13836-is-tesla-stock-going-to-keep-rising-elon-musk-reassured-investors-in-february","m_Places":["Tesla","Manhattan","Brooklyn"],"m_People":["Elon Musk"],"m_Companies":["Twitter","Getty Images"],"m_BiGrams":["tesla stock","elon musk"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":211}
