{"m_szDocID":"920736","m_szDocTitle":"Japan has more electric car charging stations than gas stations","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Japan has more electric car charging stations than gas stations 0 Tibi Puiu While most of the world is sluggish about EVs, Japan seems to be light years ahead. The island state’s pro-electric car incentives have paid off and it’s never been easier for a Japanese to drive an electric car. Officially, there are now more charging stations than gas stations in the country. The biggest problems the market has with EVs have to do with price, autonomy and infrastructure. Today, you can buy an electric car for as little as $22,000, in the case of Mitsubishi i-MiEV, or ","m_szDocBody":"japan electric car charging station gas station tibi puiu world sluggish evs japan light year ahead island state proelectric car incentive paid easier japanese drive electric car officially charging station gas station country biggest problem market evs price autonomy infrastructure today buy electric car case mitsubishi imiev case teslas roadster autonomy long ceased problem vehicle log mile charge infrastructure lacking though japan north south west east country rising sun littered chademo quick charger count vastly superior station installed europe measly united state factor talking island state lot smaller two clear japan ahead pack combined lower level charging station public private number add dedicated charging station evs nissan gas station japan big caveat charging station privately owned people garage gas station public reason critic dismissed nissan report miss thesharing economy train uber share ride airbnb share home service finally people share charger service indistinguishable public airbnb apartment indistinguishable hotel moreover public highspeed charging station expected online japan tesla motor supercharger network form bulk station found united state company open japan hype not japan shining light market follow ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://www.zmescience.com/science/news-science/japan-charging-stations/","m_Places":["Japan","Tesla","Europe","United States"],"m_People":[],"m_Companies":["Uber","Airbnb","Tesla Motors"],"m_BiGrams":["charging station","gas station","electric car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,4,3],"m_TriCnt":[],"m_iDocBodyWordCnt":176}
