{"m_szDocID":"937802","m_szDocTitle":"Fuel Economy and Green Cars","m_szYear":"2014","m_szDocSumamry":"Edmunds.com Price Promise℠ Get instant savings Make Tell us what Make you're looking for. Model Oops! First tell us what Make you're interested in. Year Oops! First tell us what Make you're interested in. Car Type Tell us what Type of Car you're interested in. SUV Sedan Truck Minivan Convertible Coupe Wagon Luxury Hybrid/Electric Crossover Hatchback Diesel New Cars Used Cars What's My Car Worth Car Research New Cars Car Finder Compare New Cars Find a Dealer Incentives & Rebates Calculators Used Cars Trade-In Value & Pricing Certified Cars Selling Tips Car Reviews Tips & Advice What's Hot Car V","m_szDocBody":"edmundscom price promise instant saving make make for model oop make interested year oop make interested car type type car interested suv sedan truck minivan convertible coupe waggon luxury crossover hatchback diesel car car car worth car research car car finder compare car dealer incentive rebate calculator car tradein pricing certified car selling tip car review tip advice hot car videos car forum car list account price drop alert found recently dropped price price drop receive future price drop notification home car tip advice fuel economy green car share advertisement fuel economy green car buying leasing selling insurance safety car technology driving tip advertisement advertisement fuel economy green car match epa rating epas city mpg rating longterm volvo car mpg sacrifice fuel economy buy car plenty mpgplus car today market electric range ballpark gathering drive data chevrolet volt meaningful number range gasengine mpg driver early result mile gasoline switchover fuel economy green car article fuel economy green car article debunking alternative fuel myth home charger plugin car hydrogen fuelcell car car mpg electric car comparison test electric car cost testing electric vehicle real world reduce electric car charging cost electric charging station etiquette plugin car fuel economy focus aerodynamic engine stopstart system save fuel low cost coming alternative vehicle myth stick shift californias zeroemission mandate alter car landscape mpg challenge californias zeroemission mandate alter car landscape hybrid battery controversial fuel blend fuelefficient ecodriving tip desert racer realworld mpg match epa rating good bad new emerge cafe fine print way cafe standard affect faq corporate average fuel economy standard fuelsipper smackdown car fuel economy ins out electric vehicle tax credit epa unveil fuel economy label latest video videos advertisement car tip advice advertisement advertisement calculator calculator gas guzzler tradein calculator money save trade gas guzzler fuelefficient car gas guzzler maintenance cost recall calculate maintenance cost recall notice technical service bulletin vehicle select vehicle true cost calculate cost vehicle year select vehicle car buying guide car truck editor recommend sedan minivan suv convertible truck buying guide car list advertisement edmund edmund car buying guide car rating compare popular vehicle hot advertisement car calculator car finder compare car dealer auto loan calculator incentive rebate true cost car appraise car certified car selling tip true cost car research hot car review road test tip advice longterm road test car videos dealer rating review maintenance visited make toyota ford honda chevrolet nissan bmw mazda hyundai mercedesbenz volkswagen audi lexus dodge jeep subaru acura kia infiniti gmc cadillac chrysler volvo mitsubishi buick porsche land rover lincoln jaguar scion mini tesla suzuki ram fiat smart contact career affiliate programme dealer centre privacy statement visitor agreement membership agreement choice map glossary mobile developer follow edmund edmundscom inc","m_szGeo1":"United States","m_szSourceType":"source_general","m_szSrcUrl":"http://www.edmunds.com/fuel-economy/","m_Places":["United States","Best","California","Most","Toyota","Subaru","Lincoln","Tesla","Mobile"],"m_People":["48.2 Ev Miles"],"m_Companies":["Edmunds.com","Diesel","Epa","Mpg","Volvo S60","Real","Landscape","Ins","Honda","Bmw","Mazda","Hyundai","Mercedes-benz","Volkswagen","Audi","Infiniti","Cadillac","Volvo","Land Rover","Jaguar","Suzuki","Edmunds.com, Inc."],"m_BiGrams":["fuel economy","economy green","green car","tip advice","car buying","electric car","gas guzzler","true cost","buying guide","guide car"],"m_TriGrams":["fuel economy green","economy green car","buying guide car"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[10,5,5,4,3,3,3,3,3,3],"m_TriCnt":[5,5,3],"m_iDocBodyWordCnt":448}
