{"m_szDocID":"945307","m_szDocTitle":"Silicon Investor: Technology Stocks | Stock Discussion Forums","m_szYear":"2016","m_szDocSumamry":"SI Home Discover Site Forums About Terms of Use Privacy Policy Copyright/IP Policy Contact Us About Us FAQ Sign In Mail    You are not logged in. Login Not a Member? Register - its easy and free SubjectMarks  You are not logged in. Login Not a Member? Register - its easy and free PeopleMarks You are not logged in. Login Not a Member? Register - its easy and free Tools Portfolio Search Subjects   Public Messages   Members   Member Profiles   My Private Messages   Quote / Chart / News  STOCKTALK MARKETS POLITICS PASTIMES Techstocks Biotech Non-Tech Gold/Mining/Energy Microcap Strategies Find Boa","m_szDocBody":"home discover forum term privacy policy policy contact faq mail logged member easy free subjectmark logged member easy free peoplemark logged member easy free tool portfolio subject public message member member profile private message quote chart new stocktalk market politic pastime techstock biotech nontech microcap strategy board quote active computer software communication semiconductor web subject ticker price chg moderated total reply recent message reply day submk day apple inc aapl clean hour ago technology stock market talk don wolanchuk qqq dacheif minute ago qualcomm moderated thread read rule posting qcom slacker hour ago wennerstrom semi equipment analysis sox donald wennerstrom minute ago oled universal display corp oled slacker yesterday new frank coluccio technology forum ftth advanced micro device moderated amd amd elmer phud yesterday amd armh intc nvda amd neolib yesterday tesla evs tsla tsla savant yesterday research frontier refr refr aknahow yesterday mellanox technology ltd mlnx twitter inc twtr glenn petersen yesterday drone autonomous vehicle glenn petersen yesterday wdc nand nvm enterprise storage system etc wdc sam amazoncom inc amzn amzn clean infinera infn fubho yesterday facebook inc glenn petersen yesterday globalstar telecommunication limited gsat gsat microsoft corp moderated msft msft don green yesterday linkedin corporation lnkd yesterday alibaba holding limited baba glenn petersen yesterday flyht aerospace solution ltd flyv sultan rfid nfc technology media industry newspaper radio movy online sam citron googl urlman cohu inc cohu cohu yesterday electric car mpg what worry eric yesterday corporation wdc clean cavium cavm sequan communication sqn fubho kvh industry inc kvhi walter baidu bidu bidu hour ago silicon motion inc simo simo hour ago apple inc unmoderated aapl hour ago network security doren blue coat inc bclt glenn petersen bbry blackberry fka rimm research motion bbry eric crisis sharing peertopeer ondemand economy glenn petersen vuzix corporationvuzia visionary pick vuzi richardred gbtc bitcoin investment trust not etf otcqx gbtc urlman hour ago technology fubho yesterday gopro hero gpro fubho turtle beach corp hear savant qualcomm coming buy range qcom manalagi applied material nopolitic thread amat amat armour inc jakestraw network inc ffiv ffiv verifone holding inc pay pay jakestraw printing ddd fubho mchp microchip technology inc mchp lrad long range acoustic device lrad asml holding asml yesterday electronic art yesterday cloud computing ondemand software service glenn petersen window phone msft zax cypress semiconductor western digital wdc wdc eric apple tankwatch aapl zax microvision mvis mvis verint system inc vrnt dynamo hum lendingclub corp nonbank online lending glenn petersen wilan inc twin wiln nicmar vasco data security vdsi vdsi eght eght yahoo yhoo black box stock making sense day trading blbx fxowen salesforcecom crm led light bulb manufacturing robert furman impinj inc cooter full disclosure trading sox jerome dell dell brook automation brk oracle corporation orcl orcl tivo tivo interactive tivo netflix nflx nflx nviv novra technology inc nviv jrod nflx moderated thread nflx jbc cree inc cree esev estec system corp esev jrod splunk splk ljm invensense invn invn brokenstne nimble storage nmbl jakestraw cisco system inc csco csco lynn gridline communication camber mitek system mitk mitk azz azz incorporated azz csc computer science corp csc hewlettpackard hpq hpq lynn verizon communication feye feye guy gadois virtual reality fubho swk skywork solution was ahaa swk kopin corp kopn kopn opportunity mgt mgt nickholder american superconductor amsc amsc smartphone tablet wearable gadget goog fubho checkfree holding corp ckfr dell intel ckfr fitbit device fit track innovation ltd otiv otiv jakestraw flower giftscominc nasdaq pcfg stratasy ssy ssy zenith zethq sierra wireless inc swir swir activisionreturn atvi discover silicon investor subject hot subject recommended poll firehose home mail hot subjectmark peoplemark keeper setting termsofuse contactus privacypolicy aboutus faq advertise copyright knight sac media right reserved stock quote delayed minute term use","m_szGeo1":"","m_szSourceType":"source_general","m_szSrcUrl":"http://www.siliconinvestor.com/home.aspx?forumid=101","m_Places":["Us","Most","Tesla","Baba","Cooters","Brooks"],"m_People":["Don Wolanchuk","Donald Wennerstrom","Frank Coluccio Technology","Elmer Phud","Glenn Petersen","Sam Citron","Guy Gadois"],"m_Companies":["Apple Inc.","Qualcomm","Universal Display Corp","Advanced Micro Devices","Amd","Amd 4.40","Research Frontiers","Refr","Mellanox Technologies, Ltd.","Twitter, Inc.","Wdc","Amazon.com, Inc.","Amzn","Facebook, Inc.","Globalstar Telecommunications Limited","Microsoft Corp.","Linkedin Corporation","Alibaba Group Holding Limited","Flyht Aerospace Solutions Ltd.","Media Industries","Google","Cohu, Inc.","Cohu","Mpg","Sandisk Corporation","Kvh Industries, Inc.","Silicon Motion Inc.","Simo","Apple, Inc.","Blue Coat Inc.","Bclt Glenn Petersen","Blackberry","Research In Motion","Vuzix Corporation","Investment Trust","Gopro","Turtle Beach Corp","Applied Materials","Under Armour, Inc.","Ua","F5 Networks, Inc.","Ffiv","Microchip Technology Inc.","Asml Holding Nv","Electronic Arts","Ea","Cypress Semiconductor","Cy","Western Digital","Apple","Microvision","Mvis","Verint Systems Inc.","Hum","Lendingclub Corp","Wi-lan Inc.","Yahoo","Salesforce.com","Dell Dell","Oracle Corporation","Orcl","Tivo","Netflix","Nflx","Novra Technologies Inc.","Cree Inc.","Estec Systems Corp.","Splunk","Nimble Storage","Cisco Systems, Inc.","Csco","Azz Incorporated","Csc","Computer Sciences Corp","Hewlett-packard","Hpq","Verizon Communications","Vz","Skyworks Solutions, Inc","Kopin Corp.","Kopn","American Superconductor","Amsc","Checkfree Holdings Corp.","Ckfr","Dell","Intel","Fitbit","On Track Innovations Ltd.","Otiv","Gifts.com,inc","Nasdaq","Stratasys","Ssys","Sierra Wireless, Inc.","Swir","Activision","Silicon Investor","Knight Sac"],"m_BiGrams":["glenn petersen","hour ago","petersen yesterday","logged member","member easy","easy free"],"m_TriGrams":["glenn petersen yesterday","logged member easy","member easy free"],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[8,6,4,3,3,3],"m_TriCnt":[4,3,3],"m_iDocBodyWordCnt":616}
