{"m_szDocID":"974063","m_szDocTitle":"Could U.S. Shale Oil Companies Be The Next Coal Companies In Time? | Seeking Alpha","m_szYear":"2010","m_szDocSumamry":"textArticle -------------------- Could U.S. Shale Oil Companies Be The Next Coal Companies In Time? Jul. 17, 2015 10:30 AM ET | Send Message Summary U.S. coal has been destroyed as an investment due to a higher dollar, increased competitive supply, high debt loads, and structural demand changes. The same four issues face U.S. shale oil companies -- the \"losers\" at the energy card table. Debt loads will soon become front page issues. Oil declining in the summer months is a highly bearish confirmation. Expect an acceleration as we approach the lower-demand fall. I have previously written about h","m_szDocBody":"shale oil company coal company time jul send message summary coal destroyed investment due higher dollar increased competitive supply debt load structural demand change issue face shale oil company loser energy card table debt load front issue oil declining summer month highly bearish confirmation expect acceleration approach lowerdemand fall previously written recommend euro investment based continuing strong dollar witnessed unbelievable destruction and international coal company case stock price actual company confess attempted pick bottom company time goodness stop losse awe chart sheer destruction alpha natural anr anr data ychart peabody btu thought bluechip imagined btu data ychartsbhp data ychart mind destruction context record usage coal commodity power electricity usage world falling big question similar scenario starting manifest oil debtladen shale producer noted seeking alpha richard zeit wrote mustread shale oil footstep shale gas angle consider examine point made introduction applied secular coal line future shale oil higher dollar pressuring commodity including oil making oil comparatively expensive than say canadian oil cost borne cheaper canadian dollar question euro nysearca fxe breaking european continue sick member eurozone alive life support federal reserve verbally ready discuss normalising policy chairwoman yellen recently quoted raise interest rate fxc data ychart increased competitive supply welldocumented increased production canadian oil sand more viable collapsing canadian dollar saudi arabia pumping fullout protect market share enough shale face prospect recent iran nuclear deal bringing iranian oil back market coming month count drastic fall production salvage oil pricing either logical make sense break viewed len motivated selfinterest short individual shale oil producer cutting production helping competitor maintain production chance survival simple game theory outcome strategy saudi arabia chosen maximise production protect share and attempt service debt shale case delay individual moment reckoning debt covenant applicable producer funded drilling programme doubt lender happy producer question simply suspending production debt load put dent yield issuance scenario shale company borrowed billion develop project alone david einhorn shorted pioneer natural nyse pxd prepared detailed presentation sector debt load cash burn structural demand change intermediate term issue oilfired power plant replaced dirt cheap natural gas which competitor falling ratio favour gas nysearca ung ung data ychart major demand factor affecting intermediate term least slow moribund economy worldwide recessionary region growth painfully slow south america europe slowing china well rise solar power electric vehicle incipient stage effect structural secular change solar continue explode electric car infancy continue share older european population driving less american mile capita driven continue fall partly due older population partly due lower spending prosharing economy greater desire live urban walkable setting smaller environmental footprint type this crude nysearca uso breaking recent consolidation sharp fall area expect nearterm test break key support level firmly traded commodity related stock year stock lead commodity examining stock question straight down hold core short position whiting nyse wll continental nyse clr risk including linco line pioneer wll data ychart conclude positive note examine largest winner scenario lower intermediate least oil price answer ly country spend largest percentage budget energy country india nysearca epi country believe greatest secular growth storey planet decade long india position lower oil price reduce rate inflation country inflation facilitate faster growth rate jul jul ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"http://seekingalpha.com/article/3333785-could-u-s-shale-oil-companies-be-the-next-coal-companies-in-time","m_Places":["United States","Saudi Arabia","Iran","South America","Europe","China","Whiting","India"],"m_People":["Richard Zeits","David Einhorn"],"m_Companies":["U.s. Shale Oil Companies","Coal Companies","Awe","Peabody","Btu","U.s. Federal Reserve","Pioneer","Uso","Continental"],"m_BiGrams":["shale oil","data ychart","debt load"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[5,5,4],"m_TriCnt":[],"m_iDocBodyWordCnt":521}
