{"m_szDocID":"974782","m_szDocTitle":"Car Wars: Can the phantom menace win or will the empire strike back? - The Washington Post","m_szYear":"2015","m_szDocSumamry":"textArticle -------------------- Car Wars: Can the phantom menace win or will the empire strike back? The inside track on Washington politics. Be the first to know about new stories from PowerPost. Sign up to follow, and we’ll e-mail you free updates as they’re published. You’ll receive free e-mail news updates each time a new story is published. You’re all set! By Bhaskar Chakravorti October 19, 2015 Follow IBGC_Fletcher The car industry may get turned upside down as tech companies enter the mobility space. (Toby Melville/Reuters) The auto industry is on a collision course with the forces of ","m_szDocBody":"car war phantom menace win empire strike back inside track washington politic storey powerpost follow free update theyre published youll receive free new update time storey published youre set bhaskar chakravorti follow ibgcfletcher car industry turned upside tech company enter mobility space toby auto industry collision force digital disruption movie before all centuryold industry collided crumbled collision may however different force complex side kodak blockbuster force change constitute phantom menace car war saga driverless car google alphabet obsession selfdriving car uber cleaning carnegie mellon national robotic engineering centre staff multiple highprofile attacker seeking displace human steering wheel digital phantom combustionless car traditional internal combustion engine single important source half carbon monoxide nitrogen oxide quarter hydrocarbon emitted concern impact climate change spurred interest electric hybrid alternative helped teslas envyinducing model passed unit sale new apple launch electric vehicle less car idea car ownership oldfashioned first carsharing zipcar sharing economy full swing uber lyft regional variant didi kuaidi china ola india bla bla car france the rise connected car idea car selfcontained pod revisited smarter car could instead sense surrounding and turn feed data back environment integral part smart city already million line code highend car today code age datagenerating vehicle efficient urban decisionmaking here dont forget drone delivery drone approved federal aviation administration occurred year wise county virginia flirtey australian dronedelivery startup wonder muchoverused phrase creative destruction due turbocharged makeover applied auto business win aftermath status quo formidable love affair car forever jen american love car percent worker work car vast majority driving alone crossed trillion dollar revenue strong growth china emerging market traditional auto industry hefty incumbent credit automaker embraced change comment massive change daunting opportunity disruptor protagonist phantom menace mary barra chief executiveof general motor time heard company founded aspiring disruptor attempting score bit fleet selfdriving plugin gaselectric hybrid chevrolet volt equipped sensor technology precision mapping artificial intelligence round warren mich campus major auto company mercede bmw volkswagen honda nissan ford made trek silicon valley breathe magic create breakaway unit experimented big bang approaches toyota example preparing launch hydrogenpowered sedan enough toyota filed patent flying car balance industry plenty innovation collecting side collision dark side empire major problem first perennial challenge incumbent organisational antibody reject ideas business model built existing paradigm car company different manager reluctant prioritise unproven future alternative profitgenerator form defensiveness served industry well case rock past week volkswagen embroiled scandal diesel car equipped software fake emission data long tradition industry creatively bypass regulatory environmental measure time incident occur set car company back take focus innovation indeed newly appointed chief executiveof volkswagen matthias mueller declared dont smartphone wheel reversal plan announced earlier predecessor hope outcome collision hope fundamental unmet addressed well caught big thing one automotive transport highly inefficient societal level americas driver whiled billion hour stuck traffic texas a&m transportation institute inrix hour year rushhour commuter average billion wasted time fuel year hope sharing economy make dent problem driverless car dont exacerbate second losse car move world health organisation road traffic accident eighth leading death globally killing child minute region affected challenge subsaharan africa road death expected increase percent world bank report crashes estimated cost african country percent gnp year proponent driverless car talked benefit term reduced traffic accident unfortunately innovation targeted world safest road planning driverless car subsaharan africa risk auto innovation unintended consequence ridesharing price rival city subway bus fare end starving public transit system research essential areas say robotic starved selfdriving car wend silicon valley robot can yet mimic human hand greater unmet society age hope science engineering talent spared uber solve other larger problem meantime watch epic saga playing you phantom menace collision itself lexus rxh outfitted selfdriving technology rearended tesla model summer crash corner shoreline boulevard school mountain view fitting reminder car industry real crossroad driving year freddie grey case ","m_szGeo1":"United States","m_szSourceType":"source_news","m_szSrcUrl":"https://www.washingtonpost.com/news/innovations/wp/2015/10/19/car-wars-can-the-phantom-menace-win-or-will-the-empire-strike-back/?wprss=rss_business","m_Places":["Washington","Saga","Tesla","China","Ola","India","France","Wise County, Virginia","United States","Warren, Mich.","Silicon Valley","Toyota","America","Mountain View"],"m_People":["Toby Melville","Didi Kuaidi","Jens Kalaene","Mary Barra","Matthias Mueller"],"m_Companies":["Reuters","Kodak","Blockbuster","Google","Uber","Carnegie Mellon","Apple","Zipcar","Lyft","Facebook","Federal Aviation Administration","Epa","General Motors","Bmw","Volkswagen","Honda","Diesel","Indeed","Texas A&m Transportation Institute","World Health Organization","2020","Subway"],"m_BiGrams":["phantom menace","driverless car"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[4,4],"m_TriCnt":[],"m_iDocBodyWordCnt":629}
