{"m_szDocID":"975122","m_szDocTitle":"LeTV sponsors think tank championing 'sharing finance' - China.org.cn","m_szYear":"2015","m_szDocSumamry":"LeTV sponsors think tank championing 'sharing finance' E-mail China Daily,  November 30, 2015 Adjust font size: LeTV is making greater investments in electric vehicle charging facilities. [Photo/China Daily]  LeTV Holdings Co Ltd is making its latest foray into Internet-based finance sector by launching a think tank. Global Sharing Finance 100 Forum, a LeTV-sponsored think tank, was launched in Beijing on Saturday, drawing a host of financial regulators, bankers in established financial institutions and emerging e-finance companies, and top academics as its 100-strong panel. The team includes ","m_szDocBody":"letv sponsor tank championing sharing finance china daily adjust font size letv making greater investment electric vehicle charging facility daily letv holding making latest foray internetbased finance sector launching tank global sharing finance forum letvsponsored tank launched beijing saturday drawing host financial regulator banker established financial institution emerging efinance company top academic strong panel team include overseas expert launch tank mark internet giant latest effort expand internetbased finance sector letv conglomerate online videostreaming service aggressively expanding territory consumer electronic electric vehicle sport carhailing efinance sector operate ecommerce platform thirdparty online payment company remain small player compared efinance titan alibaba holding tencent holding ltd mid letv shocked industry successfully poaching yongli vicegovernor bank china ltd veteran banker widely industry wang senior vicepresident letv holding ceo letv finance advocate shaking traditional banking technology saturday event endorsed concept sharing finance matched financial service needed provider traditional intermediary sharing finance put forwarded chinese economist yao yudong dean financial research institute people bank china tao financial researcher chinese academy social science word inspired sharing economy concept win huge popularity success uber airbnb stressed sharing finance concept encompassing innovation peertopeer lending crowdfunding mutual insurance word internetbased finance highlight technological feature understate essence finance internetera global sharing finance forum colaunched china academy supplyside economic modern banker magazine follow chinaorgcn join conversation ","m_szGeo1":"China","m_szSourceType":"source_news","m_szSrcUrl":"http://www.china.org.cn/business/2015-11/30/content_37194446.htm","m_Places":["Beijing","Yao","China"],"m_People":["Wang Yongli","Yang Tao"],"m_Companies":["China Daily","Letv Holdings Co Ltd","Alibaba Group","Tencent Holding Ltd.","Bank Of China Ltd","Research Institute","People's Bank Of China","Chinese Academy Of Social Sciences","Uber","Airbnb","Twitter","Facebook"],"m_BiGrams":["sharing finance","internetbased finance"],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[6,3],"m_TriCnt":[],"m_iDocBodyWordCnt":214}
