{"m_szDocID":"976266","m_szDocTitle":"Our future: utopia or dystopia? | Toronto Star","m_szYear":"2016","m_szDocSumamry":"textArticle -------------------- Our future: utopia or dystopia? Mon., May 16, 2016 Re: ‘Same-old’ innovation policies won’t do, May 7 Boy, I can’t wait until I am able to kick back from my computer after a hard day earning virtual money by producing virtual products or services. Of course, my computer will be either organic – since we have “evolved” from a resource-based economy – or produced offshore by a country that still actually makes things and shipped here on a solar-powered ship and freight train and dropped on my balcony by a drone even before I knew I wanted it. My home will be made","m_szDocBody":"future utopia dystopia mon sameold innovation policy wont boy wait kick back computer hard day earning virtual money producing virtual product service course computer organic evolved resourcebased economy produced offshore country make shipped solarpowered ship freight train dropped balcony drone knew wanted home made whoknowswhat the end resourcebased again water bartered innovative neighbour electricity communityowned microgrid course connected national grid without continued safe drinking water terawatt electricity run masse possibly wrong made peertopeer sharingeconomy made public service collapsed longer paid taxe virtual sharingearned income fondly remember day reward drive family cottage way autonomous tractor working piece guarded arable land remaining alas selfdriving car built printer rented couldnt navigate rough twisty cottage road didnt drive manually beside vacation country crumbled back nature people lived resourcebased economy built electric car wanted part beside electric car winter barely city country turned huge support system handful megacity devoid people isnt flooded hydro dam cleared solar wind farm spite rooftop solar panel city continue consume energy produce observe landscape flatter valley filled solid waste city course say expect put here satisfy biking park liveworkplay neighbourhood strange material bike made from barbeque len aitchison tiny mon datemeta ","m_szGeo1":"Canada","m_szSourceType":"source_news","m_szSrcUrl":"https://www.thestar.com/opinion/letters_to_the_editors/2016/05/16/our-future-utopia-or-dystopia.html","m_Places":[],"m_People":["Aitchison, Tiny"],"m_Companies":["Utopia","Len"],"m_BiGrams":[],"m_TriGrams":[],"m_SocialTags":[],"m_Topics":[],"m_Industry":[],"m_Technology":[],"m_BiCnt":[],"m_TriCnt":[],"m_iDocBodyWordCnt":191}
